const video = document.querySelector('.video-background');

const swiperText = new Swiper('.swiper', {
  direction: 'vertical',
  speed: 2000,
  simulateTouch: false,
  pagination: {
    el: '.swiper-pagination',
    clickable: true
  },
  navigation: {
    prevEl: '.swiper-button-prev',
    nextEl: '.swiper-button-next'
  },
  loop: false,
  // autoplay: {
  //   delay: 5000,
  //   disableOnInteraction: true
  // }
});
// Функция для обновления и запуска видео
function updateVideoTime() {
  video.currentTime = (video.duration / swiperText.slides.length) * swiperText.realIndex;
  video.play(); // Запустить воспроизведение видео
}

// Обработчик события для окончания видео
video.addEventListener('ended', () => {
  video.currentTime = 0; // Устанавливаем время на начало
  video.play(); // Запускаем воспроизведение заново
});

// Обработка смены слайда
swiperText.on('slideChange', function() {
  updateVideoTime(); // Устанавливаем видео в соответствующее время при смене слайда
});

// Обработка событий для начала воспроизведения видео при загрузке
video.addEventListener('loadedmetadata', () => {
  updateVideoTime(); // Устанавливаем текущее время видео при загрузке
});

// Добавление классов для анимации при переходах
swiperText.on('slideChangeTransitionStart', function() {
  video.classList.add('change');
}).on('slideChangeTransitionEnd', function() {
  video.classList.remove('change');
});

// Обработчик событий для клавиатуры
document.addEventListener('keydown', function(event) {
  if (event.key === 'ArrowUp') {
    swiperText.slidePrev(); // Переход к предыдущему слайду
    updateVideoTime(); // Обновляем видео при переходе на предыдущий слайд
  } else if (event.key === 'ArrowDown') {
    swiperText.slideNext(); // Переход к следующему слайду
    updateVideoTime(); // Обновляем видео при переходе на следующий слайд
  }
});


const holidays = [
  { date: "2024-01-01", name: "Новый год", country: "Англия" },
      { date: "2024-03-01", name: "День святого Давида", country: "Англия" },
      { date: "2024-04-21", name: "День рождения Елизаветы 2", country: "Англия" },
      { date: "2024-05-06", name: "Праздник весны в Англии", country: "Англия" },

      { date: "2024-10-31", name: "Хэллоуин", country: "Англия" },
      { date: "2024-11-05", name: "Ночь Гая Фокса", country: "Англия" },
      { date: "2024-12-25", name: "Рождество в Англии", country: "Англия" },
      { date: "2024-12-26", name: "День подарков", country: "Англия" },
      

      { date: "2024-06-16", name: "День отца в Англии", country: "Англия" },

      { date: "2024-09-29", name: "День святого Михаила", country: "Англия" },
      { date: "2024-10-01", name: "Международный день пожилых людей", country: "Англия" },
      { date: "2024-02-14", name: "День святого Валентина", country: "Англия" },
      { date: "2024-05-08", name: "Фестиваль пива", country: "Англия" },
      { date: "2024-12-31", name: "Старый Новый год", country: "Англия" },
      { date: "2024-01-25", name: "День Роберта Бернса", country: "Англия" },
  { date: '2024-01-01', name: 'Васильев день', country: 'Болгария' },


  
  { date: '2024-01-01', name: 'День освобождения, Триумф революции', country: 'Куба' },
  { date: '2024-01-01', name: 'День Конституции(Италия)', country: 'Италия' },
  
  { date: '2024-01-01', name: 'День образования Словацкой республики', country: 'Словакия' },
  { date: '2024-01-01', name: 'День восстановления независимого чешского государства', country: 'Чехия' },
  { date: '2024-01-01', name: 'День независимости Камерун', country: 'Камерун' },
  { date: '2024-01-01', name: 'День независимости(Судан)', country: 'Судан' },
  { date: '2024-01-01', name: 'День флага Литвы', country: 'Литва' },

  { date: '2024-01-01', name: 'День банковских и финансовых работников', country: 'Беларусь' },
  { date: '2024-01-01', name: 'День суверенитета Ирака', country: 'Ирак' },
  { date: '2024-01-01', name: 'День независимости в Гаити', country: 'Гаити' },
  { date: '2024-01-02', name: 'Куриное Рождество', country: 'Черногория' },
  { date: '2024-01-02', name: 'Карнавальный день', country: 'Сент-Китс и Невис' },
  { date: '2024-01-02', name: 'Карнавал енотов «Капсе-Клопсе»', country: 'ЮАР' },
  { date: '2024-01-02', name: 'Праздник «Такаи»', country: 'Ниуэ' },

  { date: '2024-01-02', name: 'День матери(Иран)', country: 'Иран' },
  { date: '2024-01-02', name: 'День зимнего солнцестояния', country: 'Бутан' },


  { date: '2024-01-03', name: 'Фестиваль «Тамасесери»', country: 'Япония' },
 
  { date: '2024-01-03', name: 'День революции в Буркине-Фасо', country: 'Буркина-Фасо' },
  { date: '2024-01-03', name: 'День памяти борцов Освободительной войны', country: 'Эстония' },

  { date: '2024-01-04', name: 'День кавалерии(Тайланд)', country: 'Тайланд' },
  { date: '2024-01-04', name: 'День мучеников независимости', country: 'Конго' },
  { date: '2024-01-04', name: 'День независимости(Мьянма)', country: 'Мьянма' },
  { date: '2024-01-04', name: 'День огони', country: 'Нигерия' },
  { date: '2024-01-04', name: 'День мучеников колониальных репрессий', country: 'Ангола' },
  
 
  { date: '2024-01-05', name: 'День работников социальной защиты(Беларусь)', country: 'Беларусь' },


  

 
  { date: '2024-01-05', name: 'Народный праздник «Туциндан»', country: 'Сербия' },
  { date: '2024-01-05', name: 'Фестиваль льда и снега', country: 'Китай' },
  { date: '2024-01-06', name: 'День вооружённых сил Ирака', country: 'Ирак' },
  { date: '2024-01-06', name: 'День медсестры', country: 'Мексика' },
 
  { date: '2024-01-06', name: 'День Патет Лао', country: 'Лаос' },

  { date: '2024-01-06', name: 'День марунов', country: 'Ямайка' },

  { date: '2024-01-06', name: 'Йорданов день', country: 'Болгария' },
  { date: '2024-01-06', name: 'Звёздный день', country: 'Латвия' },
  { date: '2024-01-06', name: 'Маленькое Рождество', country: 'Ирландия' },
  { date: '2024-01-06', name: 'Праздник полнолуния «Дурутху»', country: 'Шри-Ланка' },


  { date: '2024-01-07', name: 'День богини Сехмет', country: 'Египет' },
  { date: '2024-01-07', name: 'День флага(Италия)', country: 'Италия' },
  { date: '2024-01-07', name: 'День победы над геноцидом(Камбоджа)', country: 'Камбоджа' },
  { date: '2024-01-07', name: 'День пионеров', country: 'Либерия' },
  { date: '2024-01-07', name: 'День поминовения усопших в Армении', country: 'Армения' },
  { date: '2024-01-07', name: 'День Конституции в Гане', country: 'Гана' },
  { date: '2024-01-07', name: 'Праздник семи трав «Дзиндзицу»', country: 'Япония' },
  { date: '2024-01-07', name: 'Фестиваль Чакарера', country: 'Аргентина' },
  { date: '2024-01-08', name: 'День рождения Ким Чен Ына', country: 'КНДР' },
  { date: '2024-01-08', name: 'День галактики', country: 'КНДР' },
 

  { date: '2024-01-08', name: 'День содружества(Северные Марианские острова)', country: 'Северные Марианские острова' },

  { date: '2024-01-08', name: 'День Тефолаха', country: 'Тувалу' },
  { date: '2024-01-08', name: 'Праздник женщин «Гинайкратия»', country: 'Греция' },
  { date: '2024-01-09', name: 'День Республики Сербской', country: 'Босния и Герцеговина' },

  
  { date: '2024-01-09', name: 'День школьников и студентов', country: 'Вьетнам' },
  { date: '2024-01-09', name: 'День мучеников(Панама)', country: 'Панама' },
  { date: '2024-01-09', name: 'День «Чёрного Назарянина»', country: 'Филиппины' },
  { date: '2024-01-09', name: 'День мирного соглашения', country: 'Южный Судан' },

  { date: '2024-01-09', name: 'День принятия Резолюции об отделении Меджимурья от венгерского государства', country: 'Хорватия' },

  { date: '2024-01-09', name: 'Праздник удачи и счастья «Тока Эбису»', country: 'Япония' },
  { date: '2024-01-10', name: 'День Маргарет Тэтчер', country: 'Фолклендские острова' },

  { date: '2024-01-10', name: 'Праздник вуду', country: 'Бенин' },
  { date: '2024-01-10', name: 'День принципа большинства', country: 'Багамские острова' },
  { date: '2024-01-10', name: 'День Национальной гвардии(Казахстан)', country: 'Казахстан' },
  { date: '2024-01-10', name: 'День полиции', country: 'Китай' },
  { date: '2024-01-10', name: 'День работников органов по государственному финансовому контролю и борьбе с коррупцией', country: 'Таджикистан' },
 
  



  { date: '2024-01-11', name: 'День детей(Тунис)', country: 'Тунис' },
 
  { date: '2024-01-11', name: 'День восшествия на престол(Оман)', country: 'Оман' },
  { date: '2024-01-11', name: 'День объединения(Непал)', country: 'Непал' },

  { date: '2024-01-11', name: 'День республики(Албания)', country: 'Албания' },
  { date: '2024-01-11', name: 'День манифеста о независимости', country: 'Марокко' },


  { date: '2024-01-11', name: 'День Эугенио Мария де Остоса(Пуэрто-Рико)', country: 'Пуэрто-Рико' },

  { date: '2024-01-12', name: 'Берберский Новый год', country: 'Алжир' },

  { date: '2024-01-12', name: 'День Занзибарской революции(Танзания)', country: 'Танзания' },
  { date: '2024-01-12', name: 'День политзаключенного', country: 'Украина' },
  { date: '2024-01-12', name: 'День памяти жертв битвы при крепости Геок-Тепе(Туркменистан)', country: 'Туркменистан' },
 
  { date: '2024-01-13', name: 'День памяти защитников свободы', country: 'Литва' },
  { date: '2024-01-13', name: 'День демократии(Кабо-Верде)', country: 'Кабо-Верде' },

 
  { date: '2024-01-13', name: 'День освобождения(Того)', country: 'Того' },
  { date: '2024-01-13', name: 'День Конституции Монголии', country: 'Монголия' },
  { date: '2024-01-13', name: 'День авиации(Тайланд)', country: 'Тайланд' },
  

  { date: '2024-01-14', name: 'День сотворения мира, Праздник «Ажьырныхуа»', country: 'Абхазия' },
  { date: '2024-01-14', name: 'День защитников Родины', country: 'Узбекистан' },
  { date: '2024-01-14', name: 'День государственного флага(Грузия)', country: 'Грузия' },
  
  { date: '2024-01-14', name: 'День детей(Тайланд)', country: 'Тайланд' },
 
  { date: '2024-01-14', name: 'День революции и молодёжи(Тунис)', country: 'Тунис' },
  { date: '2024-01-14', name: 'День рождения великого султана', country: 'Малайзия' },

  { date: '2024-01-14', name: 'Карнавал страны', country: 'Аргентина' },
  { date: '2024-01-14', name: 'Праздник Девы Марии', country: 'Венесуэла' },


  { date: '2024-01-15', name: 'День композитора', country: 'Мексика' },

  { date: '2024-01-15', name: 'День армии(Индия)', country: 'Индия' },



  { date: '2024-01-15', name: 'День учителя в Венесуэле', country: 'Венесуэла' },
  { date: '2024-01-15', name: 'День Джона Чилембве', country: 'Малави' },
  { date: '2024-01-15', name: 'День кубинской науки', country: 'Куба' },
  { date: '2024-01-15', name: 'День хангыля', country: 'КНДР' },

  { date: '2024-01-15', name: 'День международного признания', country: 'Хорватия' },

  { date: '2024-01-15', name: 'Фестиваль «Синулог»', country: 'Филиппины' },
  { date: '2024-01-16', name: 'День Чапультепекских мирных соглашений', country: 'Сальвадор' },


  { date: '2024-01-16', name: 'День учителя(Тайланд)', country: 'Тайланд' },

  { date: '2024-01-16', name: 'День мученика', country: 'Бенин' },




 


  { date: '2024-01-18', name: 'День вооружённых сил(Тайланд)', country: 'Тайланд' },

  { date: '2024-01-18', name: 'День основания Лимы(Перу)', country: 'Перу' },
 
  { date: '2024-01-19', name: 'День отдыха после карнавала', country: 'Бонэйр' },
  { date: '2024-01-19', name: 'Праздник крещения «Тимкат»', country: 'Эфиопия' },
  { date: '2024-01-19', name: 'День сектора Газа', country: 'Иран' },


  { date: '2024-01-20', name: 'День героев(Кабо-Верде)', country: 'Кабо-Верде' },
  { date: '2024-01-20', name: 'День памяти защитников баррикад', country: 'Латвия' },
  { date: '2024-01-20', name: 'День всенародной скорби', country: 'Азербайджан' },

  { date: '2024-01-20', name: 'День Народной армии', country: 'Лаос' },

  { date: '2024-01-20', name: 'День вооружённых сил Мали', country: 'Мали' },
  { date: '2024-01-20', name: 'Праздник середины зимы «Торраблоут»', country: 'Исландия' },
  { date: '2024-01-20', name: 'Фестиваль гурманов', country: 'Швейцария' },
  { date: '2024-01-21', name: 'День инженерных войск в Беларусии', country: 'Беларусь' },


 
  { date: '2024-01-21', name: 'День принцессы Ингрид Александры(Норвегия)', country: 'Норвегия' },
  { date: '2024-01-21', name: 'День Эррола Барроу', country: 'Барбадос' },
  { date: '2024-01-21', name: 'День мексиканской народной музыки «Мариачи»', country: 'Мексика' },

 
  { date: '2024-01-22', name: 'Вьетнамский Новый год «Тет Нгуен Дан»', country: 'Вьетнам' },



 
  { date: '2024-01-22', name: 'День работников таможни', country: 'Таджикистан' },
  { date: '2024-01-22', name: 'День Балдан Лхамо', country: 'Тибет' },
  { date: '2024-01-22', name: 'День основания многонационального государства', country: 'Боливия' },

  { date: '2024-01-22', name: 'Традиционный день подношения', country: 'Бутан' },
  { date: '2024-01-22', name: 'Франко-германский день', country: 'Германия' },

  { date: '2024-01-23', name: 'День «Баунти»(Острова Питкэрн)', country: 'Острова Питкэрн' },
  
  { date: '2024-01-23', name: 'День героев(Каймановы острова)', country: 'Каймановы острова' },
  { date: '2024-01-23', name: 'День провинции Веллингтон(Новая Зеландия)', country: 'Новая Зеландия' },

  { date: '2024-01-23', name: 'День памяти святого Ильдефонса Толедского', country: 'Испания' },
  { date: '2024-01-24', name: 'День памяти святого Неофита', country: 'Кипр' },



  { date: '2024-01-24', name: 'День независимости кантона Во', country: 'Швейцария' },
  { date: '2024-01-24', name: 'День объединения(Румыния)', country: 'Румыния' },



  { date: '2024-01-24', name: 'Фестиваль миниатюр «Аласитас»', country: 'Боливия' },
 
  

  { date: '2024-01-25', name: 'День социального работника', country: 'Таджикистан' },
  { date: '2024-01-25', name: 'День полиции', country: 'Египет' },
  { date: '2024-01-25', name: 'День революции 2011 года', country: 'Египет' },



  { date: '2024-01-25', name: 'День святой Двинвен', country: 'Уэльс' },
  { date: '2024-01-25', name: 'День города Луанда', country: 'Ангола' },
  { date: '2024-01-25', name: 'День Бетико Круса', country: 'Аруба' },
  { date: '2024-01-25', name: 'Женский день(Гондурас)', country: 'Гондурас' },
  { date: '2024-01-26', name: 'Бермудский фестиваль исполнительских видов искусства', country: 'Бермудские острова' },

  { date: '2024-01-26', name: 'День республики(Индия)', country: 'Индия' },
  

  { date: '2024-01-26', name: 'День Объединенного оперативного командования ВС', country: 'Украина' },
  { date: '2024-01-26', name: 'День свободы(Уганда)', country: 'Уганда' },

  { date: '2024-01-26', name: 'День инженера и архитектора(Панама)', country: 'Панама' },
  { date: '2024-01-26', name: 'День международного признания Латвийской Республики', country: 'Латвия' },


  { date: '2024-01-27', name: 'День святой Нино', country: 'Грузия' },
  { date: '2024-01-27', name: 'День защитника Отечества(Туркменистан)', country: 'Туркменистан' },
 
  { date: '2024-01-27', name: 'День памяти жертв национал-социализма', country: 'Германия' },

  { date: '2024-01-27', name: 'День святой Девоты', country: 'Монако' },

  { date: '2024-01-27', name: 'День мира(Вьетнам)', country: 'Вьетнам' },
  { date: '2024-01-27', name: 'Праздник «Ароматной пагоды»', country: 'Вьетнам' },

 
  { date: '2024-01-28', name: 'День армии в Армении', country: 'Армения' },
  { date: '2024-01-28', name: 'День памяти Хосе Марти', country: 'Куба' },
  { date: '2024-01-28', name: 'День демократии(Руанда)', country: 'Руанда' },
  { date: '2024-01-29', name: 'День белорусской науки', country: 'Беларусь' },
  { date: '2024-01-29', name: 'День памяти жертв холокоста(Нидерланды)', country: 'Нидерланды' },
  { date: '2024-01-29', name: 'День мучеников(Непал)', country: 'Непал' },
 
  { date: '2024-01-29', name: 'День работников прокуратуры', country: 'Молдова' },
 
  { date: '2024-01-29', name: 'Праздник святого Валерия Сарагосского', country: 'Испания' },

 

  { date: '2024-01-31', name: 'Фестиваль огня «Апхеллио»', country: 'Шотландия' },
  { date: '2024-02-01', name: 'День памяти жертв коммунистического режима в Болгарии', country: 'Болгария' },


  { date: '2024-02-01', name: 'День героев(Руанда)', country: 'Руанда' },
  { date: '2024-02-01', name: 'День военно-воздушных сил(Никарагуа)', country: 'Никарагуа' },


  { date: '2024-02-01', name: 'День федеральных территорий', country: 'Малайзия' },
  { date: '2024-02-01', name: 'День провозглашения республики в Венгрии', country: 'Венгрия' },




  { date: '2024-02-02', name: 'День ветра', country: 'Латвия' },

 
  { date: '2024-02-02', name: 'День заключения Тартуского договора', country: 'Эстония' },
 
  { date: '2024-02-02', name: 'День космических технологий', country: 'Иран' },
  { date: '2024-02-02', name: 'День сельского хозяйства(Тайланд)', country: 'Тайланд' },


  { date: '2024-02-02', name: 'День Конституции в Филиппинах', country: 'Филиппины' },
  { date: '2024-02-02', name: 'День битвы при Миссунде', country: 'Дания' },
  { date: '2024-02-02', name: 'Праздник «Богоматери мореплавателей»', country: 'Бразилия' },

 
  { date: '2024-02-03', name: 'День героев(Мозамбик)', country: 'Мозамбик' },

  { date: '2024-02-03', name: 'День мучеников(Сан-Томе и Принсипи)', country: 'Сан-Томе и Принсипи' },
  { date: '2024-02-03', name: 'День Коммунистической партии', country: 'Вьетнам' },
  { date: '2024-02-03', name: 'День ветеранов(Тайланд)', country: 'Тайланд' },
  
  { date: '2024-02-03', name: 'Праздник Девы Марии из Суйяпы', country: 'Гондурас' },

  { date: '2024-02-03', name: 'Фестиваль ледовой музыки(Норвегия)', country: 'Норвегия' },
 
  { date: '2024-02-04', name: 'День святого Саркиса', country: 'Армения' },
 
  { date: '2024-02-04', name: 'День каши', country: 'Латвия' },
  { date: '2024-02-04', name: 'День независимости(Шри-Ланка)', country: 'Шри-Ланка' },
  { date: '2024-02-04', name: 'День вооружённой борьбы', country: 'Ангола' },
  { date: '2024-06-21', name: 'День отца(Сирия)', country: 'Сирия' },
 
 
 
  { date: '2024-02-05', name: 'Греческая масленица «Апокриес»', country: 'Греция' },

  { date: '2024-02-05', name: 'День полнолуния «Навам Поя»', country: 'Шри-Ланка' },

  { date: '2024-02-05', name: 'День освобождения от оккупации(Сан-Марино)', country: 'Сан-Марино' },
  { date: '2024-02-05', name: 'День риэлтора', country: 'Беларусь' },
  { date: '2024-02-05', name: 'День единства в Бурунди', country: 'Бурунди' },
  { date: '2024-02-05', name: 'Праздник боли «Тайпусам»', country: 'Маврикий' },

  { date: '2024-02-05', name: 'День солидарности с Кашмиром', country: 'Пакистан' },
  { date: '2024-02-05', name: 'День Рунеберга', country: 'Финляндия' },
  { date: '2024-02-05', name: 'День памяти гуру Равидаса', country: 'Индия' },
  
  { date: '2024-02-06', name: 'День Боба Марли', country: 'Ямайка' },
  { date: '2024-02-06', name: 'День Конституции Мексики', country: 'Мексика' },

  { date: '2024-02-06', name: 'День рождения принцессы Мари', country: 'Дания' },
  { date: '2024-02-06', name: 'День Вайтанги(Новая Зеландия)', country: 'Новая Зеландия' },
  { date: '2024-02-06', name: 'Новый год плодовых деревьев «Ту би-Шват»', country: 'Израиль' },

 

  { date: '2024-02-07', name: 'День святого Мэла', country: 'Ирландия' },
  { date: '2024-02-07', name: 'День независимости(Гренада)', country: 'Гренада' },
  { date: '2024-02-07', name: 'День герба Республики Татарстан', country: 'Россия' },
 
  { date: '2024-02-08', name: 'День инженера(Люксембург)', country: 'Люксембург' },
  { date: '2024-02-08', name: 'День предложения руки и сердца', country: 'Индия' },
 
  { date: '2024-02-08', name: 'День словенской культуры, День Прешерна', country: 'Словения' },
  { date: '2024-02-08', name: 'День военно-воздушных сил(Иран)', country: 'Иран' },
  


  
  { date: '2024-02-09', name: 'День святого Маруна', country: 'Ливан' },
  { date: '2024-02-09', name: 'День рождения Алишера Навои', country: 'Узбекистан' },

 

  

  { date: '2024-02-10', name: 'День курдских писателей', country: 'Ирак' },
  { date: '2024-02-10', name: 'День Фенкил', country: 'Эритрея' },



  { date: '2024-02-11', name: 'Винный фестиваль в Марльборо(Новая Зеландия)', country: 'Новая Зеландия' },
 




  { date: '2024-02-11', name: 'День молодёжи Камерун', country: 'Камерун' },
  { date: '2024-02-11', name: 'День подписания Латеранских соглашений', country: 'Ватикан' },
  { date: '2024-02-11', name: 'День социолога и антрополога', country: 'Венесуэла' },
  { date: '2024-02-11', name: 'День победы Исламской революции', country: 'Иран' },
  { date: '2024-02-11', name: 'День штурма Копенгагена', country: 'Дания' },

  { date: '2024-02-11', name: 'День вооружённых сил(Либерия)', country: 'Либерия' },
 
  { date: '2024-02-11', name: 'День Эвелио Хавьера', country: 'Филиппины' },
  { date: '2024-02-11', name: 'Национальный день(Йемен)', country: 'Йемен' },

  { date: '2024-02-11', name: 'Карнавальное воскресенье(Люксембург)', country: 'Люксембург' },

  { date: '2024-02-12', name: 'День матери(Норвегия)', country: 'Норвегия' },
  { date: '2024-02-12', name: 'День единства(Мьянма)', country: 'Мьянма' },
  { date: '2024-02-12', name: 'День молодёжи в Венесуэле', country: 'Венесуэла' },
  { date: '2024-02-12', name: 'День памяти погибших во время массовых беспорядков в Душанбе', country: 'Таджикистан' },
  { date: '2024-02-12', name: 'День провозглашения независимости', country: 'Чили' },
 


 
  { date: '2024-02-13', name: 'День детей', country: 'Мьянма' },
  { date: '2024-02-13', name: 'Праздник «Терендез»', country: 'Армения' },


  { date: '2024-02-14', name: 'День войск радиационной, химической и биологической защиты', country: 'Украина' },
  { date: '2024-02-14', name: 'День памяти Рафика Харири', country: 'Ливан' },


 
  { date: '2024-02-14', name: 'День генералиссимуса', country: 'КНДР' },

  { date: '2024-02-14', name: 'День памяти коммунистических мучеников', country: 'Ирак' },
  { date: '2024-02-14', name: 'День спорта(Катар)', country: 'Катар' },
 
  { date: '2024-02-14', name: 'Праздник виноградарей', country: 'Трифон Зарезан', country: 'Болгария' },
  { date: '2024-02-14', name: 'Праздник «Тъярнэндарач»', country: 'Армения' },
  { date: '2024-02-15', name: 'День государственности(Сербия)', country: 'Сербия' },
  { date: '2024-02-15', name: 'День памяти воинов-интернационалистов', country: 'Беларусь' },

 

  { date: '2024-02-15', name: 'День национального флага Канады', country: 'National Flag of Canada Day', country: 'Канада' },


  { date: '2024-02-15', name: 'День Джона Фрума', country: 'Вануату' },
  { date: '2024-02-15', name: 'День освобождения в Афганистане', country: 'Афганистан' },
  { date: '2024-02-15', name: 'День всеобщей обороны', country: 'Total Defense Day', country: 'Сингапур' },
  { date: '2024-02-15', name: 'День ашкали', country: 'Ashkali Flag Day', country: 'Косово' },
  { date: '2024-02-16', name: 'Берлинский международный кинофестиваль', country: 'Германия' },

 
  
  { date: '2024-02-16', name: 'День добрых дел и национального долга', country: 'Вардананц', country: 'Армения' },

  { date: '2024-02-16', name: 'День «сияющей звезды», День Ким Чен Ира', country: 'Day of the Shining Star', country: 'КНДР' },
  { date: '2024-02-16', name: 'День восстановления государственности', country: 'Литва' },
  { date: '2024-02-16', name: 'День памяти архиепископа Джанани Лувума(Уганда)', country: 'Archbishop Janani Luwum Day', country: 'Уганда' },

  { date: '2024-02-17', name: 'День революции 17 февраля', country: 'Libyan Revolution Day', country: 'Ливия' },
  { date: '2024-02-17', name: 'День независимости(Косово)', country: 'Kosovo Independence Day', country: 'Косово' },
  { date: '2024-02-17', name: 'Карнавал в Рио-де-Жанейро', country: 'Rio Carnival', country: 'Бразилия' },
  { date: '2024-02-17', name: 'Масленица', country: 'Мasopust', country: 'Чехия' },

  
  { date: '2024-02-18', name: 'День вооружённых сил(Сьерра-Леоне)', country: 'Сьерра-Леоне' },
  { date: '2024-02-18', name: 'День независимости(Гамбия)', country: 'Gambia Independence Day', country: 'Гамбия' },
  { date: '2024-02-18', name: 'День демократии(Непал)', country: 'Непал' },
  { date: '2024-02-18', name: 'День союза курдских студентов', country: 'Kurdish Students Union Day', country: 'Ирак' },

 

  { date: '2024-02-19', name: 'День Васила Левского', country: 'Bulgaria', country: 'Болгария' },

  { date: '2024-02-19', name: 'День армии в Мексике',  country: 'Мексика' },
  { date: '2024-02-19', name: 'День Константина Бранкузи(Румыния)', country: 'Румыния' },
  { date: '2024-02-19', name: 'День сотрудника финансовой полиции(Кыргызстан)', country: 'Кыргызстан' },


,
  { date: '2024-02-19', name: 'Масленица(Норвегия)', country: 'Норвегия' },


 
  { date: '2024-02-20', name: 'День героев(Пуэрто-Рико)', country: 'Пуэрто-Рико' },
  { date: '2024-02-20', name: 'День возрождения Арцаха(НКР)', country: 'НКР' },
  { date: '2024-02-20', name: 'День федерации', country: 'Венесуэла' },

  { date: '2024-02-20', name: 'День наследия Канады', country: 'Heritage Day', country: 'Канада' },
  { date: '2024-02-20', name: 'День семьи(Канада)', country: 'Family Day', country: 'Канада' },

  { date: '2024-02-20', name: 'День битвы при Сальте', country: 'Battle of Salta Day', country: 'Аргентина' },
  
  { date: '2024-02-20', name: 'Международный фестиваль кубинских сигар', country: 'Habanos Cigar Festival', country: 'Куба' },
  { date: '2024-02-21', name: 'День работников землеустроительной и картографо-геодезической службы', country: 'Беларусь' },
 
  { date: '2024-02-21', name: 'День молодёжи(Зимбабве)', country: 'Robert Mugabe National Youth Day', country: 'Зимбабве' },

  { date: '2024-02-21', name: 'День рождения короля(Норвегия)', country: 'Норвегия' },
  { date: '2024-02-21', name: 'День памяти иностранных участников Французского Сопротивления', country: 'Франция' },
  { date: '2024-02-21', name: 'День движения за государственный статус бенгальского языка', country: 'Bengali Language Movement Day', country: 'Бангладеш' },
  { date: '2024-02-21', name: 'День вооружённых сил(ЮАР)', country: 'ЮАР' },
  { date: '2024-02-21', name: 'День памяти Уолтера Лини', country: 'Father Walter Lini Day', country: 'Вануату' },
  { date: '2024-02-21', name: 'Праздник «Когда Дракон поднимает голову»', country: 'Zhonghe Festival', country: 'Китай' },


  
  { date: '2024-02-22', name: 'День единства, Фестиваль Солнца', country: 'Abu Simbel Sun Festival', country: 'Египет' },

  { date: '2024-02-22', name: 'День независимости(Сент-Люсия)', country: 'Saint Lucia Independence Day', country: 'Сент-Люсия' },
  { date: '2024-02-22', name: 'День аргентинской Антарктики', country: 'Argentine Antarctica Day', country: 'Аргентина' },
  { date: '2024-02-22', name: 'День работника землеустройства, геодезии и картографии(Кыргызстан)', country: 'Кыргызстан' },
  { date: '2024-02-22', name: 'День основания государства(Саудовская Аравия)', country: 'Саудовская Аравия' },
  { date: '2024-02-22', name: 'День жертв преступлений(Польша)', country: 'Польша' },
  
  { date: '2024-02-23', name: 'Бернский карнаваль', country: 'Berner Fasnacht', country: 'Швейцария' },
  { date: '2024-02-23', name: 'День Вооружённых сил(Таджикистан)', country: 'Таджикистан' },
 
 
  { date: '2024-02-23', name: 'День независимости в Брунеи', country: 'Brunei National Day', country: 'Бруней' },
  { date: '2024-02-23', name: 'День республики(Гайана)', country: 'Mashramani', country: 'Гайана' },
 


  { date: '2024-02-24', name: 'День наследия Юкона', country: 'Yukon Heritage Day', country: 'Канада' },

  { date: '2024-02-24', name: 'День парагвайских женщин', country: 'Dia de la Mujer Paraguaya', country: 'Парагвай' },
  { date: '2024-02-24', name: 'День независимости(Эстония)', country: 'Эстония' },
  { date: '2024-02-24', name: 'День финнов', country: 'Швеция' },

  { date: '2024-02-24', name: 'День флага Мексики', country: 'Dia de la Bandera', country: 'Мексика' },
  { date: '2024-02-24', name: 'Праздник Драгобете', country: 'Dragobete', country: 'Молдова' },
 

  { date: '2024-02-25', name: 'День советской оккупации', country: 'Грузия' },
  { date: '2024-02-25', name: 'День инженерно-авиационной службы авиации ВС', country: 'Украина' },

  { date: '2024-02-25', name: 'День памяти жертв коммунистического режима(Венгрия)', country: 'Венгрия' },
  { date: '2024-02-25', name: 'День провинции Шуазёль(Соломоновы острова)', country: 'Соломоновы острова' },
  { date: '2024-02-25', name: 'Национальный день(Кувейт)', country: 'Kuwait National Day', country: 'Кувейт' },
  { date: '2024-02-25', name: 'День революции ЭДСА', country: 'People Power Day', country: 'Филиппины' },
 

  { date: '2024-02-26', name: 'День освобождения(Кувейт)', country: 'Kuwait Liberation Day', country: 'Кувейт' },
  { date: '2024-02-27', name: 'День хачапури', country: 'Грузия' },
 
  { date: '2024-02-27', name: 'День независимости (Сахарская Арабская Демократическая Республика)', country: 'Сахарская Арабская Демократическая Республика' },

  { date: '2024-02-27', name: 'Фестиваль прекрасного рождения', country: 'Beautiful Birth Festival', country: 'Австралия' },
 

  { date: '2024-02-27', name: 'День Маджубы', country: 'Majuba Day', country: 'ЮАР' },
  { date: '2024-02-27', name: 'День доктора(Вьетнам)', country: 'Vietnamese Doctor`s Day', country: 'Вьетнам' },
 

  { date: '2024-02-28', name: 'День учителя(ОАЭ)', country: 'ОАЭ' },
  { date: '2024-02-28', name: 'День памяти жертв погромов в Сумгаите, Баку и Кировабаде', country: 'Армения' },


  
  { date: '2024-02-29', name: 'День святого Освальда', country: 'Ирландия' },
  { "date": "2024-03-01", "name": "День пива", "country": "Исландия" },
  { "date": "2024-03-01", "name": "День борьбы за мир", "country": "Япония" },
  { "date": "2024-03-01", "name": "День героев(Парагвай)", "country": "Парагвай" },

 
  { "date": "2024-03-01", "name": "День поминовения жертв ядерных испытаний(Маршалловы острова)", "country": "Маршалловы острова" },
  { "date": "2024-03-01", "name": "День патриотов в Монголии", "country": "Монголия" },

  { "date": "2024-03-01", "name": "Праздник весны «Баба Марта»", "country": "Болгария" },




  
  { "date": "2024-03-01", "name": "День республики Невшатель", "country": "Швейцария" },
  { "date": "2024-03-01", "name": "День независимости(Босния и Герцеговина)", "country": "Босния и Герцеговина" },
  { "date": "2024-05-14", "name": "День Япа", "country": "Микронезия" },
  

  { "date": "2024-03-02", "name": "День крестьян", "country": "Мьянма" },

 
  { "date": "2024-03-02", "name": "День флага в Бангладеш", "country": "Бангладеш" },
  { "date": "2024-03-02", "name": "День американского гражданства(Пуэрто-Рико)", "country": "Пуэрто-Рико" },
  { "date": "2024-03-02", "name": "День Военно-воздушных сил", "country": "Шри-Ланка" },
  { "date": "2024-03-02", "name": "День победы в битве при Адуа", "country": "Эфиопия" },
  { "date": "2024-03-02", "name": "День Джеймса Рональда Вебстера", "country": "Ангилья" },
  { "date": "2024-03-02", "name": "День белуджской культуры", "country": "Пакистан" },
  { "date": "2024-03-02", "name": "День книги(Ирландия)", "country": "Ирландия" },

  { "date": "2024-03-03", "name": "День матери(Грузия)", "country": "Грузия" },
  { "date": "2024-03-03", "name": "День Государственного флага(Кыргызстан)", "country": "Кыргызстан" },


  { "date": "2024-03-03", "name": "День мучеников в Малави", "country": "Малави" },
  { "date": "2024-03-03", "name": "День спортсменов", "country": "Египет" },
  { "date": "2024-03-03", "name": "День освобождения от османского ига", "country": "Болгария" },
  { "date": "2024-03-03", "name": "День национального единства(Судан)", "country": "Судан" },
  { "date": "2024-03-03", "name": "День ветеранов(Восточный Тимор)", "country": "Восточный Тимор" },


 
  { "date": "2024-03-03", "name": "Праздник цветения персика", "country": "Китай" },
  { "date": "2024-03-04", "name": "День милиции(Беларусь)", "country": "Беларусь" },
  { "date": "2024-03-04", "name": "День святого Казимира(Польша)", "country": "Польша" },


  { "date": "2024-03-04", "name": "Тодоров день, Тудорица", "country": "Болгария" },

 
 

 

  { "date": "2024-03-05", "name": "День всенародной учёбы", "country": "Китай" },

  { "date": "2024-03-05", "name": "День журналиста(Тайланд)", "country": "Тайланд" },
  { "date": "2024-03-05", "name": "День традиционных вождей", "country": "Вануату" },
  { "date": "2024-03-05", "name": "День колпака(Кыргызстан)", "country": "Кыргызстан" },
  { "date": "2024-03-05", "name": "День работника судебной системы(Кыргызстан)", "country": "Кыргызстан" },



  { "date": "2024-03-05", "name": "Годовщина восстания 1991 года", "country": "Ирак" },
  { "date": "2024-03-06", "name": "День печати", "country": "Монголия" },
  
  { "date": "2024-03-06", "name": "День толерантности и сосуществования", "country": "Ирак" },
  { "date": "2024-03-06", "name": "День Магеллана", "country": "Гуам" },
  { "date": "2024-03-06", "name": "День независимости(Гана)", "country": "Гана" },

  { "date": "2024-03-06", "name": "День основания", "country": "Остров Норфолк" },
  { "date": "2024-03-06", "name": "День памяти и уважения ветеранов", "country": "Косово" },
  { "date": "2024-03-06", "name": "День истории и наследия Чаморро", "country": "Гуам" },
  { "date": "2024-03-06", "name": "Пост Эстер", "country": "Израиль" },
  { "date": "2024-03-06", "name": "Праздник «Макха Буча»", "country": "Лаос" },
  { "date": "2024-03-07", "name": "Малый Пурим", "country": "Израиль" },
 
  { "date": "2024-03-07", "name": "День Александра Белла", "country": "Канада" },

  { "date": "2024-03-09", "name": "День учителя в Ливане", "country": "Ливан" },

  { "date": "2024-03-09", "name": "День национальных героев и благодетелей", "country": "Белиз" },

  { "date": "2024-03-10", "name": "День памяти жертв холокоста в Болгарии", "country": "Болгария" },

 
  { "date": "2024-03-10", "name": "День традиционной курдской одежды", "country": "Сирия" },

  { "date": "2024-03-10", "name": "День памяти тибетского восстания в Лхасе", "country": "Тибет" },
  { "date": "2024-03-10", "name": "День свободы секеев(Румыния)", "country": "Румыния" },
  { "date": "2024-03-11", "name": "День печати", "country": "Таджикистан" },


 
  { "date": "2024-03-11", "name": "День Мошвешве", "country": "Лесото" },
  { "date": "2024-03-11", "name": "День генеалогии", "country": "Ирландия" },
  { "date": "2024-03-12", "name": "День молодёжи(Замбия)", "country": "Замбия" },

  
  { "date": "2024-03-12", "name": "День обновления(Габон)", "country": "Габон" },
  { "date": "2024-03-12", "name": "День деревьев(Северная Македония)", "country": "Северная Македония" },
  { "date": "2024-03-12", "name": "День независимости(Маврикий)", "country": "Маврикий" },
  { "date": "2024-03-12", "name": "День Грекаризмесса(Фарерские острова)", "country": "Фарерские острова" },
 
 
  
  { "date": "2024-03-13", "name": "День избрания папы римского Франциска", "country": "Ватикан" },

  { "date": "2024-03-13", "name": "День революции(Гренада)", "country": "Гренада" },


  { "date": "2024-03-13", "name": "День освобождения Дахука", "country": "Ирак" },
  { "date": "2024-03-13", "name": "День Канберры", "country": "Австралия" },
  { "date": "2024-03-13", "name": "Праздник «Восьмичасового рабочего дня»", "country": "Австралия" },
  { "date": "2024-03-14", "name": "Белый день", "country": "Вьетнам" },
  { "date": "2024-03-14", "name": "День работников органов прокуратуры(Таджикистан)", "country": "Таджикистан" },


  { "date": "2024-03-14", "name": "День героев(Сент-Винсент и Гренадины)", "country": "Сент-Винсент и Гренадины" },
  { "date": "2024-03-14", "name": "День Конституции в Андорре", "country": "Андорра" },
 
  { "date": "2024-03-15", "name": "День Конституции в Беларусии", "country": "Беларусь" },
 
  { "date": "2024-03-15", "name": "День молодёжи(Палау)", "country": "Палау" },
  { "date": "2024-03-15", "name": "День революции 1848 года", "country": "Венгрия" },
  { "date": "2024-03-15", "name": "День Робертса", "country": "Либерия" },
  { "date": "2024-03-15", "name": "День инженера(Нидерланды)", "country": "Нидерланды" },
  { "date": "2024-03-15", "name": "Праздник богатого года «Хонэн-мацури»", "country": "Япония" },
,


  
  { "date": "2024-03-16", "name": "День учителя(Сирия)", "country": "Сирия" },
  { "date": "2024-03-16", "name": "День инженера(Словакия)", "country": "Словакия" },

  { "date": "2024-03-16", "name": "День памяти латышских легионеров", "country": "Латвия" },
 

 

 
 
 
  { "date": "2024-03-17", "name": "День памяти жертв Аксыйской трагедии", "country": "Кыргызстан" },
  
  { "date": "2024-03-17", "name": "День детей в Бангладеш", "country": "Бангладеш" },
  { "date": "2024-03-17", "name": "День шейха Муджибура Рахмана", "country": "Бангладеш" },


  { "date": "2024-03-18", "name": "День внутренних войск", "country": "Беларусь" },

  { "date": "2024-03-18", "name": "День Парижской коммуны", "country": "Франция" },
 

  { "date": "2024-03-18", "name": "День флага и гимна", "country": "Аруба" },
  { "date": "2024-03-18", "name": "День памяти жертв Ередской трагедии", "country": "Южная Осетия" },

  { "date": "2024-03-18", "name": "День экспроприации нефтяной промышленности", "country": "Мексика" },
  { "date": "2024-03-18", "name": "День победы при Чанаккале", "country": "Турция" },



  { "date": "2024-03-19", "name": "День отца(Португалия)", "country": "Португалия" },


  { "date": "2024-03-19", "name": "День брецеля(Люксембург)", "country": "Люксембург" },
  { "date": "2024-03-19", "name": "Праздник победы над Каддафи", "country": "Ливия" },
  { "date": "2024-03-19", "name": "День равноправия, День Минны Кант", "country": "Финляндия" },
  { "date": "2024-03-19", "name": "День единства кашубов(Польша)", "country": "Польша" },
  
  { "date": "2024-03-20", "name": "День творческой интеллигенции", "country": "Таджикистан" },
  


  { "date": "2024-03-20", "name": "Неделя инженерии", "country": "Гана" },
  { "date": "2024-03-20", "name": "День независимости(Тунис)", "country": "Тунис" },
  { "date": "2024-03-20", "name": "День освобождения Киркука", "country": "Ирак" },


  { "date": "2024-03-20", "name": "День святого Иосифа", "country": "Колумбия" },
  { "date": "2024-03-20", "name": "День Бенито Хуареса", "country": "Мексика" },
  { "date": "2024-03-20", "name": "Фестиваль цветения и любования сакурой «О-Ханами»", "country": "Япония" },
 
  { "date": "2024-03-21", "name": "День пограничника(Грузия)", "country": "Грузия" },
  
  { "date": "2024-03-21", "name": "День матери(ОАЭ)", "country": "ОАЭ" },

  { "date": "2024-03-21", "name": "День гармонии", "country": "Австралия" },

 
  { "date": "2024-03-22", "name": "День Народно-революционной партии", "country": "Лаос" },
  { "date": "2024-03-22", "name": "День тишины", "country": "Бали" },

  { "date": "2024-03-22", "name": "День отмены рабства(Пуэрто-Рико)", "country": "Пуэрто-Рико" },

  { "date": "2024-03-22", "name": "Телугский Новый год «Угади»", "country": "Маврикий" },
  { "date": "2024-03-22", "name": "День рождения Мирзо Улугбека", "country": "Узбекистан" },



  { "date": "2024-03-23", "name": "День оценщика(Кыргызстан)", "country": "Кыргызстан" },
  { "date": "2024-03-23", "name": "День польско-венгерской дружбы", "country": "Венгрия" },
  { "date": "2024-03-23", "name": "День моря(Боливия)", "country": "Боливия" },
  { "date": "2024-03-23", "name": "День освобождения Южной Африки", "country": "Ангола" },
  { "date": "2024-03-23", "name": "День Пакистана", "country": "Пакистан" },


  
  { "date": "2024-03-24", "name": "День памяти жертв агрессии НАТО против Югославии", "country": "Сербия" },
  
  { "date": "2024-03-24", "name": "День жизни(Польша)", "country": "Польша" },

 


  { "date": "2024-03-25", "name": "День службы безопасности", "country": "Украина" },

  { "date": "2024-03-25", "name": "День матери(Словения)", "country": "Словения" },

  { "date": "2024-03-25", "name": "День памяти жертв коммунистического геноцида", "country": "Латвия" },

  
  { "date": "2024-03-25", "name": "День армии(Новая Зеландия)", "country": "Новая Зеландия" },
  { "date": "2024-03-25", "name": "Годовщина Аренго(Сан-Марино)", "country": "Сан-Марино" },

  { "date": "2024-03-26", "name": "День Национальной гвардии", "country": "Украина" },

  { "date": "2024-03-26", "name": "День молодёжи(Вьетнам)", "country": "Вьетнам" },
  { "date": "2024-03-26", "name": "День жизни, мира и справедливости", "country": "Сальвадор" },
  
  { "date": "2024-03-26", "name": "День принца Кухио", "country": "Гавайские острова" },
  { "date": "2024-03-26", "name": "День демократии", "country": "Мали" },
  { "date": "2024-03-26", "name": "День независимости в Бангладеш", "country": "Бангладеш" },
  { "date": "2024-03-27", "name": "День сыра", "country": "Франция" },
  { "date": "2024-03-27", "name": "День инженерно-аэродромной службы ВСУ", "country": "Украина" },
  { "date": "2024-03-27", "name": "День победы в Эстонии", "country": "Эстония" },
  { "date": "2024-03-27", "name": "День победы в Анголе", "country": "Ангола" },

  



{ date: '2024-03-28', name: 'День освобождения тибетцев от крепостного рабства', country: 'Тибет' },


{ date: '2024-03-29', name: 'День памяти героев', country: 'Мадагаскар' },


{ date: '2024-03-29', name: 'День президента Боганды', country: 'ЦАР' },



{ date: '2024-03-30', name: 'День защиты земли', country: 'Палестина' },



{ date: '2024-03-30', name: 'День султана Келантана', country: 'Малайзия' },
{ date: '2024-03-30', name: 'День освобождения духовных баптистов', country: 'Тобаго' },



{ date: '2024-03-31', name: 'День матери(Гибралтар)', country: 'Гибралтар' },
{ date: '2024-03-31', name: 'День тако', country: 'Мексика' },
{ date: '2024-03-31', name: 'День свободы(Мальта)', country: 'Мальта' },
{ date: '2024-03-31', name: 'День музеев(Нидерланды)', country: 'Нидерланды' },
{ date: '2024-03-31', name: 'День культуры и традиций', country: 'Микронезия' },
{ date: '2024-03-31', name: 'День рождения короля Нанклао(Тайланд)', country: 'Тайланд' },
{ date: '2024-03-31', name: 'День работников химической промышленности(Туркменистан)', country: 'Туркменистан' },
{ date: '2024-03-31', name: 'День передачи', country: 'Американские Виргинские Острова' },

{ date: "2024-04-01", name: "День греков-киприотов (Greek Cypriot National Day)", country: "Кипр" },












{ date: "2024-04-02", name: "День Мальвинских островов (Malvinas Day)", country: "Аргентина" },








{ date: "2024-04-04", name: "День мира и согласия (Peace Day)", country: "Ангола" },





{ date: "2024-04-05", name: "День детей (Children's Day)", country: "Палестина" },




{ date: "2024-04-05", name: "Праздник чистого света «Цинмин»", country: "Китай" },









{ date: "2024-04-06", name: "День акта о самоопределении", country: "Кокосовые острова" },
{ date: "2024-04-06", name: "День президента Сиприена Нтарьямиры (President Ntaryamira Day)", country: "Бурунди" },


{ date: "2024-04-07", name: "День материнства и красоты(НКР)", country: "НКР" },






{ date: "2024-04-07", name: "День флага(Словения)", country: "Словения" },





{ date: "2024-04-08", name: "День сотрудников органов по контролю наркотиков", country: "Кыргызстан" },









{ date: "2024-04-09", name: "День Конституции в Боливии", country: "Боливия" },



{ date: "2024-04-09", name: "День взятия Багдада (Baghdad Liberation Day)", country: "Ирак" },


{ date: "2024-04-09", name: "День национального единства(Грузия)", country: "Грузия" },
{ date: "2024-04-09", name: "День рождения Амира Темура", country: "Узбекистан" },


{ date: "2024-04-10", name: "День зефира «Peeps» (Peeps Day)", country: "Канада" },

{ date: "2024-04-10", name: "День Пасхального восстания (Easter Monday)", country: "Ирландия" },

{ date: "2024-04-10", name: "День семьи (Family Day)", country: "ЮАР" },


{ date: "2024-04-10", name: "День освобождения Одессы от фашистских оккупантов", country: "Украина" },





{ date: "2024-04-12", name: "День детей в Боливии", country: "Боливия" },





{ date: "2024-04-13", name: "День учителя(Эквадор)", country: "Эквадор" },

{ date: "2024-04-13", name: "День несправедливо преследуемых", country: "Словакия" },

{ date: "2024-04-14", name: "Бенгальский Новый год (Pohela Boishakh)", country: "Бангладеш" },
{ date: "2024-04-14", name: "Водный фестиваль «Тинджан»", country: "Мьянма" },
{ date: "2024-04-14", name: "День винограда сорта «Таннат»(Уругвай)", country: "Уругвай" },


{ date: "2024-04-14", name: "День молодёжи (Angolan Youth Day)", country: "Ангола" },

{ date: "2024-04-14", name: "День памяти жертв геноцида (Anfal Genocide Memorial Day)", country: "Ирак" },
{ date: "2024-04-14", name: "День родного языка(Грузия)", country: "Грузия" },


{ date: "2024-04-14", name: "День Бхимрао Рамджи Амбедкара (Ambedkar Jayanti)", country: "Индия" },

{ date: "2024-04-14", name: "Начало солнечного Нового года (Bohag Bihu)", country: "Индия" },





{ date: "2024-04-14", name: "Тамильский Новый год (Puthandu)", country: "Шри-Ланка" },

{ date: "2024-04-15", name: "День Любви", country: "Грузия" },



{ date: "2024-04-15", name: "День работников культуры и искусства", country: "Узбекистан" },



{ date: "2024-04-16", name: "День памяти жертв холокоста(Венгрия)", country: "Венгрия" },







{ date: "2024-04-17", name: "День женщин в Габоне", country: "Габон" },


{ date: "2024-04-17", name: "День крестьянской борьбы (International Day of Peasant Struggle)", country: "Бразилия" },
{ date: "2024-04-17", name: "День продовольственной и сельскохозяйственной организации (FAO Day)", country: "Ирак" },
{ date: "2024-04-17", name: "День независимости(Сирия)", country: "Сирия" },

{ date: "2024-04-19", name: "День канадского кино (National Canadian Film Day)", country: "Канада" },




{ date: "2024-04-19", name: "День республики(Сьерра-Леоне)", country: "Сьерра-Леоне" },
{ date: "2024-04-19", name: "День бразильской армии (Brazilian Army Day)", country: "Бразилия" },
{ date: "2024-04-19", name: "День индейцев (Dia do indio)", country: "Бразилия" },
{ date: "2024-04-19", name: "Годовщина победы в Плайя-Хирон", country: "Куба" },






{ date: "2024-04-21", name: "День Тирадентеса (Tiradentes Day)", country: "Бразилия" },
{ date: "2024-04-21", name: "День вьетнамской книги (Vietnam Book Day)", country: "Вьетнам" },









{ date: "2024-04-22", name: "День памяти жертв холокоста", country: "Сербия" },
{ date: "2024-04-22", name: "День истребительной авиации (Brazilian Fighter Arm Day)", country: "Бразилия" },
{ date: "2024-04-22", name: "День открытия (Discovery Day)", country: "Бразилия" },





{ date: "2024-04-22", name: "Парад цветов в Амстердаме(Нидерланды)", country: "Нидерланды" },





{ date: "2024-04-23", name: "День книги (Canada Book Day)", country: "Канада" },
{ date: "2024-04-23", name: "День перца", country: "Бермудские острова" },



{ date: "2024-04-23", name: "День ветеранов(Эстония)", country: "Эстония" },


{ date: "2024-04-23", name: "День турков (Day of Turks)", country: "Косово" },
{ date: "2024-04-23", name: "День военно-морских сил (Navy Day)", country: "Китай" },





{ date: "2024-04-24", name: "День космонавтики (Space Day)", country: "Китай" },



{ date: "2024-04-24", name: "День Республики(Гамбия)", country: "Гамбия" },


{ date: "2024-04-24", name: "День святого Георгия в Канаде", country: "Канада" },
{ date: "2024-04-24", name: "День Капхёнской битвы (Kapyong Day)", country: "Австралия" },



{ date: "2024-04-25", name: "День свободы (Dia da Liberdade)(Португалия)", country: "Португалия" },

{ date: "2024-04-25", name: "День защитника Отечества(Новая Зеландия)", country: "Новая Зеландия" },



{ date: "2024-04-25", name: "День Корейской народной армии", country: "КНДР" },

{ date: "2024-04-25", name: "День Регионального правительства Курдистана (Anniversary of the First Cabinet of the Kurdish Government)", country: "Ирак" },


{ date: "2024-04-25", name: "День памяти павших «Йом а-Зикарон» (Yom HaZikaron)", country: "Израиль" },
{ date: "2024-04-25", name: "День освобождения Синая (Sinai Liberation Day)", country: "Египет" },
{ date: "2024-04-25", name: "День флага", country: "Эсватини" },





{ date: "2024-04-26", name: "День пограничника(Армения)", country: "Армения" },





{ date: "2024-04-27", name: "День короля(Нидерланды)", country: "Нидерланды" },

{ date: "2024-04-27", name: "День отмены рабства (Abolition Day)", country: "Майотта" },
{ date: "2024-04-27", name: "День свободы (Freedom Day)", country: "ЮАР" },


{ date: "2024-04-27", name: "День ветеранов(Финляндия)", country: "Финляндия" },
{ date: "2024-04-27", name: "День независимости(Сьерра-Леоне)", country: "Сьерра-Леоне" },

{ date: "2024-04-27", name: "День государственного флага(Молдова)", country: "Молдова" },

{ date: "2024-04-27", name: "День национального сопротивления(Словения)", country: "Словения" },








{ date: "2024-04-28", name: "День исламской революции (Mujahideen Victory Day)", country: "Афганистан" },

{ date: "2024-04-28", name: "День памяти Кеннета Каунды (Kenneth Kaunda Day)", country: "Замбия" },

{ date: "2024-04-29", name: "День животных", country: "Аргентина" },




{ date: "2024-04-29", name: "День города Бишкек", country: "Кыргызстан" },


{ date: "2024-04-29", name: "День поминовения королей Хунгов (Gio To Hung Vuong)", country: "Вьетнам" },
{ date: "2024-04-29", name: "День города Прая (Praia City Day)", country: "Кабо-Верде" },


{ date: "2024-04-30", name: "День победы (Reunification Day)", country: "Вьетнам" },

{ date: "2024-04-30", name: "День армии(Грузия)", country: "Грузия" },


{ date: "2024-04-30", name: "День учителя(Парагвай)", country: "Парагвай" },


{ date: "2024-04-30", name: "День социального работника(ПМР)", country: "ПМР" },
{ date: "2024-04-30", name: "День мучеников (Youm-e-Shuhada)", country: "Пакистан" },
{ date: "2024-04-30", name: "День памяти жертв и героев депортации", country: "Франция" },
{ date: "2024-04-30", name: "День битвы при Камароне (Camaron Day)", country: "Франция" },
{ date: "2024-04-30", name: "День памяти отца-основателя Шабдрунга Нгаванга Намгьяла (Zhabdrung Kuchoe)", country: "Бутан" },


{ date: "2024-04-30", name: "Праздник урожая, День Ринкона (Rincon Day)", country: "Бонэйр" },
{ date: "2024-04-01", name: "Праздник тюльпанов в Стамбуле", country: "Турция" },




{ date: "2024-04-01", name: "День исламской республики", country: "Иран" },

{ date: "2024-04-01", name: "День капитанов-регентов(Сан-Марино)", country: "Сан-Марино" },



{ date: "2024-04-01", name: "Фестиваль танца «Мияко Одори»", country: "Япония" },
{ date: "2024-04-01", name: "Поливальный понедельник", country: "Словакия" },



{ date: "2024-04-02", name: "День Копенгагенского сражения", country: "Дания" },


{ date: "2024-04-02", name: "Праздник воды «Капля воды - крупица золота»(Туркменистан)", country: "Туркменистан" },


,
{ date: "2024-04-03", name: "День бухгалтеров и аудиторов", country: "Кыргызстан" },




{ date: "2024-04-04", name: "День независимости(Сенегал)", country: "Сенегал" },

{ date: "2024-04-04", name: "Туманяновские дни", country: "Армения" },






{ date: "2024-04-05", name: "Праздник «холодной пищи»", country: "Южная Корея" },




{ date: "2024-04-06", name: "День Агентства внутренней безопасности(Польша)", country: "Польша" },
{ date: "2024-04-06", name: "День работников физической культуры и спорта", country: "Кыргызстан" },


{ date: "2024-04-06", name: "День битвы при Нефельсе", country: "Швейцария" },







{ date: "2024-04-07", name: "День народной Апрельской революции", country: "Кыргызстан" },
{ date: "2024-04-07", name: "День мозамбикских женщин", country: "Мозамбик" },

{ date: "2024-04-07", name: "День просвещения", country: "Чехия" },



{ date: "2024-04-07", name: "День памяти жертв геноцида(Руанда)", country: "Руанда" },
{ date: "2024-04-07", name: "День шейха Абейд Амани Каруме(Танзания)", country: "Танзания" },


{ date: "2024-04-08", name: "День экономиста", country: "Таджикистан" },


{ date: "2024-03-27", name: "День откровения Корана «Нузул аль-Куран»", country: "Малайзия" },
{ date: "2024-04-08", name: "День Министерства обороны(Тайланд)", country: "Тайланд" },
{ date: "2024-04-08", name: "День памяти Хатико", country: "Япония" },
{ date: "2024-04-08", name: "Фестиваль цветов «Хана Мацури»", country: "Япония" },

{ date: "2024-04-09", name: "Годовщина оккупации", country: "Дания" },
{ date: "2024-04-09", name: "День Королевских военно-воздушных сил(Тайланд)", country: "Тайланд" },
{ date: "2024-04-09", name: "День доблести", country: "Филиппины" },
{ date: "2024-04-09", name: "День детей(Перу)", country: "Перу" },



{ date: "2024-04-09", name: "День ВВС", country: "Индонезия" },

{ date: "2024-04-09", name: "День Микаэля Агриколы", country: "Финляндия" },

{ date: "2024-04-09", name: "День битвы на хребте Вими", country: "Канада" },



{ date: "2024-04-09", name: "Святая Пасха", country: "Армения" },


 



  { date: "2024-04-10", name: "День рождения Абуллы Кадыри", country: "Узбекистан" },

  { date: "2024-04-10", name: "День Внутренних войск", country: "Таджикистан" },

  { date: "2024-04-11", name: "День здоровья(Кирибати)", country: "Кирибати" },

  { date: "2024-04-11", name: "День национального героя, День Хуана Сантамария", country: "Коста-Рика" },
  { date: "2024-04-12", name: "День работников ракетно-космической отрасли", country: "Украина" },


  { date: "2024-04-12", name: "День освобождения(Либерия)", country: "Либерия" },



  { date: "2024-04-13", name: "Тайский Новый год «Сонгкран»(Тайланд)", country: "Тайланд" },

  { date: "2024-04-13", name: "День памяти жертв Катыни(Польша)", country: "Польша" },

 
  { date: "2024-04-13", name: "Праздник урожая и Нового года «Вайсакхи»", country: "Индия" },

 

  { date: "2024-04-14", name: "День поста и молитвы", country: "Либерия" },

  { date: "2024-04-14", name: "День библиотекаря", country: "Венгрия" },

  { date: "2024-04-14", name: "День мальдивского языка", country: "Мальдивы" },

  { date: "2024-04-14", name: "День родного языка(Грузия)", country: "Грузия" },


  { date: "2024-04-14", name: "Кхемерский Новый год(Камбоджа)", country: "Камбоджа" },

  { date: "2024-04-14", name: "Праздник встречи Нового года «Бун Пимай Лао»", country: "Лаос" }, 
  { date: "2024-04-14", name: "Фестиваль весны «Такаяма Мацури»", country: "Япония" },
 
  { date: "2024-04-14", name: "Чёрный день", country: "Южная Корея" },
  

 
  { date: "2024-04-16", name: "День таджикской науки", country: "Таджикистан" },


  { date: "2024-04-16", name: "День первой Конституции", country: "Болгария" },
  { date: "2024-04-16", name: "День памяти жертв газовой атаки", country: "Ирак" },

  { date: "2024-04-16", name: "Коптская Пасха", country: "Египет" },

  { date: "2024-04-16", name: "Эфиопская Пасха", country: "Эритрея" },



 
  { date: "2024-04-17", name: "День ВВС и ПВО", country: "Куба" },

  { date: "2024-04-17", name: "День рождения королевы", country: "Остров Святой Елены" },




  { date: "2024-04-17", name: "День Хосе де Диего(Пуэрто-Рико)", country: "Пуэрто-Рико" },
 

 

  


 
  { date: "2024-04-18", name: "День битвы при Дюббёле", country: "Дания" },
  { date: "2024-04-18", name: "День танкиста", country: "Куба" },





  { date: "2024-04-19", name: "День высадки тридцати трёх патриотов(Уругвай)", country: "Уругвай" },
  
  { date: "2024-04-20", name: "День работников органов юстиции(Таджикистан)", country: "Таджикистан" },
  

  
 



  { date: "2024-04-21", name: "День героической защиты Веракруса", country: "Мексика" },







  { date: "2024-04-22", name: "День пограничной авиации", country: "Грузия" },


  { date: "2024-04-23", name: "День книги(Кыргызстан)", country: "Кыргызстан" },
  { date: "2024-04-23", name: "День языка", country: "Колумбия" },





  { date: "2024-04-23", name: "День детей и национальной независимости", country: "Турция" },
 




  { date: "2024-04-24", name: "День согласия", country: "Нигер" },
  
 







 



  { date: "2024-04-25", name: "День флага(Фарерские острова)", country: "Фарерские острова" },




  { date: "2024-04-26", name: "День объединения(Танзания)", country: "Танзания" },

  { date: "2024-06-05", name: "День рождения султана", country: "Малайзия" },
  { date: "2024-04-26", name: "День независимости «Йом ха-Ацмаут»", country: "Израиль" },

  

  { date: "2024-04-27", name: "День казначея", country: "Украина" },




  
  { date: "2024-04-27", name: "День независимости(Того)", country: "Того" },
 


 




  { date: "2024-04-28", name: "День национальных героев в Барбадосе", country: "Барбадос" },
  { date: "2024-04-28", name: "День восстановления суверенитета", country: "Япония" },

  { date: "2024-04-28", name: "День святого Пьера Шанеля", country: "Уоллис и Футуна" },



  { date: "2024-04-29", name: "День детей", country: "Колумбия" },
  { date: "2024-04-29", name: "День деревьев(Колумбия)", country: "Колумбия" },


  



  
  { date: "2024-05-01", name: "Праздник Вирхен-де Чапи(Перу)", country: "Перу" },

  { date: "2024-05-01", name: "День Конституции в Аргентине", country: "Аргентина" },
  { date: "2024-05-01", name: "День Конституции(Маршалловы острова)", country: "Маршалловы острова" },
  { date: "2024-05-01", name: "День созыва учредительного собрания", country: "Латвия" },
 
  { date: "2024-05-01", name: "День фонтанов", country: "Узбекистан" },
  { date: "2024-05-01", name: "Кельтский праздник начала лета «Белтайн»", country: "Ирландия" },

  { date: "2024-05-01", name: "Майский день(Непал)", country: "Непал" },


 
  { date: "2024-05-01", name: "Праздник гавайских танцев, День Леи", country: "Гавайские острова" },

  { date: "2024-05-02", name: "День святого Бориса", country: "Болгария" },

 

  { date: "2024-05-02", name: "День учителя в Бутане", country: "Бутан" },
  { date: "2024-05-02", name: "День флага(Польша)", country: "Польша" },

  { date: "2024-05-02", name: "День города Кутаиси", country: "Грузия" },
  
  { date: "2024-05-03", name: "День Конституции", country: "Япония" },
  { date: "2024-05-03", name: "Праздник Третьего мая(Польша)", country: "Польша" },


  


  { date: "2024-05-04", name: "День наследного принца(Тонга)", country: "Тонга" },
  { date: "2024-05-04", name: "День пожарного(Польша)", country: "Польша" },


  { date: "2024-05-04", name: "День молодёжи(Фиджи)", country: "Фиджи" },
  { date: "2024-05-04", name: "День китайской молодёжи", country: "Китай" },

  { date: "2024-05-04", name: "День битвы при Кассинге", country: "Намибия" },
  { date: "2024-05-04", name: "День поминовения мучеников", country: "Афганистан" },
  { date: "2024-05-04", name: "День восстановления независимости(Латвия)", country: "Латвия" },
  { date: "2024-05-04", name: "День поминовения(Нидерланды)", country: "Нидерланды" },
  { date: "2024-05-04", name: "День работников налогового органа", country: "Таджикистан" },
  { date: "2024-05-04", name: "День памяти Милана Ростислава Штефаника", country: "Словакия" },

  { date: "2024-05-04", name: "День святого Флориана", country: "Австрия" },
  { date: "2024-05-05", name: "День печати(Беларусь)", country: "Беларусь" },

  { date: "2024-05-05", name: "Детский день", country: "Южная Корея" },
  { date: "2024-05-05", name: "День пожилых людей(Палау)", country: "Палау" },
 



  { date: "2024-05-05", name: "День памяти жертв нацизма", country: "Австрия" },
  { date: "2024-05-05", name: "День майского восстания чешского народа", country: "Чехия" },
  { date: "2024-05-05", name: "День Конституции(Кыргызстан)", country: "Кыргызстан" },

  { date: "2024-05-05", name: "День освобождения(Нидерланды)", country: "Нидерланды" },
  { date: "2024-05-05", name: "День прибытия индийцев(Гайана)", country: "Гайана" },

  { date: "2024-05-05", name: "День культуры португалоязычных стран(Португалия)", country: "Португалия" },

  { date: "2024-05-05", name: "Пятый день мая", country: "Мексика" },
  { date: "2024-05-05", name: "Праздник просветления «Висакха Буча»(Тайланд)", country: "Тайланд" },
 

  { date: "2024-05-06", name: "Праздник встречи весны «Хедерлез»", country: "Турция" },
 
  { date: "2024-05-06", name: "День горанцев", country: "Косово" },
  
  { date: "2024-05-06", name: "День мучеников(Габон)", country: "Габон" },
  { date: "2024-05-06", name: "День болгарской армии", country: "Болгария" },
  { date: "2024-05-06", name: "Праздник цветов «Анфестирия»", country: "Кипр" },


  { date: "2024-05-07", name: "День матери в Венгрии", country: "Венгрия" },
  { date: "2024-05-07", name: "День победы в битве при Дьенбьенфу", country: "Вьетнам" },
  { date: "2024-05-07", name: "День детей(Тонга)", country: "Тонга" },
  { date: "2024-05-07", name: "День «Человека Моря»(Португалия)", country: "Португалия" },
  { date: "2024-05-07", name: "День работников радио, телевидения и связи(Беларусь)", country: "Беларусь" },
  { date: "2024-05-07", name: "День солдат", country: "Сальвадор" },
  { date: "2024-05-07", name: "День работников связи", country: "Кыргызстан" },

{ date: "2024-05-07", name: "День радио и работников отраслей связи", country: "Таджикистан" },
  { date: "2024-05-08", name: "День родителей", country: "Южная Корея" },

  { date: "2024-05-08", name: "День матери(Токелау)", country: "Токелау" },

  { date: "2024-05-08", name: "День «Еркрапа»", country: "Армения" },

  
  { date: "2024-05-08", name: "День Евангелия(Тувалу)", country: "Тувалу" },
  { date: "2024-05-08", name: "День поминовения национальных героев(Туркменистан)", country: "Туркменистан" },
  { date: "2024-05-08", name: "День Мигеля Идальго", country: "Мексика" },
  { date: "2024-05-08", name: "День актёра и актрисы", country: "Аргентина" },
  { date: "2024-05-08", name: "Праздник первой борозды(Камбоджа)", country: "Камбоджа" },
  { date: "2024-05-08", name: "День ветеранов(Норвегия)", country: "Норвегия" },
  { date: "2024-05-08", name: "Ночь женщин(Норвегия)", country: "Норвегия" },
 
  { date: "2024-05-13", name: "День денима", country: "Канада" },
  { date: "2024-05-11", name: "День матери в Канаде", country: "Канада" },
  { date: "2024-05-09", name: "День Армии обороны(НКР)", country: "НКР" },
  { date: "2024-05-09", name: "День памяти и почестей", country: "Узбекистан" },
  { date: "2024-05-09", name: "День освобождения Шуши", country: "Армения" },

  { date: "2024-05-09", name: "День Гельголандского сражения", country: "Дания" },
  { date: "2024-05-09", name: "Праздник «Лаг ба-Омер»", country: "Израиль" },
  { date: "2024-05-10", name: "День детей(Мальдивы)", country: "Мальдивы" },
  { date: "2024-05-10", name: "День отмены рабства(Франция)", country: "Франция" },


  { date: "2024-05-10", name: "День матери в Сальвадоре", country: "Сальвадор" },
  

 


 
  { date: "2024-05-10", name: "День национальной независимости(Румыния)", country: "Румыния" },




  { date: "2024-05-11", name: "День Конституции(Лаос)", country: "Лаос" },

  { date: "2024-05-11", name: "День Нисгиа", country: "Канада" },
  { date: "2024-05-11", name: "Последний день рыбацкого сезона", country: "Исландия" },


  { date: "2024-05-12", name: "День памяти святого апостола Андрея Первозванного", country: "Грузия" },
  { date: "2024-05-12", name: "День Шашмакома", country: "Таджикистан" },
  
  { date: "2024-05-12", name: "День святого Василия Острожского", country: "Черногория" },
  { date: "2024-05-12", name: "День святой Джоанны(Португалия)", country: "Португалия" },
  { date: "2024-05-12", name: "День армии Республики Сербской", country: "Сербия" },
  { date: "2024-05-12", name: "День железнодорожника(Сербия)", country: "Сербия" },
  { date: "2024-05-12", name: "День финского самосознания, День Снелльмана", country: "Финляндия" },
  { date: "2024-05-12", name: "Праздник «Небесной императрицы Мацзу»", country: "Китай" },

  { date: "2024-05-12", name: "Фестиваль тюльпанов", country: "Канада" },
  
  { date: "2024-05-13", name: "День отмены рабства в Бразилии", country: "Бразилия" },

  { date: "2024-05-13", name: "День святой Марии", country: "Колумбия" },
  { date: "2024-05-13", name: "День рождения короля(Камбоджа)", country: "Камбоджа" },


  { date: "2024-05-13", name: "День Фатимской Богоматери(Португалия)", country: "Португалия" },
  { date: "2024-05-13", name: "День Ротума(Фиджи)", country: "Фиджи" },

  { date: "2024-05-13", name: "День Серватия Маастрихтского(Нидерланды)", country: "Нидерланды" },



{ date: "2024-05-14", name: "День памяти благоверной Тамары", country: "Грузия" },
{ date: "2024-05-14", name: "День Государственного флага и герба", country: "Беларусь" },



{ date: "2024-05-14", name: "День независимости(Парагвай)", country: "Парагвай" },

{ date: "2024-05-14", name: "День Камузу", country: "Малави" },
{ date: "2024-05-14", name: "День отца(Румыния)", country: "Румыния" },
{ date: "2024-05-14", name: "День провозглашения Декларации о независимости", country: "Израиль" },





{ date: "2024-05-15", name: "День матери(Парагвай)", country: "Парагвай" },



{ date: "2024-05-15", name: "День учителя", country: "Южная Корея" },
{ date: "2024-05-15", name: "День учителя в Колумбии", country: "Колумбия" },
{ date: "2024-05-15", name: "День открытия(Каймановы острова)", country: "Каймановы острова" },


{ date: "2024-05-15", name: "День вооружённых сил(Словения)", country: "Словения" },
{ date: "2024-05-15", name: "День восстановления независимости(Австрия)", country: "Австрия" },
{ date: "2024-05-15", name: "День курдского языка", country: "Ирак" },
{ date: "2024-05-15", name: "День учителя", country: "Мексика" },
{ date: "2024-05-15", name: "День памяти о палестинских беженцах (День «Накба»)", country: "Палестина" },







{ date: "2024-09-29", name: "День учителя(Малайзия)", country: "Малайзия" },

{ date: "2024-05-16", name: "День братских могил", country: "Ирак" },


{ date: "2024-05-16", name: "День содружества(Каймановы острова)", country: "Каймановы острова" },
{ date: "2024-05-16", name: "День пограничника(Польша)", country: "Польша" },

{ date: "2024-05-16", name: "День органов государственной безопасности(ПМР)", country: "ПМР" },
{ date: "2024-05-16", name: "День Народной армии освобождения", country: "Южный Судан" },


{ date: "2024-05-17", name: "День детей(Норвегия)", country: "Норвегия" },
{ date: "2024-05-17", name: "День Конституции(Норвегия)", country: "Норвегия" },
{ date: "2024-05-17", name: "День Конституции(Нигерия)", country: "Нигерия" },
{ date: "2024-05-17", name: "День пожарного и спасателя", country: "Латвия" },

{ date: "2024-05-17", name: "День освобождения(Конго)", country: "Конго" },
{ date: "2024-05-17", name: "День военно-морского флота в Аргентине", country: "Аргентина" },

{ date: "2024-05-17", name: "День Конституции(Науру)", country: "Науру" },
{ date: "2024-10-15", name: "День рождения раджи Перлиса", country: "Малайзия" },

{ date: "2024-05-18", name: "Вознесение Господне(Армения)", country: "Армения" },

{ date: "2024-05-18", name: "День коктейля «Цезарь»", country: "Канада" },




{ date: "2024-05-18", name: "День Конституции и Государственного флага(Туркменистан)", country: "Туркменистан" },
{ date: "2024-05-18", name: "День флага(Гаити)", country: "Гаити" },

{ date: "2024-05-19", name: "День Иерусалима", country: "Израиль" },
{ date: "2024-05-19", name: "День рождения Хо Ши Мина", country: "Вьетнам" },
{ date: "2024-05-19", name: "День туризма", country: "Китай" },
{ date: "2024-05-19", name: "День памяти Ататюрка, молодёжи и спорта", country: "Турция" },
{ date: "2024-05-19", name: "День памяти геноцида греков Малой Азии", country: "Греция" },




{ date: "2024-05-20", name: "День Европы", country: "Украина" },
{ date: "2024-05-20", name: "День науки", country: "Украина" },


{ date: "2024-05-20", name: "День независимости от Британской империи(Саудовская Аравия)", country: "Саудовская Аравия" },
{ date: "2024-05-20", name: "День национального траура", country: "Южная Осетия" },

{ date: "2024-05-20", name: "День памяти, День праведного гнева(Камбоджа)", country: "Камбоджа" },
{ date: "2024-05-20", name: "День восстановления независимости(Восточный Тимор)", country: "Восточный Тимор" },
{ date: "2024-05-20", name: "День провозглашения унитарного государства Камерун", country: "Камерун" },

{ date: "2024-05-21", name: "Афро-колумбийский день", country: "Колумбия" },
{ date: "2024-05-21", name: "День матери(Кыргызстан)", country: "Кыргызстан" },

{ date: "2024-05-21", name: "День отца(Тонга)", country: "Тонга" },
{ date: "2024-05-21", name: "День открытия(Остров Святой Елены)", country: "Остров Святой Елены" },


{ date: "2024-05-21", name: "День независимости(Черногория)", country: "Черногория" },
{ date: "2024-05-21", name: "День святых Константина и Елены", country: "Болгария" },
{ date: "2024-05-21", name: "День патриотов и военных", country: "Венгрия" },

{ date: "2024-05-21", name: "День работников финансовой системы(ПМР)", country: "ПМР" },
{ date: "2024-05-21", name: "День военно-морского флота", country: "Чили" },
{ date: "2024-05-21", name: "Праздник огнехождения «Пировассия»", country: "Греция" },
{ date: "2024-05-21", name: "Праздник Предой", country: "Болгария" },

{ date: "2024-05-22", name: "День отмены рабства(Мартиника)", country: "Мартиника" },

{ date: "2024-05-22", name: "День национального единства(Йемен)", country: "Йемен" },
{ date: "2024-05-22", name: "День национального суверенитета", country: "Гаити" },

{ date: "2024-05-23", name: "День святого апостола Симона Кананита", country: "Абхазия" },

{ date: "2024-05-23", name: "День студента", country: "Мексика" },
{ date: "2024-05-23", name: "День Конституции ФРГ", country: "Германия" },

{ date: "2024-05-23", name: "День аромунов(Северная Македония)", country: "Северная Македония" },

{ date: "2024-05-24", name: "День кофе(Бразилия)", country: "Бразилия" },

{ date: "2024-05-24", name: "День культуры и письменности", country: "Болгария" },
{ date: "2024-05-24", name: "День независимости(Эритрея)", country: "Эритрея" },
{ date: "2024-05-24", name: "День памяти Любири(Уганда)", country: "Буганда" },
{ date: "2024-05-24", name: "День битвы при Пичинче", country: "Эквадор" },
{ date: "2024-05-24", name: "День Содружества", country: "Белиз" },



{ date: "2024-05-25", name: "День бухгалтера(Мексика)", country: "Мексика" },

{ date: "2024-05-25", name: "День африканского единства", country: "Гана" },


{ date: "2024-05-26", name: "День независимости(Грузия)", country: "Грузия" },
{ date: "2024-05-26", name: "День победы в Сардарапатской битве", country: "Армения" },
{ date: "2024-05-26", name: "День адвоката(Таджикистан)", country: "Таджикистан" },


{ date: "2024-05-26", name: "День кронпринца Фредерика", country: "Дания" },
{ date: "2024-05-26", name: "День матери(Польша)", country: "Польша" },
{ date: "2024-05-26", name: "День независимости(Гайана)", country: "Гайана" },
{ date: "2024-05-26", name: "Праздник дарования Торы «Шавуот»", country: "Израиль" },
{ date: "2024-05-26", name: "Фестиваль булочек на острове Ченг Чау", country: "Китай" },


{ date: "2024-05-27", name: "День сопротивления(Франция)", country: "Франция" },
{ date: "2024-05-27", name: "День территориального самоуправления(Польша)", country: "Польша" },
{ date: "2024-05-27", name: "День библиотек", country: "Кыргызстан" },

{ date: "2024-05-27", name: "День матери в Боливии", country: "Боливия" },
{ date: "2024-05-27", name: "День отмены рабства(Гваделупа)", country: "Гваделупа" },
{ date: "2024-05-27", name: "День языков коренных народов(Перу)", country: "Перу" },
{ date: "2024-05-27", name: "День вооружённых сил(Никарагуа)", country: "Никарагуа" },

{ date: "2024-05-27", name: "День детей(Нигерия)", country: "Нигерия" },

{ date: "2024-05-27", name: "Праздник святого Иоанна Русского", country: "Греция" },





{ date: "2024-05-28", name: "День детей в Венгрии", country: "Венгрия" },
{ date: "2024-05-28", name: "День вооружённых сил(Хорватия)", country: "Хорватия" },

{ date: "2024-05-28", name: "День республики(Непал)", country: "Непал" },
{ date: "2024-05-28", name: "День падения военного режима", country: "Эфиопия" },
{ date: "2024-05-28", name: "День национального флага(Филиппины)", country: "Филиппины" },
{ date: "2024-05-28", name: "День величия", country: "Пакистан" },
{ date: "2024-05-28", name: "День первой республики", country: "Армения" },




{ date: "2024-05-28", name: "Пятидесятница", country: "Армения" },




{ date: "2024-05-29", name: "День примирения", country: "Австралия" },
{ date: "2024-05-29", name: "День ветеранов(Швеция)", country: "Швеция" },

{ date: "2024-05-29", name: "День почитания старшего поколения", country: "Венесуэла" },
{ date: "2024-05-29", name: "День армии в Аргентине", country: "Аргентина" },
{ date: "2024-05-29", name: "День ветеранов военной службы за рубежом(Польша)", country: "Польша" },
{ date: "2024-05-29", name: "День Азорских островов(Португалия)", country: "Португалия" },
{ date: "2024-05-29", name: "День взятия Стамбула", country: "Турция" },
{ date: "2024-05-29", name: "День принятия Акта о независимости", country: "Южная Осетия" },


{ date: "2024-05-29", name: "День Вооружённых Сил", country: "Кыргызстан" },
{ date: "2024-05-29", name: "День национальных героев(Тёркс и Кайкос)", country: "Тёркс и Кайкос" },
{ date: "2024-05-29", name: "День Рату Сукуна(Фиджи)", country: "Фиджи" },


{ date: "2024-05-30", name: "День картофеля(Перу)", country: "Перу" },



{ date: "2024-05-30", name: "День матери(Никарагуа)", country: "Никарагуа" },
{ date: "2024-05-30", name: "День памяти жертв теракта в аэропорту Лод(Пуэрто-Рико)", country: "Пуэрто-Рико" },

{ date: "2024-05-30", name: "День образования государства", country: "Хорватия" },

{ date: "2024-05-30", name: "День наследия Индии", country: "Тринидад и Тобаго" },
{ date: "2024-05-30", name: "День Ангильи", country: "Ангилья" },
{ date: "2024-05-30", name: "День скаута", country: "Мальдивы" },
{ date: "2024-05-30", name: "Праздник урожая", country: "Малайзия" },



{ date: "2024-05-31", name: "День вооружённых сил в Брунеи", country: "Бруней" },
{ date: "2024-05-31", name: "День республики", country: "ЮАР" },


{ date: "2024-01-01", name: "Новый Год", country: "Россия" },
  { date: "2024-01-07", name: "Рождество Христово", country: "Россия" },
  { date: "2024-01-11", name: "День заповедников и национальных парков России", country: "Россия" },
  { date: "2024-01-12", name: "День работника прокуратуры Российской Федерации", country: "Россия" },
  { date: "2024-01-13", name: "День Российской печати", country: "Россия" },
  { date: "2024-01-14", name: "Старый Новый год", country: "Россия" },
  { date: "2024-01-14", name: "День создания трубопроводных войск России", country: "Россия" },
  { date: "2024-01-15", name: "День образования Следственного комитета РФ", country: "Россия" },
  { date: "2024-01-19", name: "Крещение Господне", country: "Россия" },
  { date: "2024-01-20", name: "День Республики Крым", country: "Россия" },
  { date: "2024-01-21", name: "День инженерных войск России", country: "Россия" },
  { date: "2024-01-25", name: "День российского студенчества (Татьянин день)", country: "Россия" },
  { date: "2024-01-25", name: "День штурмана Военно-Морского Флота России", country: "Россия" },
  { date: "2024-01-27", name: "День воинской славы России - День полного освобождения Ленинграда от фашистской блокады", country: "Россия" },
  { date: "2024-01-27", name: "День памяти жертв Холокоста", country: "Россия" },
  { date: "2024-01-31", name: "Международный день ювелира", country: "Россия" },
  { date: "2024-02-01", name: "День работника лифтового хозяйства", country: "Россия" },
  { date: "2024-02-02", name: "День воинской славы России - День разгрома советскими войсками немецко-фашистских войск в Сталинградской битве", country: "Россия" },
  { date: "2024-02-07", name: "День российского бизнес-образования", country: "Россия" },
  { date: "2024-02-08", name: "День российской науки", country: "Россия" },
  { date: "2024-02-08", name: "День военного топографа в России", country: "Россия" },
  { date: "2024-02-09", name: "День гражданской авиации России", country: "Россия" },
  { date: "2024-02-10", name: "День зимних видов спорта в России", country: "Россия" },
  { date: "2024-02-10", name: "День дипломатического работника в России", country: "Россия" },
  { date: "2024-02-14", name: "День Святого Валентина (день влюбленных)", country: "Россия" },
  { date: "2024-02-15", name: "День памяти о россиянах, исполнявших служебный долг за пределами России", country: "Россия" },
  { date: "2024-02-16", name: "День архива Минэнерго", country: "Россия" },
  { date: "2024-02-17", name: "День российских студенческих отрядов", country: "Россия" },
  { date: "2024-02-17", name: "День Службы горючего Вооруженных Сил России", country: "Россия" },
  { date: "2024-02-18", name: "День транспортной полиции России", country: "Россия" },
  { date: "2024-02-18", name: "День продовольственной и вещевой службы ВС России", country: "Россия" },
  { date: "2024-02-21", name: "Международный день родного языка", country: "Россия" },
  { date: "2024-02-23", name: "День защитника Отечества в России", country: "Россия" },
  { date: "2024-02-27", name: "День Сил специальных операций в России", country: "Россия" },
  { date: "2024-03-01", name: "День Забайкальского края", country: "Россия" },
  { date: "2024-03-01", name: "День эксперта-криминалиста в России", country: "Россия" },
  { date: "2024-03-01", name: "День хостинг-провайдера в России", country: "Россия" },
  { date: "2024-03-01", name: "День кошек в России", country: "Россия" },
  { date: "2024-03-05", name: "День театрального кассира", country: "Россия" },
  { date: "2024-03-08", name: "Международный женский день", country: "Россия" },
  { date: "2024-03-10", name: "День архивов в России", country: "Россия" },
  { date: "2024-03-11", name: "День работников геодезии и картографии России", country: "Россия" },
  { date: "2024-03-11", name: "День работника органов наркоконтроля России", country: "Россия" },
  { date: "2024-03-11", name: "День сотрудников частных охранных агентств в России", country: "Россия" },
  { date: "2024-03-12", name: "День работника уголовно-исполнительной системы России", country: "Россия" },
  { date: "2024-03-18", name: "День воссоединения Крыма с Россией", country: "Россия" },
  { date: "2024-03-18", name: "День работников бытового обслуживания населения и жилищно-коммунального хозяйства в России", country: "Россия" },
  { date: "2024-03-19", name: "День моряка-подводника в России", country: "Россия" },
  { date: "2024-03-22", name: "Всемирный день водных ресурсов", country: "Россия" },
  { date: "2024-03-23", name: "День работников гидрометеорологической службы России", country: "Россия" },
  { date: "2024-03-24", name: "День штурманской службы ВВС России", country: "Россия" },
  { date: "2024-03-25", name: "День работника культуры России", country: "Россия" },
  { date: "2024-03-27", name: "Всемирный день театра", country: "Россия" },
  { date: "2024-03-29", name: "День специалиста юридической службы ВС России", country: "Россия" },
  { date: "2024-04-01", name: "День смеха (День дурака)", country: "Россия" },
  { date: "2024-04-02", name: "День единения народов России и Беларуси", country: "Россия" },
  { date: "2024-04-05", name: "День принятия Степного Уложения (Конституции) Республики Калмыкия", country: "Россия" },
  { date: "2024-04-06", name: "День работников следственных органов МВД России", country: "Россия" },
  { date: "2024-04-07", name: "День памяти погибших подводников", country: "Россия" },
  { date: "2024-04-08", name: "День Российской анимации", country: "Россия" },
  { date: "2024-04-08", name: "День войск противовоздушной обороны России", country: "Россия" },
  { date: "2024-04-08", name: "День сотрудников военных комиссариатов в России", country: "Россия" },
  { date: "2024-04-11", name: "День конституции Республики Крым", country: "Россия" },
  { date: "2024-04-12", name: "День космонавтики", country: "Россия" },
  { date: "2024-04-13", name: "День мецената и благотворителя в России", country: "Россия" },
  { date: "2024-04-15", name: "День специалиста по радиоэлектронной борьбе ВС России", country: "Россия" },
  { date: "2024-04-17", name: "День ветеранов органов внутренних дел и внутренних войск МВД России", country: "Россия" },
  { date: "2024-04-18", name: "Международный день памятников и исторических мест", country: "Россия" },
  { date: "2024-04-19", name: "День российской полиграфии", country: "Россия" },
  { date: "2024-04-19", name: "День работника ломоперерабатывающей отрасли России", country: "Россия" },
  { date: "2024-04-20", name: "Национальный день донора в России", country: "Россия" },
  { date: "2024-04-21", name: "День главного бухгалтера в России", country: "Россия" },
  { date: "2024-04-21", name: "День местного самоуправления в России", country: "Россия" },
  { date: "2024-04-26", name: "День участников ликвидации последствий радиационных аварий и катастроф и памяти жертв этих аварий и катастроф", country: "Россия" },
  { date: "2024-04-26", name: "День нотариата в России", country: "Россия" },
  { date: "2024-04-27", name: "День российского парламентаризма", country: "Россия" },
  { date: "2024-04-27", name: "День образования Республики Саха", country: "Россия" },
  { date: "2024-04-28", name: "День работников скорой медицинской помощи", country: "Россия" },
  { date: "2024-04-28", name: "День химической безопасности", country: "Россия" },
  { date: "2024-04-30", name: "День пожарной охраны России", country: "Россия" },
  { date: "2024-05-01", name: "Праздник Весны и Труда", country: "Россия" },
  { date: "2024-05-05", name: "День водолаза в России", country: "Россия" },
  { date: "2024-05-05", name: "День шифровальщика в России", country: "Россия" },
  { date: "2024-05-06", name: "День святого Георгия Победоносца", country: "Россия" },
  { date: "2024-05-07", name: "День радио", country: "Россия" },
  { date: "2024-05-07", name: "День создания вооруженных сил России", country: "Россия" },
  { date: "2024-05-07", name: "День связиста и специалиста радиотехнической службы ВМФ России", country: "Россия" },
  { date: "2024-05-08", name: "День работников Федеральной службы по военно-техническому сотрудничеству России", country: "Россия" },
  { date: "2024-05-08", name: "День оперативного работника уголовно-исполнительной системы России", country: "Россия" },
  { date: "2024-05-09", name: "День Победы", country: "Россия" },
  { date: "2024-05-13", name: "День Черноморского флота ВМФ России", country: "Россия" },
  { date: "2024-05-13", name: "День охранно-конвойной службы МВД России", country: "Россия" },
  { date: "2024-05-14", name: "День фрилансера в России", country: "Россия" },
  { date: "2024-05-15", name: "Международный день семей", country: "Россия" },
  { date: "2024-05-17", name: "Всемирный день электросвязи и информационного общества", country: "Россия" },
  { date: "2024-05-18", name: "Международный день музеев", country: "Россия" },
  { date: "2024-05-18", name: "День Балтийского флота ВМФ России", country: "Россия" },
  { date: "2024-05-19", name: "День ставропольского края", country: "Россия" },
  { date: "2024-05-21", name: "День полярника в России", country: "Россия" },
  { date: "2024-05-21", name: "День Тихоокеанского флота ВМФ России", country: "Россия" },
  { date: "2024-05-21", name: "День военного переводчика в России", country: "Россия" },
  { date: "2024-05-21", name: "День инвентаризатора", country: "Россия" },
  { date: "2024-05-24", name: "День славянской письменности и культуры", country: "Россия" },
  { date: "2024-05-24", name: "День кадровика в России", country: "Россия" },
  { date: "2024-05-25", name: "День филолога", country: "Россия" },
  { date: "2024-05-25", name: "День сварщика в России", country: "Россия" },
  { date: "2024-05-26", name: "День российского предпринимательства", country: "Россия" },
  { date: "2024-05-27", name: "Общероссийский день библиотек (День библиотекаря)", country: "Россия" },
  { date: "2024-05-27", name: "День химика в России", country: "Россия" },
  { date: "2024-05-28", name: "День пограничника в России", country: "Россия" },
  { date: "2024-05-29", name: "День военного автомобилиста ВС России", country: "Россия" },
  { date: "2024-05-29", name: "День ветеранов таможенной службы", country: "Россия" },
  { date: "2024-05-31", name: "День российской адвокатуры", country: "Россия" },
  { date: "2024-06-01", name: "Международный день защиты детей", country: "Россия" },
  { date: "2024-06-01", name: "День Северного флота ВМФ России", country: "Россия" },
  { date: "2024-06-04", name: "День крановщика", country: "Россия" },
  { date: "2024-06-05", name: "День эколога", country: "Россия" },
  { date: "2024-06-06", name: "День русского языка", country: "Россия" },
  { date: "2024-06-08", name: "День Республики Карелия", country: "Россия" },
  { date: "2024-06-09", name: "День пивовара в России", country: "Россия" },
  { date: "2024-06-09", name: "День мебельщика в России", country: "Россия" },
  { date: "2024-06-10", name: "День работников текстильной и легкой промышленности", country: "Россия" },
  { date: "2024-06-12", name: "День России", country: "Россия" },
  { date: "2024-06-14", name: "День работника миграционной службы России", country: "Россия" },
  { date: "2024-06-17", name: "День медицинского работника", country: "Россия" },
  { date: "2024-06-20", name: "День специалиста минно-торпедной службы ВМФ России", country: "Россия" },
  { date: "2024-06-21", name: "День кинолога в России", country: "Россия" },
  { date: "2024-06-22", name: "День памяти и скорби - день начала Великой Отечественной войны", country: "Россия" },
  { date: "2024-06-23", name: "День балалайки", country: "Россия" },
  { date: "2024-06-24", name: "День Республики Чувашия", country: "Россия" },
  { date: "2024-06-27", name: "День молодежи России", country: "Россия" },
  { date: "2024-06-29", name: "День партизан и подпольщиков России", country: "Россия" },
  { date: "2024-06-29", name: "День кораблестроителя России", country: "Россия" },
  { date: "2024-06-30", name: "День сотрудника службы охраны уголовно-исполнительной системы Министерства юстиции России", country: "Россия" },
  { date: "2024-06-30", name: "День изобретателя и рационализатора в России", country: "Россия" },
  { date: "2024-07-01", name: "День работников морского и речного флота России", country: "Россия" },
  { date: "2024-07-01", name: "День ветеранов боевых действий", country: "Россия" },
  { date: "2024-07-03", name: "День ГАИ России", country: "Россия" },
  { date: "2024-07-03", name: "День образования Республики Алтай", country: "Россия" },
  { date: "2024-07-03", name: "День республики Хакасия", country: "Россия" },
  { date: "2024-07-07", name: "День Ивана Купала", country: "Россия" },
  { date: "2024-07-08", name: "День любви, семьи и верности", country: "Россия" },
  { date: "2024-07-08", name: "День российской почты", country: "Россия" },
  { date: "2024-07-08", name: "День рыбака в России", country: "Россия" },
  { date: "2024-07-11", name: "День светооператора", country: "Россия" },
  { date: "2024-07-15", name: "День Металлурга", country: "Россия" },
  { date: "2024-07-17", name: "День основания морской авиации ВМФ России", country: "Россия" },
  { date: "2024-07-19", name: "День юридической службы Министерства внутренних дел России", country: "Россия" },
  { date: "2024-07-24", name: "День кадастрового инженера в России", country: "Россия" },
  { date: "2024-07-25", name: "День сотрудника органов следствия Российской Федерации", country: "Россия" },
  { date: "2024-07-25", name: "День речной полиции в России", country: "Россия" },
  { date: "2024-07-26", name: "День парашютиста в России", country: "Россия" },
  { date: "2024-07-28", name: "День Крещения Руси", country: "Россия" },
  { date: "2024-07-28", name: "День PR-специалиста в России", country: "Россия" },
  { date: "2024-07-31", name: "День Военно-Морского Флота России", country: "Россия" },
  { date: "2024-07-29", name: "День работников торговли в России", country: "Россия" },
  { date: "2024-08-01", name: "День Тыла Вооруженных Сил России", country: "Россия" },
 
  { date: "2024-08-12", name: "День строителя", country: "Россия" },
  { date: "2024-08-15", name: "День Республики Тыва", country: "Россия" },
  { date: "2024-08-19", name: "День Воздушного Флота России", country: "Россия" },
  { date: "2024-08-22", name: "День Государственного флага Российской Федерации", country: "Россия" },
  { date: "2024-08-22", name: "День Республики Коми", country: "Россия" },
  { date: "2024-08-26", name: "День шахтера в России", country: "Россия" },
  { date: "2024-08-27", name: "День российского кино", country: "Россия" },
  { date: "2024-08-30", name: "День Республики Татарстан", country: "Россия" },
  { date: "2024-09-01", name: "День знаний в России", country: "Россия" },
  { date: "2024-09-02", name: "День российской гвардии", country: "Россия" },
  { date: "2024-09-02", name: "День работников нефтяной, газовой и топливной промышленности в России", country: "Россия" },
  { date: "2024-09-02", name: "День патрульно-постовой службы полиции МВД России", country: "Россия" },
  { date: "2024-09-03", name: "День солидарности в борьбе с терроризмом", country: "Россия" },
  { date: "2024-09-04", name: "День специалиста по ядерному обеспечению России", country: "Россия" },
  { date: "2024-09-08", name: "День Новороссийского военно-морского района", country: "Россия" },
  { date: "2024-09-08", name: "День финансиста в России", country: "Россия" },
  { date: "2024-09-09", name: "День танкиста в России", country: "Россия" },
  { date: "2024-09-13", name: "День программиста в России", country: "Россия" },
  { date: "2024-09-13", name: "День парикмахера в России", country: "Россия" },
  { date: "2024-09-16", name: "День работников леса в России", country: "Россия" },
  { date: "2024-09-19", name: "День оружейника в России", country: "Россия" },
  { date: "2024-09-24", name: "День Государственного герба и Государственного флага республики Крым", country: "Россия" },
  { date: "2024-09-27", name: "День воспитателя и всех дошкольных работников в России", country: "Россия" },
  { date: "2024-09-28", name: "День работников атомной промышленности в России", country: "Россия" },
  { date: "2024-09-28", name: "День генерального директора в России", country: "Россия" },
  { date: "2024-09-29", name: "День отоларинголога", country: "Россия" },
  { date: "2024-09-30", name: "День машиностроителя в России", country: "Россия" },
  { date: "2024-09-30", name: "День HR-менеджера", country: "Россия" },
  { date: "2024-10-01", name: "День пожилых людей в России", country: "Россия" },
  { date: "2024-10-01", name: "День сухопутных войск России", country: "Россия" },
  { date: "2024-10-05", name: "День работников уголовного розыска России", country: "Россия" },
  { date: "2024-10-06", name: "День российского страховщика", country: "Россия" },
  { date: "2024-10-07", name: "День образования штабных подразделений МВД России", country: "Россия" },
  { date: "2024-10-08", name: "День командира наводного, подводного и воздушного корабля ВМФ России", country: "Россия" },
  { date: "2024-10-11", name: "День Республики Башкортостан", country: "Россия" },
  { date: "2024-10-14", name: "День работника сельского хозяйства и перерабатывающей промышленности в России", country: "Россия" },
  { date: "2024-10-14", name: "День работников заповедного дела в России", country: "Россия" },
  { date: "2024-10-20", name: "День военного связиста в России", country: "Россия" },
  { date: "2024-10-21", name: "День работников пищевой промышленности России", country: "Россия" },
  { date: "2024-10-21", name: "День работников дорожного хозяйства в России", country: "Россия" },
  { date: "2024-10-22", name: "День финансово-экономической службы ВС России", country: "Россия" },
  { date: "2024-10-23", name: "День работников рекламы в России", country: "Россия" },
  { date: "2024-10-24", name: "День подразделений специального назначения ВС России", country: "Россия" },
  { date: "2024-10-25", name: "День Приморского края", country: "Россия" },
  { date: "2024-10-25", name: "День таможенника Российской Федерации", country: "Россия" },
  { date: "2024-10-25", name: "День работника кабельной промышленности в России", country: "Россия" },
  { date: "2024-10-27", name: "Всероссийский день гимнастики", country: "Россия" },
  { date: "2024-10-28", name: "День автомобилиста в России", country: "Россия" },
  { date: "2024-10-28", name: "День бабушек и дедушек", country: "Россия" },
  { date: "2024-10-29", name: "День работников вневедомственной охраны Росгвардии", country: "Россия" },
  { date: "2024-10-30", name: "День инженера-механика в России", country: "Россия" },
  { date: "2024-10-31", name: "День сурдопереводчика в России", country: "Россия" },
  { date: "2024-10-31", name: "День работников СИЗО и тюрем в России", country: "Россия" },
  { date: "2024-11-08", name: "День памяти погибших при исполнении служебных обязанностей сотрудников органов внутренних дел и военнослужащих внутренних войск МВД России", country: "Россия" },
  { date: "2024-11-10", name: "День сотрудника органов внутренних дел Российской Федерации", country: "Россия" },
  { date: "2024-11-11", name: "День экономиста в России", country: "Россия" },
  { date: "2024-11-11", name: "День работника восстановительного поезда в России", country: "Россия" },
  { date: "2024-11-12", name: "День работников Сбербанка России", country: "Россия" },
  { date: "2024-11-12", name: "День специалиста по безопасности в России", country: "Россия" },
  { date: "2024-11-13", name: "День войск радиационной, химической и биологической защиты России", country: "Россия" },
  { date: "2024-11-14", name: "День социолога в России", country: "Россия" },
  { date: "2024-11-15", name: "Всероссийский день призывника", country: "Россия" },
  { date: "2024-11-17", name: "День участкового в России", country: "Россия" },
  { date: "2024-11-18", name: "День рождения Деда Мороза", country: "Россия" },
  { date: "2024-11-19", name: "День ракетных войск и артиллерии в России", country: "Россия" },
  { date: "2024-11-19", name: "День работника стекольной промышленности", country: "Россия" },
  { date: "2024-11-21", name: "День работника налоговых органов Российской федерации", country: "Россия" },
  { date: "2024-11-27", name: "День морской пехоты России", country: "Россия" },
  { date: "2024-11-27", name: "День оценщика в России", country: "Россия" },
  { date: "2024-12-01", name: "Всемирный день борьбы со СПИДом", country: "Россия" },
  { date: "2024-12-01", name: "Всероссийский день хоккея", country: "Россия" },

  { date: "2024-12-15", name: "День памяти журналистов, погибших при исполнении профессиональных обязанностей", country: "Россия" },
  { date: "2024-12-17", name: "День ракетных войск стратегического назначения Вооруженных Сил России", country: "Россия" },
  { date: "2024-12-17", name: "День сотрудников фельдъегерской службы России", country: "Россия" },
  { date: "2024-12-18", name: "День работников ЗАГСа в России", country: "Россия" },
  { date: "2024-12-18", name: "День подразделений собственной безопасности органов внутренних дел России", country: "Россия" },
  { date: "2024-12-19", name: "День военной контрразведки в России", country: "Россия" },
  { date: "2024-12-19", name: "День снабженца в России", country: "Россия" },
  { date: "2024-12-20", name: "День работников органов государственной безопасности РФ", country: "Россия" },
  { date: "2024-12-22", name: "День энергетика в России", country: "Россия" },
  { date: "2024-12-23", name: "День дальней авиации ВВС России", country: "Россия" },
  { date: "2024-12-27", name: "День спасателя Российской Федерации", country: "Россия" },
  { date: "2024-12-01", name: "День сетевика", country: "Россия" },
  { date: "2024-02-24", name: "Масленица в России", country: "Россия" },
  { date: "2024-05-05", name: "Пасха", country: "Россия" },

      { date: "2024-06-01", name: "День ребёнка(Китай)", country: "Китай" },

      { date: "2024-06-01", name: "День матери и ребёнка", country: "Монголия" },
     
  
      { date: "2024-06-01", name: "День военно-морского флота(Мексика)", country: "Мексика" },

      { date: "2024-06-01", name: "День пришествия Крестительницы Грузии", country: "Грузия" },
      { date: "2024-06-01", name: "День молодёжи(Кабо-Верде)", country: "Кабо-Верде" },
      { date: "2024-06-01", name: "День свободы Кении", country: "Кения" },
      { date: "2024-06-01", name: "День работников архивов и управления документацией(ПМР)", country: "ПМР" },
      { date: "2024-06-01", name: "День президента(Палау)", country: "Палау" },
      { date: "2024-06-01", name: "День победы(Тунис)", country: "Тунис" },
      { date: "2024-06-01", name: "День независимости(Самоа)", country: "Самоа" },

      { date: "2024-06-01", name: "День даяков", country: "Малайзия" },
      { date: "2024-06-01", name: "День работников государственных органов по борьбе с наркотиками", country: "Таджикистан" },
      { date: "2024-06-01", name: "Фестиваль деревьев", country: "Бенин" },
{ date: "2024-01-01", name: "Первое января (Праздник Святой Марии Богородицы)", country: "Ватикан" },
{ date: "2024-01-06", name: "Шестое января (Богоявление)", country: "Ватикан" },
{ date: "2024-02-09", name: "Праздник Святого Иосифа", country: "Ватикан" },
{ date: "2024-12-25", name: "Рождество (Праздник Рождества Христова)", country: "Ватикан" },
{ date: "2024-06-29", name: "Праздник Святого Петра и Павла", country: "Ватикан" },
{ date: "2024-03-31", name: "Пасха(Ватикан)", country: "Ватикан" },
{ date: "2024-05-09", name: "Вознесение Господне", country: "Ватикан" },

      { date: "2024-06-02", name: "День собак", country: "Аргентина" },

      
      { date: "2024-06-02", name: "День ветеранов, День наград", country: "Канада" },
      { date: "2024-08-01", name: "День молодёжи(Маршалловы острова)", country: "Маршалловы острова" },

      { date: "2024-06-02", name: "День памяти Христо Ботева", country: "Болгария" },
      { date: "2024-06-02", name: "День лесного хозяйства", country: "Бутан" },
      { date: "2024-06-02", name: "День коронации четвёртого Друк Гьялпо", country: "Бутан" },

      { date: "2024-06-02", name: "День пожарных-добровольцев", country: "Аргентина" },

      { date: "2024-06-02", name: "День провинции Исабель(Соломоновы острова)", country: "Соломоновы острова" },
      { date: "2024-06-02", name: "День мотоциклетной гонки «Senior Tourist Trophy»", country: "Остров Мэн" },
      { date: "2024-06-02", name: "День железнодорожника(Словения)", country: "Словения" },




      
      { date: "2024-06-03", name: "День здоровья и фитнеса", country: "Канада" },
 
    
      { date: "2024-06-03", name: "День горы Чимборасо", country: "Эквадор" },
      { date: "2024-06-03", name: "День мучеников(Уганда)", country: "Уганда" },
      { date: "2024-06-03", name: "День объявления независимости", country: "Черногория" },
      { date: "2024-06-03", name: "День вооружённых сил(Намибия)", country: "Намибия" },
      { date: "2024-06-03", name: "День Мабо", country: "Австралия" },
      { date: "2024-06-03", name: "День рождения короля Янг ди-Пертуан Агонга", country: "Малайзия" },
      { date: "2024-06-03", name: "Фестиваль роз", country: "Болгария" },

  
      { date: "2024-06-04", name: "День учителя в Венгрии", country: "Венгрия" },
      { date: "2024-06-04", name: "День Будды", country: "Монголия" },
     

      { date: "2024-06-04", name: "День памяти восстания", country: "Гана" },
      
      { date: "2024-06-04", name: "День вооружённых сил Канады", country: "Канада" },
      { date: "2024-06-04", name: "День государственного флага", country: "Эстония" },
      { date: "2024-06-04", name: "День государственных символов(Казахстан)", country: "Казахстан" },

    

      { date: "2024-06-04", name: "День работников торговли(Таджикистан)", country: "Таджикистан" },

      { date: "2024-06-04", name: "День свободы и гражданских прав(Польша)", country: "Польша" },
      { date: "2024-06-04", name: "День независимости(Тонга)", country: "Тонга" },
      { date: "2024-06-04", name: "День национального единства(Венгрия)", country: "Венгрия" },
      { date: "2024-06-04", name: "День Трианонского договора(Румыния)", country: "Румыния" },
      { date: "2024-06-04", name: "День Паринирваны", country: "Бутан" },
      { date: "2024-06-04", name: "День памяти жертв резни на площади Тяньаньмэнь", country: "Китай" },
      
      { date: "2024-06-04", name: "День знамени Оборонительных сил", country: "Финляндия" },
      { date: "2024-06-04", name: "Годовщина смерти имама Хомейни", country: "Иран" },


      { date: "2024-06-05", name: "День отца в Дании", country: "Дания" },

      { date: "2024-06-05", name: "День учителя(Румыния)", country: "Румыния" },
      { date: "2024-06-05", name: "День Западной Австралии", country: "Австралия" },
      { date: "2024-06-05", name: "День памяти святой Рипсимэ", country: "Армения" },



      { date: "2024-06-05", name: "День работников государственных природоохранных органов(ПМР)", country: "ПМР" },
      { date: "2024-06-05", name: "День освобождения(Сейшельские Острова)", country: "Сейшельские Острова" },
     
      { date: "2024-06-05", name: "День прибытия индийцев(Суринам)", country: "Суринам" },
      
      { date: "2024-06-05", name: "День «Восстания 15 Хордада»", country: "Иран" },
    
      

      { date: "2024-06-06", name: "День памяти святой Гаянэ", country: "Армения" },

    
   
,
          
          { date: "2024-06-06", name: "День основания Союза детей Кореи", country: "КНДР" },
          { date: "2024-06-06", name: "День учителя в Боливии", country: "Боливия" },
        
          { date: "2024-06-06", name: "День инженера", country: "Аргентина" },
          { date: "2024-06-06", name: "День высадки союзников в Нормандии", country: "Франция" },
          { date: "2024-06-06", name: "День поминовения", country: "Южная Корея" },
          { date: "2024-06-06", name: "День штата Квинсленд", country: "Австралия" },
          { date: "2024-06-06", name: "Национальный день", country: "Швеция" },

         
          { date: "2024-06-07", name: "День свободы выражения", country: "Мексика" },
          { date: "2024-06-07", name: "День финансовых и экономических работников", country: "Кыргызстан" },
          { date: "2024-06-07", name: "День рождения принца Йоахима", country: "Дания" },
          { date: "2024-06-07", name: "День Меморандума словацкой нации", country: "Словакия" },
          { date: "2024-06-07", name: "День пехоты, День сражения при Арике", country: "Чили" },
          { date: "2024-06-07", name: "День хорватской дипломатии", country: "Хорватия" },

     
          { date: "2024-06-07", name: "День расторжения унии со Швецией(Норвегия)", country: "Норвегия" },
          { date: "2024-06-07", name: "День журналиста в Аргентине", country: "Аргентина" },
          { date: "2024-06-07", name: "День флага(Перу)", country: "Перу" },

          { date: "2024-06-08", name: "День «Баунти»", country: "Остров Норфолк" },
          { date: "2024-06-08", name: "День инженера(Перу)", country: "Перу" },


          { date: "2024-06-08", name: "День провинции Темоту(Соломоновы острова)", country: "Соломоновы острова" },
          { date: "2024-06-08", name: "День памяти павших за Францию в Индокитае", country: "Франция" },
          { date: "2024-06-08", name: "День Приможа Трубара(Словения)", country: "Словения" },
  
        
      
          { date: "2024-06-09", name: "День геолога", country: "Аргентина" },
          { date: "2024-06-09", name: "День героев(Уганда)", country: "Уганда" },
        

          { date: "2024-06-09", name: "День автономии", country: "Аланде" },
      
        
          { date: "2024-06-09", name: "День святого Колумба", country: "Ирландия" },
          { date: "2024-06-09", name: "День памяти апостола Бразилии Жозе ди Аншиеты", country: "Бразилия" },

          
          { date: "2024-06-10", name: "День отмены рабства(Гвиана)", country: "Гвиана" },
       
        
          { date: "2024-06-10", name: "День всенародного поминовения", country: "Кыргызстан" },
          
          { date: "2024-06-10", name: "День Португалии, Камоэнса и португальских сообществ(Португалия)", country: "Португалия" },
      

          { date: "2024-06-10", name: "День детей(Гаити)", country: "Гаити" },

          { date: "2024-06-11", name: "День матери(Люксембург)", country: "Люксембург" },

  

          { date: "2024-06-11", name: "День канадских рек", country: "Канада" },
          { date: "2024-06-11", name: "День студента(Гондурас)", country: "Гондурас" },
        
          { date: "2024-06-11", name: "День военно-морских сил в Бразилии", country: "Бразилия" },
          { date: "2024-06-11", name: "День рождения принца-консорта Хенрика", country: "Дания" },
          { date: "2024-06-11", name: "День короля Камехамеха", country: "Гавайские острова" },
          { date: "2024-06-11", name: "День моряка", country: "Исландия" },

          { date: "2024-06-11", name: "Праздник Эчмиадзинского кафедрального собора", country: "Армения" },


    
          { date: "2024-06-12", name: "День мира(Косово)", country: "Косово" },
          { date: "2024-06-12", name: "День влюблённых", country: "Бразилия" },

          { date: "2024-06-12", name: "День Хельсинки", country: "Финляндия" },
          { date: "2024-06-12", name: "День мира(Парагвай)", country: "Парагвай" },
          { date: "2024-06-12", name: "День независимости(Филиппины)", country: "Филиппины" },
          { date: "2024-06-12", name: "День демократии(Нигерия)", country: "Нигерия" },
 
          { date: "2024-06-12", name: "День службы государственной защиты(Польша)", country: "Польша" },
          { date: "2024-06-12", name: "День науки(Туркменистан)", country: "Туркменистан" },

       
          { date: "2024-06-13", name: "День венгерских изобретателей", country: "Венгрия" },
          { date: "2024-06-13", name: "День военной жандармерии(Польша)", country: "Польша" },
          { date: "2024-06-13", name: "День памяти мучеников в Сулеймании", country: "Ирак" },

      
      
       
       

          { date: "2024-06-14", name: "День траура и надежды", country: "Литва" },
          { date: "2024-06-14", name: "День освобождения", country: "Фолклендские острова" },
          { date: "2024-06-14", name: "День свободы(Малави)", country: "Малави" },
          
          { date: "2024-06-14", name: "День памяти жертв коммунистических репрессий", country: "Эстония" },
          { date: "2024-06-14", name: "День защиты прав безвинно осужденных", country: "Армения" },
          { date: "2024-06-14", name: "День памяти жертв немецких нацистских концентрационных лагерей(Польша)", country: "Польша" },


 
  { date: "2024-06-15", name: "День флага(Дания)", country: "Дания" },
    


         
          { date: "2024-06-16", name: "День молодёжи(ЮАР)", country: "ЮАР" },
          { date: "2024-06-16", name: "День инженера в Аргентине", country: "Аргентина" },
          { date: "2024-06-16", name: "День отца(Сейшельские Острова)", country: "Сейшельские Острова" },
          { date: "2024-06-16", name: "День Блума", country: "Ирландия" },
       
         


          { date: "2024-06-17", name: "День отца(Гватемала)", country: "Гватемала" },
          { date: "2024-06-17", name: "День авиации(Румыния)", country: "Румыния" },
          { date: "2024-06-17", name: "День независимости Исландии", country: "Исландия" },
          { date: "2024-06-17", name: "День оккупации", country: "Латвия" },
          
          { date: "2024-06-17", name: "День памяти Мартина Мигеля де Гуэмеса", country: "Аргентина" },
   
      

          { date: "2024-06-18", name: "День сыра(Латвия)", country: "Латвия" },
          { date: "2024-06-18", name: "День авиации(Армения)", country: "Армения" },
          { date: "2024-06-18", name: "День отца(Украина)", country: "Украина" },
      
         

          { date: "2024-06-18", name: "День работников водного хозяйства(Кыргызстан)", country: "Кыргызстан" },
       
         
          { date: "2024-06-18", name: "День эвакуации", country: "Египет" },
          { date: "2024-06-18", name: "День Конституции(Сейшельские Острова)", country: "Сейшельские Острова" },
          { date: "2024-06-18", name: "День рождения королевы-матери(Камбоджа)", country: "Камбоджа" },


          { date: "2024-06-18", name: "День основания провинции Бенгет", country: "Филиппины" },

        
       

          { date: "2024-06-19", name: "День независимости(Венгрия)", country: "Венгрия" },
          { date: "2024-06-19", name: "День начала работы Ким Чен Ира в ЦК Трудовой партии", country: "КНДР" },
          { date: "2024-06-19", name: "День провинции Южный Суригао", country: "Филиппины" },
          { date: "2024-06-19", name: "День памяти жертв Бендерской трагедии(ПМР)", country: "ПМР" },
          { date: "2024-06-19", name: "День «Больше никогда»(Уругвай)", country: "Уругвай" },
          { "date": "2024-01-01", "name": "Новый год(США)", "country": "США" },
          { "date": "2024-05-27", "name": "День памяти(США)", "country": "США" },  // Плавающий понедельник
          { "date": "2024-07-04", "name": "День независимости(США)", "country": "США" },
          { "date": "2024-09-02", "name": "День труда(США)", "country": "США" }, // Плавающий понедельник
          { "date": "2024-11-28", "name": "День благодарения(США)", "country": "США" }, // Плавающий четверг
          { "date": "2024-12-25", "name": "Рождество(США)", "country": "США" },
          { "date": "2024-01-15", "name": "День Мартина Лютера Кинга-младшего(США)", "country": "США" }, // Плавающий понедельник
          { "date": "2024-02-19", "name": "День рождения Вашингтона(США)", "country": "США" }, // Плавающий понедельник
          { "date": "2024-06-19", "name": "Девятнадцатое июня(США)", "country": "США" },
          { "date": "2024-10-14", "name": "День Колумба(США)", "country": "США" }, // Плавающий понедельник
          { "date": "2024-11-11", "name": "День ветеранов(США)", "country": "США" },

        
       

          { date: "2024-06-19", name: "День рождения королевы(Остров Норфолк)", country: "Остров Норфолк" },
          { date: "2024-06-19", name: "Праздник «Святое Сердце»", country: "Колумбия" },

        
          


         
          

          { date: "2024-06-20", name: "День национального флага в Аргентине", country: "Аргентина" },
          { date: "2024-06-20", name: "День суверенитета", country: "Узбекистан" },
          { date: "2024-06-20", name: "День мучеников(Эритрея)", country: "Эритрея" },
     

          { date: "2024-06-21", name: "Андо-амазонский Новый год", country: "Боливия" },
          { date: "2024-06-21", name: "День личных размышлений", country: "Ирландия" },
   
          { date: "2024-06-21", name: "День отца(Египет)", country: "Египет" },
       
          { date: "2024-06-21", name: "День мучеников(Того)", country: "Того" },
          { date: "2024-06-21", name: "День флага Шетландских островов", country: "Шотландия" },
       
          { date: "2024-06-21", name: "День вьетнамских журналистов", country: "Вьетнам" },
      
      

         
        

          { date: "2024-06-22", name: "День борьбы против фашистов", country: "Хорватия" },
          { date: "2024-06-22", name: "День учителя в Сальвадоре", country: "Сальвадор" },
         
        
          { date: "2024-06-22", name: "День адвоката(Колумбия)", country: "Колумбия" },
     
          { date: "2024-06-22", name: "День памяти героев битвы под Цесисом", country: "Латвия" },
          { date: "2024-06-22", name: "День торгово-ремесленных объединений", country: "Иран" },
          { date: "2024-06-22", name: "Праздник драконьих лодок", country: "Китай" },
          { date: "2024-06-22", name: "Праздник середины года «Тэт Доан Нго»", country: "Вьетнам" },

       

          { date: "2024-06-23", name: "День полиции(Казахстан)", country: "Казахстан" },
          { date: "2024-06-23", name: "День отца(Польша)", country: "Польша" },
          { date: "2024-06-23", name: "День независимости кантона Юра", country: "Швейцария" },
       
          { date: "2024-06-23", name: "День работников государственной и муниципальной службы", country: "Кыргызстан" },
          { date: "2024-06-23", name: "День памяти в Окинаве", country: "Япония" },
          { date: "2024-06-23", name: "День провозглашения суверенитета", country: "Молдова" },
          { date: "2024-06-23", name: "День победы в Выннуском сражении", country: "Эстония" },
       
   
          { date: "2024-06-23", name: "Национальный праздник(Люксембург)", country: "Люксембург" },
         
          { date: "2024-06-23", name: "Праздник «Сан-Хуан»", country: "Боливия" },


     
          { date: "2024-06-24", name: "День ветеранов(Нидерланды)", country: "Нидерланды" },
          { date: "2024-06-24", name: "День битвы при Бэннокберне", country: "Шотландия" },
       
         
          { date: "2024-06-24", name: "День финского флага", country: "Финляндия" },
          { date: "2024-06-24", name: "Иванов день, Юханнус", country: "Финляндия" },
         

     
          { date: "2024-06-24", name: "Праздник «Сан-Хуан Баутиста»", country: "Эквадор" },
          { date: "2024-06-24", name: "День фермера(Перу)", country: "Перу" },
          { date: "2024-06-24", name: "Праздник солнца «Инти Райми»(Перу)", country: "Перу" },
        

          { date: "2024-06-25", name: "День молодёжи(Беларусь)", country: "Беларусь" },
     
          { date: "2024-06-25", name: "День борьбы с американским империализмом", country: "КНДР" },
          { date: "2024-06-25", name: "День отца(Гаити)", country: "Гаити" },
       

      
          { date: "2024-06-25", name: "День юриста", country: "Кыргызстан" },
          { date: "2024-06-25", name: "День начала Корейской войны", country: "КНДР" },
          { date: "2024-08-07", name: "День независимости(Мозамбик)", country: "Мозамбик" },
          { date: "2024-06-25", name: "День учителя(Гватемала)", country: "Гватемала" },

          { date: "2024-06-25", name: "День государственности(Словения)", country: "Словения" },
          { date: "2024-06-25", name: "День государственности(Хорватия)", country: "Хорватия" },
               { date: "2024-06-26", name: "День работников органов прокуратуры(Туркменистан)", country: "Туркменистан" },
               { date: "2024-06-26", name: "День рождения президента", country: "Исландия" },
               { date: "2024-06-27", name: "День кофе(Колумбия)", country: "Колумбия" },
              
               { date: "2024-06-27", name: "День молодёжи", country: "Южная Осетия" },
               { date: "2024-06-27", name: "День никарагуанского сопротивления, мира, свободы, единства и национального примирения", country: "Никарагуа" },
               { date: "2024-06-27", name: "День метисов", country: "Бразилия" },
               { date: "2024-06-27", name: "День независимости(Джибути)", country: "Джибути" },
               { date: "2024-06-27", name: "День журналиста(Венесуэла)", country: "Венесуэла" },
               { date: "2024-06-27", name: "День национального единства", country: "Таджикистан" },
               { date: "2024-06-10", name: "Праздник святого Виллайброрда(Люксембург)", country: "Люксембург" },
               { date: "2024-06-27", name: "День памяти жертв коммунистического режима", country: "Чехия" },
              
               
               { date: "2024-06-28", name: "День севиче(Перу)", country: "Перу" },
               { date: "2024-06-28", name: "День Конституции(Украина)", country: "Украина" },
               { date: "2024-06-28", name: "День семьи(Вьетнам)", country: "Вьетнам" },
      
               { date: "2024-06-28", name: "День рождения Гуру Ринпоче", country: "Бутан" },
               { date: "2024-06-28", name: "День памяти Познанского июня 1956 года(Польша)", country: "Польша" },
               { date: "2024-06-28", name: "Праздник «Видовдан», День святого великомученика князя Лазаря и всех мучеников сербских", country: "Сербия" },
      
             
               { date: "2024-06-29", name: "День памяти павших за Родину и без вести пропавших(НКР)", country: "НКР" },
               { date: "2024-06-29", name: "День спорта(Фиджи)", country: "Фиджи" },
               { date: "2024-06-29", name: "День центральной провинции(Соломоновы острова)", country: "Соломоновы острова" },
          
             
               { date: "2024-06-29", name: "День независимости(Сейшельские Острова)", country: "Сейшельские Острова" },
               { date: "2024-06-29", name: "День рыбака", country: "Гренада" },
         

               { date: "2024-06-30", name: "День экономиста(Беларусь)", country: "Беларусь" },
       

               { date: "2024-06-30", name: "День военно-морского флота(Израиль)", country: "Израиль" },
               { date: "2024-06-30", name: "День всеобщей молитвы", country: "ЦАР" },
               
         
  
          { date: "2024-06-26", name: "День независимости(Мадагаскар)", country: "Мадагаскар" },
          { date: "2024-06-26", name: "День работников прокуратуры в Беларусии(Беларусь)", country: "Беларусь" },
 
          
          { date: "2024-06-26", name: "День каноэ", country: "Канада" },
          { date: "2024-06-26", name: "День независимости от Великобритании", country: "Сомали" },
          { date: "2024-06-26", name: "День Вооружённых сил Азербайджана", country: "Азербайджан" },
         
          { date: "2024-06-26", name: "День национального флага(Румыния)", country: "Румыния" },
        { date: "2024-06-30", name: "День армии(Гватемала)", country: "Гватемала" },
        { date: "2024-06-30", name: "День революции(Судан)", country: "Судан" },
        { date: "2024-06-30", name: "День филиппино-испанской дружбы", country: "Филиппины" },
        { date: "2024-06-30", name: "День провозглашения независимости от Бельгии(Конго)", country: "Конго" },
        { date: "2024-06-30", name: "Годовщина протестов 30 июня", country: "Египет" },
        { date: "2024-06-30", name: "Международный фестиваль джаза в Монреале", country: "Канада" },
        { date: "2024-06-30", name: "Праздник «Шоу Борролоола»", country: "Австралия" },
        { date: "2024-07-01", name: "Банковский выходной", country: "Египет" },

        { date: "2024-07-01", name: "День Коммунистической партии Китая", country: "Китай" },
        { date: "2024-07-01", name: "День специального административного региона Гонконг", country: "Китай" },
        { date: "2024-07-01", name: "День инженера в Бахрейне", country: "Бахрейн" },
       
        { date: "2024-07-01", name: "День Канады", country: "Канада" },
      
        { date: "2024-07-01", name: "День работников прокуратуры(Армения)", country: "Армения" },
        { date: "2024-07-01", name: "День налогового работника", country: "Кыргызстан" },
        { date: "2024-07-01", name: "День семьи(Лесото)", country: "Лесото" },

        { date: "2024-07-01", name: "День Мадейры(Португалия)", country: "Португалия" },
        { date: "2024-07-01", name: "День независимости от Бельгии", country: "Бурунди" },
        { date: "2024-07-01", name: "День отмены рабства(Нидерланды)", country: "Нидерланды" },
        { date: "2024-07-01", name: "День независимости Руанды(Руанда)", country: "Руанда" },
        { date: "2024-07-01", name: "День инженера(Мексика)", country: "Мексика" },
        { date: "2024-07-01", name: "День Вооружённых сил(Сингапур)", country: "Сингапур" },
 
        { date: "2024-07-01", name: "День республики(Сомали)", country: "Сомали" },
      
        { date: "2024-07-01", name: "День освобождения от рабства(Синт-Мартен)", country: "Синт-Мартен" },
        { date: "2024-07-01", name: "День передачи Фосфатной корпорации", country: "Науру" },
        { date: "2024-07-01", name: "День территории(Британские Виргинские острова)", country: "Британские Виргинские острова" },
        { date: "2024-07-01", name: "День свободы(Суринам)", country: "Суринам" },
        { date: "2024-07-01", name: "День Серетсе Хама", country: "Ботсвана" },
        { date: "2024-07-01", name: "День республики(Гана)", country: "Гана" },
        { date: "2024-07-01", name: "День тартана", country: "Австралия" },
        { date: "2024-07-01", name: "День государственных служащих и правительственных чиновников", country: "Венгрия" },


        { date: "2024-07-01", name: "Праздник «Джулая»", country: "Болгария" },
        { date: "2024-07-02", name: "День медицинского работника(Кыргызстан)", country: "Кыргызстан" },
    
        { date: "2024-07-02", name: "День работников водного транспорта(Беларусь)", country: "Беларусь" },
        { date: "2024-07-02", name: "День принятия Государственного герба", country: "Узбекистан" },

        { date: "2024-07-02", name: "День ВМС", country: "Украина" },
        { date: "2024-07-02", name: "День молодёжи(Сингапур)", country: "Сингапур" },
       
        { date: "2024-07-02", name: "День короля Улафа V(Норвегия)", country: "Норвегия" },
        { date: "2024-07-02", name: "День флага и гимна(Кюрасао)", country: "Кюрасао" },
        { date: "2024-07-02", name: "День независимости штата Баия", country: "Бразилия" },
    
        { date: "2024-07-03", name: "День независимости в Беларусии", country: "Беларусь" },
        { date: "2024-07-03", name: "День матери", country: "Южный Судан" },
        { date: "2024-07-03", name: "День героев(Замбия)", country: "Замбия" },
        { date: "2024-07-03", name: "День женщин", country: "Мьянма" },
        
   
        { date: "2024-07-03", name: "День Карибского сообщества(Гайана)", country: "Гайана" },

        { date: "2024-07-03", name: "День диктора в Аргентине", country: "Аргентина" },
        { date: "2024-07-03", name: "День Конституции(Каймановы острова)", country: "Каймановы острова" },

   
        { date: "2024-07-03", name: "День биоинженера", country: "Аргентина" },
        
        
        { date: "2024-07-04", name: "День освобождения(Руанда)", country: "Руанда" },
        { date: "2024-07-04", name: "День Гарибальди", country: "Италия" },

        { date: "2024-07-04", name: "День архитектора", country: "Венесуэла" },
        { date: "2024-07-04", name: "День освобождения(Северные Марианские острова)", country: "Северные Марианские острова" },
        { date: "2024-07-04", name: "День сельского врача", country: "Аргентина" },
        { date: "2024-07-04", name: "День единства", country: "Замбия" },
       
  
        { date: "2024-07-04", name: "День памяти геноцида еврейского народа в годы Второй мировой войны", country: "Латвия" },
        { date: "2024-07-04", name: "День филиппино-американской дружбы", country: "Филиппины" },
        { date: "2024-07-04", name: "День рождения королевы Сони(Норвегия)", country: "Норвегия" },
        { date: "2024-07-04", name: "День короля(Тонга)", country: "Тонга" },
        { date: "2024-07-04", name: "Карнавал", country: "Сент-Винсент и Гренадины" },
        { date: "2024-06-30", name: "Чествование Небес", country: "Китай" },
        { date: "2024-07-05", name: "День независимости в Венесуэле", country: "Венесуэла" },
        { date: "2024-07-05", name: "День Конституции(Армения)", country: "Армения" },
       
 
        { date: "2024-07-05", name: "День независимости(Кабо-Верде)", country: "Кабо-Верде" },
        { date: "2024-07-05", name: "День Тинвальда", country: "Остров Мэн" },
        { date: "2024-07-05", name: "День Кирилла и Мефодия", country: "Чехия" },
        { date: "2024-07-05", name: "День словаков, проживающих за рубежом", country: "Словакия" },
        { date: "2024-07-05", name: "День независимости в Алжире", country: "Алжир" },
        
        
        { date: "2024-07-06", name: "День учителя(Перу)", country: "Перу" },
        { date: "2024-07-06", name: "День рождения первого президента(Казахстан)", country: "Казахстан" },
        { date: "2024-07-06", name: "День независимости(Коморские острова)", country: "Коморские острова" },
        { date: "2024-07-06", name: "День памяти Яна Гуса", country: "Чехия" },
        { date: "2024-07-06", name: "День независимости Малави", country: "Малави" },
        { date: "2024-07-06", name: "День битвы при Фредерисии", country: "Дания" },

        { date: "2024-07-06", name: "Праздник лета и поэзии, День Эйно Лейно", country: "Финляндия" },
        { date: "2024-07-06", name: "День государственности Литвы", country: "Литва" },
        { date: "2024-07-06", name: "Пост Семнадцатого тамуза", country: "Израиль" },
        { date: "2024-07-06", name: "Праздник совета арики(Острова Кука)", country: "Острова Кука" },
    
        
        { date: "2024-07-07", name: "День независимости(Соломоновы острова)", country: "Соломоновы острова" },
   
        { date: "2024-07-07", name: "День Саба Саба(Танзания)", country: "Танзания" },
        { date: "2024-07-07", name: "День рыбака(Маршалловы острова)", country: "Маршалловы острова" },
        { date: "2024-07-07", name: "День всемирного наследия Джорджтауна", country: "Малайзия" },
        { date: "2024-07-07", name: "День «Шоу Алис-Спрингс»", country: "Австралия" },
        { date: "2024-07-07", name: "Джазовый фестиваль в Монтрё", country: "Швейцария" },
        { date: "2024-07-07", name: "Праздник любви «Танабата»", country: "Япония" },
        { date: "2024-07-08", name: "День семьи", country: "Украина" },
        { date: "2024-07-08", name: "День инвалидов и пожилых людей", country: "Таджикистан" },
        { date: "2024-07-08", name: "День рождения губернатора Пинанга", country: "Малайзия" },
        { date: "2024-07-08", name: "День церкви, День Евангелия(Кирибати)", country: "Кирибати" },
        
        { date: "2024-07-08", name: "Праздник моря и рыбака", country: "Латвия" },
        { date: "2024-07-08", name: "Праздник святой Суннивы(Норвегия)", country: "Норвегия" },
        
        
   

   
        { date: "2024-07-09", name: "День работников налоговых органов(Беларусь)", country: "Беларусь" },



        { date: "2024-07-09", name: "День отца(Уругвай)", country: "Уругвай" },
    
        { date: "2024-07-09", name: "День поминовения", country: "Ирландия" },
        { date: "2024-07-09", name: "День независимости", country: "Южный Судан" },
        { date: "2024-07-09", name: "День Конституционалистской революции", country: "Бразилия" },
        { date: "2024-07-09", name: "День Конституции(Палау)", country: "Палау" },

        
        { date: "2024-07-10", name: "День независимости(Багамские острова)", country: "Багамские острова" },
       
        { date: "2024-07-11", name: "День моря(Китай)", country: "Китай" },

        { date: "2024-07-11", name: "День культуры(Кирибати)", country: "Кирибати" },

        

        { date: "2024-07-12", name: "День аборигенов", country: "Австралия" },
        
        { date: "2024-07-12", name: "День фьорда(Норвегия)", country: "Норвегия" },
        { date: "2024-07-12", name: "День независимости(Сан-Томе и Принсипи)", country: "Сан-Томе и Принсипи" },
        { date: "2024-07-12", name: "День адвоката(Мексика)", country: "Мексика" },
    

        { date: "2024-07-12", name: "День независимости(Кирибати)", country: "Кирибати" },
        
        { date: "2024-07-13", name: "День государственности", country: "Черногория" },
        { date: "2024-07-13", name: "День работников пожарной безопасности Вооружённых сил", country: "Украина" },
        { date: "2024-07-13", name: "День телекоммуникаций", country: "Аргентина" },
        

    
        { date: "2024-07-13", name: "День деревьев", country: "Мексика" },
        { date: "2024-07-13", name: "Фестиваль «Славянский базар» в Витебске(Беларусь)", country: "Беларусь" },

        { date: "2024-07-14", name: "День взятия Бастилии", country: "Франция" },
        { date: "2024-07-14", name: "День миротворца", country: "Южная Осетия" },
        { date: "2024-07-14", name: "День республики(Ирак)", country: "Ирак" },
        
        { date: "2024-07-14", name: "День рождения кронпринцессы Виктории", country: "Швеция" },

      
        { date: "2024-07-14", name: "Музыкальный фестиваль в Вербье", country: "Швейцария" },
        { date: "2024-07-14", name: "Фестиваль вина «Бычья кровь»", country: "Венгрия" },
        { date: "2024-07-14", name: "Церемония омовения реликвий", country: "Мадагаскар" },
        
        { date: "2024-07-15", name: "День Грюнвальдской битвы(Польша)", country: "Польша" },

        { date: "2024-07-15", name: "День демократии и народного единства", country: "Турция" },
       
        { date: "2024-07-15", name: "День султана(Бруней)", country: "Бруней" },
    


        { date: "2024-07-15", name: "Праздник Спасителя", country: "Италия" },
        { date: "2024-07-15", name: "Праздник гарифуна", country: "Гондурас" },
        { date: "2024-07-15", name: "Сабантуй", country: "Азербайджан" },
        { date: "2024-07-15", name: "Фестиваль «Кёльнские огни»", country: "Германия" },
     
    
      
       
        { date: "2024-07-16", name: "День инженера(Гондурас)", country: "Гондурас" },
        { date: "2024-07-16", name: "День Ла-Паса", country: "Боливия" },
     
        { date: "2024-07-16", name: "День Пресвятой Девы Марии с горы Кармель", country: "Чили" },

        { date: "2024-07-16", name: "День духовной любви, Праздник «Гергетоба»", country: "Грузия" },
        
        { date: "2024-07-16", name: "День памяти расистских и антисемитских преследований", country: "Франция" },
        { date: "2024-07-16", name: "Праздник девы Кармен(Перу)", country: "Перу" },
      
        { date: "2024-07-16", name: "Праздник Преображения Господня(Армения)", country: "Армения" },
        
        { date: "2024-07-17", name: "День Конституции(Южная Корея)", country: "Южная Корея" },


        { date: "2024-07-17", name: "День провозглашения независимости(Словакия)", country: "Словакия" },
     
       


        { date: "2024-07-18", name: "День Конституции(Уругвай)", country: "Уругвай" },
        { date: "2024-07-18", name: "Праздник святого Арнульфа", country: "Франция" },
        
        { date: "2024-07-19", name: "День независимости от Франции", country: "Лаос" },
        { date: "2024-07-19", name: "День бирманских мучеников", country: "Мьянма" },
        { date: "2024-07-19", name: "День героев отечества и их семей", country: "Колумбия" },

       
        { date: "2024-07-19", name: "День инженера(Непал)", country: "Непал" },
      
        { date: "2024-07-19", name: "День революции, День свободы(Никарагуа)", country: "Никарагуа" },
        { date: "2024-07-20", name: "День дружбы в Аргентине", country: "Аргентина" },

       
        { date: "2024-07-20", name: "День независимости(Колумбия)", country: "Колумбия" },
        { date: "2024-07-20", name: "День Союза лаосских женщин", country: "Лаос" },
        { date: "2024-07-20", name: "День рождения кронпринца(Норвегия)", country: "Норвегия" },
        { date: "2024-07-20", name: "День Лемпиры", country: "Гондурас" },
        { date: "2024-07-20", name: "День провинции Реннелл и Беллона(Соломоновы острова)", country: "Соломоновы острова" },
        { date: "2024-07-20", name: "Ильин день", country: "Болгария" },
    

        { date: "2024-07-21", name: "День свободы(Остров Гуам)", country: "Остров Гуам" },
        { date: "2024-07-21", name: "День расовой гармонии", country: "Сингапур" },
        { date: "2024-07-21", name: "День первой проповеди Будды", country: "Бутан" },

        { date: "2024-07-21", name: "Фестиваль «Кадырга»", country: "Турция" },
        
       
        { date: "2024-07-22", name: "Понедельник на холме, Фольклорный фестиваль «Гелагеца»", country: "Мексика" },
  
        { date: "2024-07-22", name: "День революции(Гамбия)", country: "Гамбия" },
        { date: "2024-07-22", name: "День независимости Саравака", country: "Малайзия" },

     
        { date: "2024-07-23", name: "День дружбы", country: "Боливия" },

       
        { date: "2024-07-23", name: "День инженера(Сингапур)", country: "Сингапур" },
        { date: "2024-07-23", name: "День Государственного флага в Абхазии", country: "Абхазия" },

        { date: "2024-07-23", name: "День работников СМИ", country: "Южная Осетия" },
        { date: "2024-07-23", name: "День возрождения(Оман)", country: "Оман" },
 
        { date: "2024-07-24", name: "День детей(Вануату)", country: "Вануату" },
        { date: "2024-07-24", name: "День полиции(Польша)", country: "Польша" },

        { date: "2024-07-24", name: "День восстановления демократии", country: "Греция" },
        { date: "2024-07-24", name: "День военно-морских сил(Венесуэла)", country: "Венесуэла" },
        { date: "2024-07-24", name: "День памяти святого Шарбеля", country: "Ливан" },
        { date: "2024-07-24", name: "День Симона Боливара", country: "Венесуэла" },
        { date: "2024-07-24", name: "День Гуаякиля", country: "Эквадор" },
    

        
        { date: "2024-07-25", name: "День пожарной службы(Беларусь)", country: "Беларусь" },
     
        { date: "2024-07-25", name: "День работников автомобильного транспорта(Таджикистан)", country: "Таджикистан" },

        { date: "2024-07-25", name: "День бахаи", country: "Ямайка" },
        { date: "2024-07-25", name: "День Конституции(Пуэрто-Рико)", country: "Пуэрто-Рико" },
        { date: "2024-07-25", name: "День республики(Тунис)", country: "Тунис" },
        { date: "2024-07-25", name: "День Гуанакасте", country: "Коста-Рика" },
        { date: "2024-07-25", name: "День битвы при Идштедте", country: "Дания" },
        { date: "2024-07-25", name: "Карнавал(Британские Виргинские острова)", country: "Британские Виргинские острова" },
        
        
        { date: "2024-07-26", name: "День бабушки и дедушки(Португалия)", country: "Португалия" },
  
        
        { date: "2024-07-13", name: "День независимости(Мальдивы)", country: "Мальдивы" },
     
        { date: "2024-07-26", name: "День победы в Каргильской войне", country: "Индия" },
        { date: "2024-07-26", name: "День национального значения", country: "Барбадос" },
    

       
       
        { date: "2024-07-27", name: "День Церкви Христа", country: "Филиппины" },
        { date: "2024-07-27", name: "День Хосе Сельсо Барбосы(Пуэрто-Рико)", country: "Пуэрто-Рико" },
  
        { date: "2024-07-27", name: "День памяти погибших за независимость", country: "Вьетнам" },
        { date: "2024-07-27", name: "День вечной победы", country: "КНДР" },
        { date: "2024-07-27", name: "День траура «Девятое ава»", country: "Израиль" },
  
        { date: "2024-07-27", name: "Канун Ашура", country: "Бахрейн" },
        { date: "2024-07-28", name: "День победы над фашизмом(Сан-Марино)", country: "Сан-Марино" },
        { date: "2024-07-28", name: "День крещения Киевской Руси", country: "Украина" },
        { date: "2024-07-28", name: "День независимости(Перу)", country: "Перу" },

     


        
        { date: "2024-07-28", name: "Канун дня святого Олафа(Фарерские острова)", country: "Фарерские острова" },
        { date: "2024-07-28", name: "Праздник «Тамхарит»", country: "Сенегал" },

      
        { date: "2024-07-29", name: "День прославления святого Олафа(Норвегия)", country: "Норвегия" },
        { date: "2024-07-29", name: "День Конституции(Молдова)", country: "Молдова" },
        { date: "2024-07-29", name: "День Сил специальных операций", country: "Украина" },
  
        { date: "2024-07-29", name: "День «Мохун Баган»", country: "Индия" },
        { date: "2024-07-29", name: "День святого Олафа(Фарерские острова)", country: "Фарерские острова" },
        { date: "2024-07-29", name: "День национального гимна(Румыния)", country: "Румыния" },
        { date: "2024-07-29", name: "День территории", country: "Острова Уоллис и Футуна" },

     
        { date: "2024-07-29", name: "Карнавальный понедельник(Остров Саба)", country: "Остров Саба" },
        { date: "2024-07-30", name: "Восхождение на Святую Гору", country: "Ирландия" },
     
       
        { date: "2024-07-30", name: "День дерева", country: "Австралия" },
    
  { date: "2024-07-30", name: "День работников пожарной охраны", country: "Таджикистан" },
  { date: "2024-12-27", name: "День рождения султана Паханга", country: "Малайзия" },
  { date: "2024-07-30", name: "День независимости(Вануату)", country: "Вануату" },
  { date: "2024-07-30", name: "День престола", country: "Марокко" },
  { date: "2024-07-30", name: "День мучеников", country: "Южный Судан" },




  { date: "2024-06-08", name: "День воинов", country: "Малайзия" },


  { date: "2024-08-18", name: "День ветеранов Вьетнама", country: "Австралия" },
  { date: "2024-08-18", name: "День вооружённых сил(Северная Македония)", country: "Северная Македония" },



  
  { date: "2024-08-19", name: "День гражданской защиты(ПМР)", country: "ПМР" },
  { date: "2024-08-19", name: "День независимости в Афганистане", country: "Афганистан" },
  { date: "2024-08-19", name: "День рождения кронпринцессы Метте-Марит(Норвегия)", country: "Норвегия" },
  { date: "2024-08-19", name: "День Августовской революции", country: "Вьетнам" },
  { date: "2024-08-19", name: "День Мануэля Кесона", country: "Филиппины" },
  { date: "2024-08-19", name: "Племенной день", country: "Науру" },
 
  { date: "2024-08-20", name: "День Военно-воздушных сил(Беларусь)", country: "Беларусь" },
  { date: "2024-08-20", name: "День детей в Аргентине", country: "Аргентина" },

  
  { date: "2024-08-20", name: "День дедушки", country: "Аргентина" },

  { date: "2024-08-20", name: "День восстановления независимости", country: "Эстония" },
  { date: "2024-08-20", name: "День изобретателя и рационализатора(Таджикистан)", country: "Таджикистан" },
  { date: "2024-08-20", name: "День Вооружённых сил национального освобождения", country: "Восточный Тимор" },
  { date: "2024-08-20", name: "День княжества Себорга", country: "Италия" },
  { date: "2024-08-20", name: "День народной революции(Марокко)", country: "Марокко" },
  { date: "2024-08-20", name: "День святого Иштвана", country: "Венгрия" },
  { date: "2024-08-21", name: "День молодёжи(Марокко)", country: "Марокко" },
  { date: "2024-08-21", name: "День памяти жертв вторжения Чехословакии", country: "Чехия" },

  

  { date: "2024-08-21", name: "День истории железной дороги", country: "Эстония" },
  { date: "2024-08-21", name: "День памяти генерала Сан-Мартина", country: "Аргентина" },
  { date: "2024-08-21", name: "День сердец в Амстердаме(Нидерланды)", country: "Нидерланды" },
  { date: "2024-08-21", name: "День Евангелия(Остров Кусаие)", country: "Остров Кусаие" },
  { date: "2024-08-21", name: "День Ниноя Акино", country: "Филиппины" },
  { date: "2024-08-21", name: "День принятия Конституционного закона", country: "Латвия" },


 

  { date: "2024-08-22", name: "Праздник влюблённых", country: "Китай" },
  

  { date: "2024-08-23", name: "День Государственного флага", country: "Украина" },
  { date: "2024-08-23", name: "День работников государственной статистики(Беларусь)", country: "Беларусь" },
  { date: "2024-08-23", name: "День морской авиации", country: "Бразилия" },
  { date: "2024-08-23", name: "День государственного переворота(Румыния)", country: "Румыния" },



  { date: "2024-08-24", name: "День независимости(Украина)", country: "Украина" },

 
  { date: "2024-08-24", name: "День Конституции(Грузия)", country: "Грузия" },



  { date: "2024-08-24", name: "День Пяртеля", country: "Эстония" },
  { date: "2024-08-24", name: "День внутренних войск МВД", country: "Кыргызстан" },
 
  { date: "2024-08-24", name: "Ночь ностальгии(Уругвай)", country: "Уругвай" },
  { date: "2024-08-25", name: "День кофе(Перу)", country: "Перу" },
  { date: "2024-08-25", name: "День молодёжи", country: "Монголия" },
  { date: "2024-08-25", name: "День освобождения Парижа", country: "Франция" },
  { date: "2024-08-25", name: "День политики приоритета армии", country: "КНДР" },
  { date: "2024-08-25", name: "День независимости(Уругвай)", country: "Уругвай" },
  { date: "2024-08-25", name: "День солдата в Бразилии", country: "Бразилия" },
 

  { date: "2024-08-26", name: "День героев красного флага", country: "Намибия" },
  { date: "2024-08-26", name: "День финской природы", country: "Финляндия" },
 
  { date: "2024-08-26", name: "День солидарности", country: "Аргентина" },
 

  
  { date: "2024-08-27", name: "День работника угольной промышленности", country: "Кыргызстан" },






  { date: "2024-08-28", name: "День авиации(Польша)", country: "Польша" },
  { date: "2024-08-28", name: "День отца", country: "Южный Судан" },
  { date: "2024-08-28", name: "День провозглашения королевства", country: "Черногория" },
  { date: "2024-08-28", name: "День эмиратских женщин", country: "ОАЭ" },

  { date: "2024-08-28", name: "День национальных героев(Филиппины)", country: "Филиппины" },
  { date: "2024-08-28", name: "День дедушек и бабушек", country: "Мексика" },
 







  { date: "2024-08-29", name: "День адвоката в Аргентине", country: "Аргентина" },

  { date: "2024-08-29", name: "День Словацкого национального восстания", country: "Словакия" },
  

  { date: "2024-08-30", name: "Венецианский кинофестиваль", country: "Италия" },
  { date: "2024-08-30", name: "День архивиста", country: "Кыргызстан" },
  { date: "2024-08-30", name: "День Конституции(Казахстан)", country: "Казахстан" },
  { date: "2024-08-30", name: "День судебного пристава", country: "Южная Осетия" },

  { date: "2024-08-31", name: "Винный фестиваль(Португалия)", country: "Португалия" },

  { date: "2024-08-31", name: "День учителя(Сингапур)", country: "Сингапур" },

  { date: "2024-08-31", name: "День Пуштунистана", country: "Афганистан" },
  { date: "2024-08-31", name: "День единства белуджи и пуштунов", country: "Пакистан" },


                
           { date: "2024-09-01", name: "День белорусской письменности(Беларусь)", country: "Беларусь" },
           { date: "2024-09-01", name: "Всемирный день мира", country: "Германия" },
           


           { date: "2024-09-01", name: "День флага(Гондурас)", country: "Гондурас" },
 


   
           { date: "2024-09-01", name: "День знаний, письменности и литературы", country: "Армения" },

           { date: "2024-09-01", name: "День независимости(Узбекистан)", country: "Узбекистан" },
           { date: "2024-09-01", name: "День республики, День государственности Кабардино-Балкарии", country: "Россия" },
           { date: "2024-09-01", name: "День ветеранов борьбы за независимость(Польша)", country: "Польша" },
           { date: "2024-09-01", name: "День предотвращения катастроф", country: "Япония" },
           { date: "2024-09-01", name: "День революции", country: "Эритрея" },

           { date: "2024-09-01", name: "День Кирани Джеймса", country: "Гренада" },
           { date: "2024-09-01", name: "День Конституции(Словакия)", country: "Словакия" },
           { date: "2024-09-01", name: "Праздник коров «Гайджатра»(Непал)", country: "Непал" },
       
           { date: "2024-09-02", name: "День независимости(ПМР)", country: "ПМР" },
       

           { date: "2024-09-02", name: "День образования Сандинистской армии(Никарагуа)", country: "Никарагуа" },
           { date: "2024-09-02", name: "День независимости(Вьетнам)", country: "Вьетнам" },
           { date: "2024-09-02", name: "День демократии(Тибет)", country: "Тибет" },
 
    
         
     
           { date: "2024-09-03", name: "День освобождения в Монако", country: "Монако" },
           { date: "2024-09-03", name: "День отца в Австралии", country: "Австралия" },
           { date: "2024-09-03", name: "День национального флага(Австралия)", country: "Австралия" },
           { date: "2024-09-03", name: "День независимости Катара", country: "Катар" },
           { date: "2024-09-03", name: "День Победы над милитаристской Японией", country: "Китай" },
       
           { date: "2024-09-03", name: "День национальной армии", country: "Молдова" },
           { date: "2024-09-03", name: "День гражданской авиации", country: "Таджикистан" },
        
           { date: "2024-09-03", name: "День капитуляции Ямаситы", country: "Филиппины" },
           { date: "2024-09-03", name: "День Токехега(Токелау)", country: "Токелау" },
           { date: "2024-08-13", name: "День паломничества в Тубу", country: "Сенегал" },
           { date: "2024-09-03", name: "День республики(Сан-Марино)", country: "Сан-Марино" },
           { date: "2024-09-03", name: "День движения за независимость(Тунис)", country: "Тунис" },
           { date: "2024-09-03", name: "День Леви Мванавасы", country: "Замбия" },
 
           { date: "2024-09-04", name: "День мультфильмов", country: "Аргентина" },
           { date: "2024-09-04", name: "День иммигранта", country: "Аргентина" },

      

   
           { date: "2024-09-04", name: "День спасателя(Армения)", country: "Армения" },
         
         
       
      
      
           { date: "2024-09-04", name: "День клыкача", country: "Южная Георгия и Южные Сандвичевы Острова" },
        
        
           { date: "2024-09-04", name: "Праздник «Умхланга», «Танец тростника»", country: "Эсватини" },
           { date: "2024-09-05", name: "День Амазонки", country: "Бразилия" },

           { date: "2024-09-05", name: "День языков народов Казахстана", country: "Казахстан" },
           { date: "2024-09-05", name: "День инженера(Египет)", country: "Египет" },
           { date: "2024-09-05", name: "День канонизации матери Терезы", country: "Албания" },
           { date: "2024-09-05", name: "День скаутов в Аргентине", country: "Аргентина" },
     
         
           { date: "2024-09-06", name: "День независимости(Эсватини)", country: "Эсватини" },
           
        
           
           { date: "2024-09-06", name: "День объединения(Болгария)", country: "Болгария" },

           { date: "2024-09-06", name: "День вооружённых сил(Сан-Томе и Принсипи)", country: "Сан-Томе и Принсипи" },
           { date: "2024-09-06", name: "День траура Арбаин", country: "Пакистан" },
           { date: "2024-09-06", name: "День армии(Пакистан)", country: "Пакистан" },
 
           { date: "2024-09-06", name: "День вооружённых сил(ПМР)", country: "ПМР" },
       
           { date: "2024-09-07", name: "День Конституции(Фиджи)", country: "Фиджи" },
           { date: "2024-09-07", name: "День военно-воздушных сил(Пакистан)", country: "Пакистан" },
           { date: "2024-09-07", name: "День государственных служащих(Непал)", country: "Непал" },
  
       

           { date: "2024-09-07", name: "День инженера(Танзания)", country: "Танзания" },
           { date: "2024-09-07", name: "День независимости в Бразилии", country: "Бразилия" },
           { date: "2024-09-07", name: "День победы(Мозамбик)", country: "Мозамбик" },
           
           { date: "2024-09-07", name: "Фестиваль острого перца", country: "Италия" },
           { date: "2024-09-07", name: "Фестиваль лирической песни «Пьедигротта»", country: "Италия" },


           { date: "2024-09-08", name: "День победы(Пакистан)", country: "Пакистан" },
           { date: "2024-08-01", name: "День победы(Мальта)", country: "Мальта" },
 
           { date: "2024-09-08", name: "День независимости(Северная Македония)", country: "Северная Македония" },
           
         
           { date: "2024-09-08", name: "День Эстремадуры", country: "Испания" },
        
           { date: "2024-09-08", name: "День освобождения Кусаие", country: "Микронезия" },
           { date: "2024-09-08", name: "Национальный день в Андорре", country: "Андорра" },
           { date: "2024-09-08", name: "Праздник красного перца", country: "Венгрия" },

           { date: "2024-09-09", name: "День детей(Коста-Рика)", country: "Коста-Рика" },

           { date: "2024-09-09", name: "День независимости(КНДР)", country: "КНДР" },
           { date: "2024-09-09", name: "День освобождения Измира", country: "Турция" },
        

     
           { date: "2024-09-09", name: "День памяти жертв холокоста и преступлений на расовой почве", country: "Словакия" },
           { date: "2024-09-09", name: "День независимости(Таджикистан)", country: "Таджикистан" },
        
        
  
           { date: "2024-09-10", name: "День отца в Латвии", country: "Латвия" },
           { date: "2024-06-22", name: "День бабушки и дедушки(Эстония)", country: "Эстония" },
       
    
           
         
        
           { date: "2024-09-10", name: "День учителя(Китай)", country: "Китай" },
           { date: "2024-09-10", name: "День детей(Гондурас)", country: "Гондурас" },
          
           { date: "2024-09-10", name: "День европейского наследия", country: "Германия" },
           { date: "2024-09-10", name: "День Родины", country: "Германия" },
       
           { date: "2024-09-10", name: "День памяти жертв политических репрессий в Монголии", country: "Монголия" },


           { date: "2024-09-10", name: "Национальный день в Белизе", country: "Белиз" },
           { date: "2024-09-10", name: "Национальный день(Гибралтар)", country: "Гибралтар" },
       
           { date: "2024-09-01", name: "День учителя (Dia del Maestro)", country: "Аргентина" },
           { date: "2024-09-11", name: "День освобождения Понпеи", country: "Микронезия" },

           { date: "2024-09-01", name: "День Богоматери Коромото", country: "Венесуэла" },
           { date: "2024-09-01", name: "День военного переворота", country: "Чили" },
  
           { date: "2024-09-01", name: "День памяти Мухаммада Али Джинны", country: "Пакистан" },
          

      
           
           { date: "2024-09-12", name: "День битвы при Сан-Хасинто(Никарагуа)", country: "Никарагуа" },
           { date: "2024-09-12", name: "День книги «Рухнама»(Туркменистан)", country: "Туркменистан" },
           { date: "2024-09-12", name: "День сотрудника органов предварительного следствия(Беларусь)", country: "Беларусь" },
           { date: "2024-09-12", name: "День народной революции", country: "Эфиопия" },
        
           { date: "2024-09-12", name: "Коптский Новый год", country: "Египет" },
           { date: "2024-09-12", name: "Национальный день(Кабо-Верде)", country: "Кабо-Верде" },
           { date: "2024-09-12", name: "Эфиопский Новый год, Праздник подношения драгоценностей «Энкутаташ»", country: "Эфиопия" },

           { date: "2024-09-14", name: "День детей(Непал)", country: "Непал" },
           { date: "2024-09-14", name: "День битвы при Сан-Хасинто(Никарагуа)", country: "Никарагуа" },
           { date: "2024-09-14", name: "День инженера(Румыния)", country: "Румыния" },
        
           { date: "2024-09-14", name: "Женевский патриотический пост", country: "Швейцария" },
           { date: "2024-09-14", name: "День штата Чьяпас", country: "Мексика" },
           { date: "2024-09-14", name: "Праздник мексиканских ковбоев, День Чарро", country: "Мексика" },
              { date: "2024-09-15", name: "День библиотек в Беларусии", country: "Беларусь" },
              

               { date: "2024-09-15", name: "День инженера(Индия)", country: "Индия" },
               { date: "2024-09-15", name: "День независимости(Никарагуа)", country: "Никарагуа" },
               { date: "2024-09-15", name: "День воссоединения Приморья с Отечеством(Словения)", country: "Словения" },
    
               { date: "2024-09-15", name: "День памяти долоресского призыва к революции", country: "Мексика" },
               { date: "2024-09-15", name: "День Силпы Бхирасри(Тайланд)", country: "Тайланд" },
       
               { date: "2024-09-15", name: "Кинофестиваль в Сан-Себастьяне", country: "Испания" },
               { date: "2024-09-15", name: "Праздник Скорбящей Девы Марии", country: "Словакия" },
               { date: "2024-09-15", name: "Праздник Благочестивой Богоматери", country: "Испания" },
               { date: "2024-09-16", name: "Еврейский Новый год «Рош ха-Шана»", country: "Израиль" },
               { date: "2024-09-16", name: "Пивной фестиваль «Октоберфест»", country: "Германия" },
               { date: "2024-09-16", name: "День рождения Джульетты", country: "Италия" },
              
               
   
               { date: "2024-09-16", name: "День дружбы и любви", country: "Колумбия" },
               { date: "2024-09-16", name: "День независимости Мексики", country: "Мексика" },
            
               { date: "2024-09-16", name: "День героев(Сент-Китс и Невис)", country: "Сент-Китс и Невис" },
      
             
               { date: "2024-09-16", name: "День работников службы государственной охраны", country: "Кыргызстан" },
    
      
               { date: "2024-08-31", name: "День малайзийской федерации", country: "Малайзия" },
               { date: "2024-09-16", name: "День вооружённых сил Малайзии", country: "Малайзия" },
               { date: "2024-07-11", name: "Национальный праздник(Мальдивы)", country: "Мальдивы" },
               { date: "2024-09-17", name: "Воздвижение Креста Господня", country: "Армения" },
               { date: "2024-09-17", name: "Винный фестиваль в Лимассоле", country: "Кипр" },
              
               { date: "2024-09-17", name: "День матери(Казахстан)", country: "Казахстан" },

            
            
               { date: "2024-09-17", name: "День народного единства(Беларусь)", country: "Беларусь" },
              
               { date: "2024-09-17", name: "День национальных героев в Анголе", country: "Ангола" },
               { date: "2024-09-17", name: "День Мелильи", country: "Испания" },
               { date: "2024-09-17", name: "День сибиряка(Польша)", country: "Польша" },
               { date: "2024-09-17", name: "День памяти Голландской операции «Market Garden»(Нидерланды)", country: "Нидерланды" },
          
               { date: "2024-09-17", name: "День учителя(Гондурас)", country: "Гондурас" },

               { date: "2024-09-17", name: "День австралийского гражданства", country: "Австралия" },
               { date: "2024-09-17", name: "День рождения кронпринца(Тонга)", country: "Тонга" },
               { date: "2024-09-17", name: "День освобождения Маратвады", country: "Индия" },
               { date: "2024-09-17", name: "День бога Вишвакармы", country: "Индия" },
               { date: "2024-09-17", name: "Федеральный день благодарения, покаяния и молитвы", country: "Швейцария" },
               { date: "2024-09-18", name: "День почитания пожилых людей", country: "Япония" },
               { date: "2024-09-18", name: "День островных языков", country: "Япония" },


               { date: "2024-09-18", name: "День военно-морского флота(Хорватия)", country: "Хорватия" },
         
               { date: "2024-09-18", name: "День независимости(Чили)", country: "Чили" },
               
               { date: "2024-09-18", name: "Пост Гедалии", country: "Израиль" },
               { date: "2024-09-18", name: "Праздник семейного счастья «Тидж»(Непал)", country: "Непал" },
               { date: "2024-09-19", name: "День кофе", country: "Ирландия" },
               { date: "2024-09-19", name: "День ветеранов(Турция)", country: "Турция" },
               { date: "2024-09-19", name: "День принца(Нидерланды)", country: "Нидерланды" },
           
              
               { date: "2024-09-19", name: "День славы армии", country: "Чили" },
               { date: "2024-09-19", name: "День первого публичного выступления Словацкой народной рады", country: "Словакия" },
               { date: "2024-09-19", name: "День независимости(Сент-Китс и Невис)", country: "Сент-Китс и Невис" },
      
               { date: "2024-09-19", name: "Праздник «Ганеша-чатуртхи»", country: "Индия" },
               { date: "2024-09-19", name: "Праздник святого Януария", country: "Италия" },


               { date: "2024-09-20", name: "День Республики", country: "Южная Осетия" },
               { date: "2024-09-20", name: "День любви к своим зубам", country: "Китай" },
             

               { date: "2024-09-20", name: "День детей в Германии", country: "Германия" },
               { date: "2024-09-20", name: "День молодёжи(Тайланд)", country: "Тайланд" },
               { date: "2024-09-20", name: "День предпринимателя(Кыргызстан)", country: "Кыргызстан" },
               { date: "2024-09-20", name: "День свободы выражения мыслей(Уругвай)", country: "Уругвай" },
       
               { date: "2024-09-20", name: "День Конституции(Непал)", country: "Непал" },
            
               { date: "2024-09-21", name: "День независимости в Армении", country: "Армения" },
               { date: "2024-09-21", name: "День студента в Аргентине", country: "Аргентина" },
              

               { date: "2024-09-21", name: "День независимости(Мальта)", country: "Мальта" },
               { date: "2024-09-21", name: "День волонтёра", country: "Гана" },
               { date: "2024-09-21", name: "День независимости в Белизе", country: "Белиз" },
               { date: "2024-09-21", name: "День любви к пророку Мухаммеду", country: "Пакистан" },
               { date: "2024-09-21", name: "День памяти Кваме Нкрумы(НКР)", country: "Гана" },
               { date: "2024-09-21", name: "День военного положения", country: "Филиппины" },
              
   
               { date: "2024-09-22", name: "День памяти великого поэта Абуабдулло Рудаки", country: "Таджикистан" },
            
           
           

               { date: "2024-09-22", name: "День учителя(Уругвай)", country: "Уругвай" },
            
               { date: "2024-09-22", name: "День рождения принцессы Марты Луизы(Норвегия)", country: "Норвегия" },
               { date: "2024-09-22", name: "День независимости в Болгарии", country: "Болгария" },
               { date: "2024-09-22", name: "День памяти святого Маврикия", country: "Швейцария" },
             
               { date: "2024-09-23", name: "День мороженого", country: "Бразилия" },
               { date: "2024-09-23", name: "День политических прав женщин", country: "Аргентина" },
               { date: "2024-09-23", name: "День общественных библиотек", country: "Аргентина" },

               { date: "2024-09-23", name: "День учителя в Брунее", country: "Бруней" },
               { date: "2024-09-23", name: "День государственного языка(Кыргызстан)", country: "Кыргызстан" },
         
          
               { date: "2024-09-23", name: "Праздник осеннего равноденствия", country: "Япония" },
              
               { date: "2024-09-23", name: "День освобождения Чуука", country: "Микронезия" },
               { date: "2024-09-23", name: "День Грито де Ларес(Пуэрто-Рико)", country: "Пуэрто-Рико" },

          
            
               { date: "2024-09-23", name: "Национальный день(Саудовская Аравия)", country: "Саудовская Аравия" },
               { date: "2024-09-23", name: "Праздник святой Фёклы", country: "Испания" },
               { date: "2024-09-24", name: "Годовщина неудавшегося нападения на Ломе", country: "Того" },
             

               { date: "2024-09-24", name: "День семьи, мира и согласия", country: "Кыргызстан" },
               { date: "2024-09-24", name: "День донора крови", country: "Кыргызстан" },
               { date: "2024-09-24", name: "День республики(Тринидад и Тобаго)", country: "Тринидад и Тобаго" },
       
               
        
               { date: "2024-09-24", name: "День наследия", country: "ЮАР" },
               { date: "2024-09-24", name: "День принца Махидола(Тайланд)", country: "Тайланд" },
         
               { date: "2024-09-24", name: "День святого Руперта", country: "Австрия" },
          
               { date: "2024-09-24", name: "День Конституции Камбоджи", country: "Камбоджа" },
 
               { date: "2024-09-25", name: "День искупления «Йом-Кипур»", country: "Израиль" },
            
               { date: "2024-09-25", name: "День святого Николая из Флюэ", country: "Швейцария" },
               { date: "2024-09-25", name: "День молодёжи(Науру)", country: "Науру" },
               { date: "2024-09-25", name: "День признания харки", country: "Франция" },
               { date: "2024-09-25", name: "День вооружённых сил(Мозамбик)", country: "Мозамбик" },
               { date: "2024-09-25", name: "День революции(Мозамбик)", country: "Мозамбик" },
               { date: "2024-09-25", name: "Праздник «Рамдев Джаянти»", country: "Индия" },
            
               { date: "2024-09-26", name: "День турецкого языка", country: "Турция" },
    
               { date: "2024-09-26", name: "День памяти Соломона Бандаранаике", country: "Шри-Ланка" },
               { date: "2024-09-27", name: "День железнодорожника в Словакии", country: "Словакия" },
         
               { date: "2024-09-27", name: "День независимости(Туркменистан)", country: "Туркменистан" },
               { date: "2024-09-27", name: "День памяти святого Винсента де Поля", country: "Мадагаскар" },
             
               { date: "2024-09-27", name: "День окончания войны за независимость", country: "Мексика" },

               { date: "2024-09-27", name: "День Польского подпольного государства(Польша)", country: "Польша" },

               { date: "2024-09-27", name: "Праздник Мескельского креста", country: "Эфиопия" },
               { date: "2024-09-28", name: "День Конфуция", country: "Китай" },
             
               { date: "2024-09-28", name: "День чешской государственности", country: "Чехия" },
         
               { date: "2024-09-28", name: "День флага(Тайланд)", country: "Тайланд" },
           
 
         
               { date: "2024-09-28", name: "День боснийцев(Северная Македония)", country: "Северная Македония" },
                       
               { date: "2024-09-29", name: "День памяти блаженного Фернандо(Португалия)", country: "Португалия" },
               

               { date: "2024-09-29", name: "День изобретателя", country: "Аргентина" },
               { date: "2024-09-29", name: "День молодёжи(Тёркс и Кайкос)", country: "Тёркс и Кайкос" },
            
               { date: "2024-09-29", name: "День победы в битве за Бокерон(Парагвай)", country: "Парагвай" },
      
               { date: "2024-09-29", name: "День культуры(Маршалловы острова)", country: "Маршалловы острова" },
            
               { date: "2024-09-29", name: "Праздник лунных пряников и середины осени «Чжунцюцзе»", country: "Китай" },
            


               { date: "2024-09-30", name: "День святого Григория Просветителя", country: "Армения" },
               { date: "2024-09-30", name: "День памяти Мавляна Джаладдина Балхи", country: "Таджикистан" },
               { date: "2024-09-30", name: "День Победы и Независимости", country: "Абхазия" },
             
               { date: "2024-09-30", name: "День работников органов nationalной безопасности(Туркменистан)", country: "Туркменистан" },
            
           
               
          
     
               { date: "2024-09-30", name: "День сельскохозяйственной реформы(Сан-Томе и Принсипи)", country: "Сан-Томе и Принсипи" },
               { date: "2024-09-30", name: "День независимости в Ботсване", country: "Ботсвана" },
               { date: "2024-09-30", name: "День Хосе Морелоса", country: "Мексика" },
               { date: "2024-09-30", name: "Праздник кущей «Суккот»", country: "Израиль" },
               { date: "2024-09-30", name: "Фестиваль «Дожинки»(Беларусь)", country: "Беларусь" },
               { date: "2024-10-01", name: "День саке", country: "Япония" },

          
      
         
              
               { date: "2024-10-01", name: "День отца(Люксембург)", country: "Люксембург" },
               { date: "2024-10-01", name: "День таможенной службы(ПМР)", country: "ПМР" },
               { date: "2024-10-01", name: "День независимости(Нигерия)", country: "Нигерия" },
               { date: "2024-10-01", name: "Праздник урожая", country: "Германия" },
          
               { date: "2024-10-01", name: "День независимости(Кипр)", country: "Кипр" },
               { date: "2024-10-01", name: "День независимости(Палау)", country: "Палау" },
           
               { date: "2024-10-01", name: "День объединения Камерун", country: "Камерун" },
               { date: "2024-10-01", name: "День независимости(Тувалу)", country: "Тувалу" },
               { date: "2024-10-01", name: "День вооружённых сил(Южная Корея)", country: "Южная Корея" },
               { date: "2024-10-01", name: "День местного самоуправления", country: "Эстония" },
               { date: "2024-10-01", name: "День учителей и наставников", country: "Узбекистан" },
               { date: "2024-10-01", name: "День территориальной обороны", country: "Украина" },
         

         
               { date: "2024-10-01", name: "День работника образования", country: "Кыргызстан" },
  

               { date: "2024-10-01", name: "День защиты детей", country: "Гватемала" },
               { date: "2024-10-01", name: "День образования Китайской Народной Республики", country: "Китай" },

            
               { date: "2024-10-01", name: "Фестиваль винограда", country: "Италия" },
               { date: "2024-10-02", name: "День бабушек и дедушек(Италия)", country: "Италия" },
         
               { date: "2024-10-02", name: "День благодарения(Сент-Люсия)", country: "Сент-Люсия" },
             
               { date: "2024-10-02", name: "День добычи торфа", country: "Фолклендские острова" },
          


               { date: "2024-10-02", name: "День территории(Остров Рождества)", country: "Остров Рождества" },
       
             
               { date: "2024-10-03", name: "День туризма", country: "Мальдивы" },
               { date: "2024-10-03", name: "День независимости Ирака", country: "Ирак" },
         
               { date: "2024-10-03", name: "День солдата(Гондурас)", country: "Гондурас" },
           
     
         
           
               { date: "2024-10-04", name: "День мира и национального примирения(Мозамбик)", country: "Мозамбик" },
               { date: "2024-10-04", name: "День независимости(Лесото)", country: "Лесото" },
               { date: "2024-10-04", name: "День штурма Фридрихштадта", country: "Дания" },
               { date: "2024-09-12", name: "Праздник «крещения» пророка", country: "Мали" },
               { date: "2024-10-05", name: "День государственного языка(Таджикистан)", country: "Таджикистан" },
               { date: "2024-10-05", name: "День уголовного розыска", country: "Кыргызстан" },
   
               { date: "2024-10-05", name: "День инженера в Боливии", country: "Боливия" },
               { date: "2024-10-05", name: "День вооружённых сил(Индонезия)", country: "Индонезия" },
               { date: "2024-10-05", name: "День образования(Кирибати)", country: "Кирибати" },
               { date: "2024-10-05", name: "День хорватских железных дорог", country: "Хорватия" },
               { date: "2024-10-05", name: "День Конституции(Вануату)", country: "Вануату" },
               { date: "2024-10-05", name: "День республики(Португалия)", country: "Португалия" },
            
          
               { date: "2024-10-05", name: "Праздник святого Фройлана", country: "Испания" },
           
           
               { date: "2024-10-06", name: "День архивиста(Беларусь)", country: "Беларусь" },
               { date: "2024-10-06", name: "День картофеля", country: "Ирландия" },

          
               { date: "2024-10-06", name: "День детей(Сингапур)", country: "Сингапур" },
            
               { date: "2024-10-06", name: "День памяти жертв Арада", country: "Венгрия" },
               { date: "2024-10-06", name: "День вооружённых сил(Египет)", country: "Египет" },
               { date: "2024-10-06", name: "День Октябрьской войны", country: "Сирия" },
  
               { date: "2024-10-06", name: "День жертв Дукельского перевала", country: "Словакия" },
              
               { date: "2024-10-06", name: "Праздник «Ошана Раба»", country: "Израиль" },
               { date: "2024-10-07", name: "Всенародный праздник вина в Арени", country: "Армения" },
               { date: "2024-10-07", name: "День хорошего отношения(Пуэрто-Рико)", country: "Пуэрто-Рико" },


               { date: "2024-10-07", name: "День учителя(Лаос)", country: "Лаос" },
               { date: "2024-10-07", name: "День вооружённых сил(Черногория)", country: "Черногория" },
               { date: "2024-10-07", name: "День памяти Пресвятой Девы Марии Розарии", country: "Испания" },
           
               { date: "2024-10-07", name: "День гражданской авиации", country: "Кыргызстан" },

               { date: "2024-10-07", name: "Международный фестиваль гитары", country: "Аргентина" },
               { date: "2024-10-07", name: "Праздник «Шмини Ацерет», Симхат Тора", country: "Израиль" },
               { date: "2024-10-07", name: "Торговый праздник", country: "Антигуа и Барбуда" },
        
            
          
       
               { date: "2024-10-08", name: "День независимости(Хорватия)", country: "Хорватия" },
               { date: "2024-10-08", name: "День военно-воздушных сил(Индия)", country: "Индия" },
              

          
               
               { date: "2024-10-08", name: "День сельскохозяйства(Таджикистан)", country: "Таджикистан" },
               { date: "2024-10-08", name: "День работников культуры(Беларусь)", country: "Беларусь" },
               { date: "2024-10-08", name: "День танкиста(Армения)", country: "Армения" },
               { date: "2024-10-08", name: "Праздник урожая в Армении", country: "Армения" },
             
           
               { date: "2024-10-09", name: "День военно-морских сил(Туркменистан)", country: "Туркменистан" },
               { date: "2024-10-09", name: "День памяти жертв холокоста(Румыния)", country: "Румыния" },
               { date: "2024-10-09", name: "День отмены рабства(Сен-Бартелеми)", country: "Сен-Бартелеми" },
               { date: "2024-10-09", name: "День национального достоинства(Перу)", country: "Перу" },
               { date: "2024-10-09", name: "День независимости(Уганда)", country: "Уганда" },
               { date: "2024-10-09", name: "День национального наследия(Тёркс и Кайкос)", country: "Тёркс и Кайкос" },
           

               { date: "2024-10-09", name: "День святого Эрнесто", country: "Боливия" },
               { date: "2024-10-09", name: "День корейского алфавита", country: "Южная Корея" },
               { date: "2024-10-09", name: "День Конституции(Синт-Мартен)", country: "Синт-Мартен" },

               { date: "2024-10-09", name: "День независимости Гуаякиля", country: "Эквадор" },
        
               { date: "2024-10-09", name: "День сельскохозяйственной выставки", country: "Остров Норфолк" },
               { date: "2024-10-09", name: "День армянских гор", country: "Армения" },
         

               { date: "2024-10-09", name: "Осенний фестиваль в Такаяме", country: "Япония" },


               { date: "2024-10-10", name: "День независимости(Фиджи)", country: "Фиджи" },
               { date: "2024-10-10", name: "День финской литературы", country: "Финляндия" },
          
               { date: "2024-10-10", name: "День армии", country: "Шри-Ланка" },
               { date: "2024-10-10", name: "День маронов(Суринам)", country: "Суринам" },
               { date: "2024-10-10", name: "День референдума", country: "Австрия" },
               { date: "2024-10-10", name: "День Мои", country: "Кения" },
           
               { date: "2024-10-10", name: "Национальный праздник(Кюрасао)", country: "Кюрасао" },
             
               { date: "2024-10-11", name: "День боливийской женщины", country: "Боливия" },
               { date: "2024-10-11", name: "День народного восстания(Северная Македония)", country: "Северная Македония" },
               { date: "2024-10-11", name: "День вооружённых сил в Абхазии", country: "Абхазия" },
              
         
               { date: "2024-10-12", name: "День борьбы с табакокурением", country: "Армения" },
               { date: "2024-10-12", name: "День ребёнка(Бразилия)", country: "Бразилия" },
               { date: "2024-10-12", name: "День освобождения(Лаос)", country: "Лаос" },
               { date: "2024-10-12", name: "День инженера(Уругвай)", country: "Уругвай" },
             
        
               { date: "2024-10-12", name: "День открытия Америки", country: "Гондурас" },
               { date: "2024-10-12", name: "День испанской нации", country: "Испания" },
               { date: "2024-10-12", name: "День индейского сопротивления", country: "Венесуэла" },
               { date: "2024-10-12", name: "День уважения культурных различий", country: "Аргентина" },
         
               { date: "2024-10-12", name: "День национальных героев(Багамские острова)", country: "Багамские острова" },
               { date: "2024-10-12", name: "День испанской расы", country: "Сальвадор" },
              
               { date: "2024-10-12", name: "Royal Launceston Show", country: "Австралия" },
               { date: "2024-10-12", name: "Праздник явления Богородицы", country: "Бразилия" },

               { date: "2024-10-13", name: "Праздник детства «Белое воскресенье»(Самоа)", country: "Самоа" },


               { date: "2024-10-13", name: "День предпринимателя(Вьетнам)", country: "Вьетнам" },

               { date: "2024-10-13", name: "День Рвагасоре", country: "Бурунди" },
               { date: "2024-10-13", name: "Праздник предков «Пчум Бен»(Камбоджа)", country: "Камбоджа" },
               { date: "2024-10-13", name: "Праздник «О-эсики»", country: "Япония" },
             
           
               { date: "2024-10-14", name: "День матери в Беларусии", country: "Беларусь" },
               { date: "2024-10-14", name: "День защитников и защитниц", country: "Украина" },
            
       
            
               { date: "2024-10-14", name: "День Еревана", country: "Армения" },
           

 
               { date: "2024-10-14", name: "День Ньерере(Танзания)", country: "Танзания" },
               { date: "2024-10-14", name: "День освобождения(Йемен)", country: "Йемен" },

          
               { date: "2024-10-14", name: "День Кишинёва", country: "Молдова" },
             
 

               { date: "2024-10-14", name: "Праздник Мцхетоба-Светицховлоба", country: "Грузия" },
               { date: "2024-10-14", name: "Праздник переводчика(НКР)", country: "НКР" },
          
               { date: "2024-10-14", name: "Белый понедельник(Самоа)", country: "Самоа" },
      
               { date: "2024-10-15", name: "День матери в Малави", country: "Малави" },
               
            
               { date: "2024-10-15", name: "День матери в Аргентине", country: "Аргентина" },
               { date: "2024-10-15", name: "День учителя в Бразилии", country: "Бразилия" },

       
               { date: "2024-10-15", name: "День памяти короля-отца(Камбоджа)", country: "Камбоджа" },
 
    
               { date: "2024-10-15", name: "Праздник урожая «Кирмес»", country: "Германия" },
              
               { date: "2024-10-15", name: "Праздник «Моцаметоба»", country: "Грузия" },

               
               { date: "2024-10-16", name: "День таджикского кино", country: "Таджикистан" },
               { date: "2024-10-16", name: "День принятия ислама", country: "Мальдивы" },
               { date: "2024-10-16", name: "День армянской прессы", country: "Армения" },
               { date: "2024-10-16", name: "День национальных героев", country: "Ямайка" },
               { date: "2024-10-16", name: "День памяти жертв геноцида в Литве", country: "Литва" },
               { date: "2024-10-16", name: "День военно-воздушных сил в Болгарии", country: "Болгария" },
               { date: "2024-10-16", name: "День Иоанна Павла II(Польша)", country: "Польша" },
               { date: "2024-10-16", name: "День памяти Лиаката Али Хана", country: "Пакистан" },
               { date: "2024-10-16", name: "День учителя(Чили)", country: "Чили" },
               { date: "2024-10-16", name: "Фестиваль «Сеньор-де-Лурен»(Перу)", country: "Перу" },
               { date: "2024-10-17", name: "День верности", country: "Аргентина" },
          
               { date: "2024-10-17", name: "День памяти Дессалина", country: "Гаити" },
               { date: "2024-10-17", name: "День полиции(Тайланд)", country: "Тайланд" },
         
            
               { date: "2024-10-18", name: "День независимости в Айзербайджане", country: "Азербайджан" },
               { date: "2024-10-18", name: "День флага(Чили)", country: "Чили" },
             
  
 
               { date: "2024-10-18", name: "День молитвы", country: "Замбия" },

          
               { date: "2024-10-18", name: "День героев и праотцов", country: "Британские Виргинские острова" },

          
               { date: "2024-10-19", name: "День ракетно-артиллерийских войск", country: "Армения" },
      
               { date: "2024-10-19", name: "День работников социальной защиты", country: "Кыргызстан" },
               { date: "2024-10-19", name: "День святого Ивана Рильского", country: "Болгария" },
               { date: "2024-10-19", name: "День перуанско-африканской дружбы(Перу)", country: "Перу" },
             
         
               { date: "2024-10-19", name: "День Конституции(Ниуэ)", country: "Ниуэ" },
               { date: "2024-10-19", name: "День беатификации матери Терезы", country: "Албания" },
        
               { date: "2024-10-20", name: "День человека с синдромом Дауна", country: "ЮАР" },
              

               { date: "2024-10-20", name: "День освобождения Белграда", country: "Сербия" },
               { date: "2024-10-20", name: "День вьетнамской женщины", country: "Вьетнам" },

       
               { date: "2024-10-20", name: "День героев Кении", country: "Кения" },
               { date: "2024-10-20", name: "День революции(Гватемала)", country: "Гватемала" },
               { date: "2024-10-20", name: "День региона Хокс-Бей(Новая Зеландия)", country: "Новая Зеландия" },

          
              
               { date: "2024-10-21", name: "День памяти жертв Второй мировой войны", country: "Сербия" },
               
            
               { date: "2024-10-21", name: "День государственного языка", country: "Узбекистан" },
               { date: "2024-10-21", name: "День революции(Сомали)", country: "Сомали" },

               { date: "2024-10-21", name: "День отца в Беларусии", country: "Беларусь" },
               { date: "2024-05-01", name: "День согласия(Маршалловы острова)", country: "Маршалловы острова" },
               { date: "2024-10-21", name: "День святой Урсулы", country: "Британские Виргинские острова" },
         
               { date: "2024-10-21", name: "Праздник полной луны", country: "Лаос" },

            

               { date: "2024-10-22", name: "День алии", country: "Израиль" },
      
       
               { date: "2024-10-22", name: "Праздник эпох «Дзидай-мацури»", country: "Япония" },
      
               { date: "2024-10-23", name: "День освобождения в Египте", country: "Египет" },
               { date: "2024-10-23", name: "День доктора", country: "Мексика" },

            
               { date: "2024-10-23", name: "День республики в Венгрии", country: "Венгрия" },
               { date: "2024-10-23", name: "День македонской революционной борьбы(Северная Македония)", country: "Северная Македония" },
               { date: "2024-10-23", name: "Праздник двойной девятки", country: "Китай" },
   
               { date: "2024-10-24", name: "День дипломатического работника", country: "Кыргызстан" },
          
               { date: "2024-10-24", name: "День библиотек", country: "Германия" },
               { date: "2024-10-24", name: "День программиста", country: "Китай" },
               { date: "2024-10-24", name: "День святого Рафаила", country: "Испания" },
               { date: "2024-10-24", name: "День Азад-Кашмира", country: "Пакистан" },
   
               { date: "2024-10-24", name: "День народного сопротивления", country: "Египет" },
               { date: "2024-10-24", name: "День независимости(Замбия)", country: "Замбия" },
          


               { date: "2024-10-24", name: "Праздник «Дашайн»(Непал)", country: "Непал" },
               { date: "2024-10-25", name: "День Республики(Казахстан)", country: "Казахстан" },
               { date: "2024-10-25", name: "Праздник мельников(Беларусь)", country: "Беларусь" },
               { date: "2024-10-25", name: "День сотрудников органов внутренних дел", country: "Узбекистан" },
               { date: "2024-10-25", name: "День карате", country: "Япония" },
             
        
               { date: "2024-10-26", name: "Гонконгский фестиваль вина и гастрономии", country: "Китай" },
          
               { date: "2024-10-26", name: "День инженера(Тунис)", country: "Тунис" },
               { date: "2024-10-26", name: "День святого Димитрия Солунского", country: "Болгария" },
          
               { date: "2024-10-26", name: "День Ангама", country: "Науру" },
               { date: "2024-10-26", name: "День вооружённых сил в Бенине", country: "Бенин" },
         
               { date: "2024-10-26", name: "День Евангелия(Острова Кука)", country: "Острова Кука" },
            
               { date: "2024-10-26", name: "Национальный день республики", country: "Австрия" },




               { date: "2024-10-27", name: "День учителя в Австралии", country: "Австралия" },
               { date: "2024-10-27", name: "День национального флага(Греция)", country: "Греция" },
               { date: "2024-10-27", name: "День независимости(Сент-Винсент и Гренадины)", country: "Сент-Винсент и Гренадины" },
               { date: "2024-10-27", name: "День памяти жертв теракта в парламенте", country: "Армения" },
          
               { date: "2024-10-27", name: "День траура по Кашмиру", country: "Пакистан" },
               { date: "2024-10-27", name: "День черновской трагедии", country: "Словакия" },
               { date: "2024-10-27", name: "День памяти Ицхака Рабина", country: "Израиль" },
               { date: "2024-10-27", name: "День Пениамина", country: "Ниуэ" },
         
               { date: "2024-10-28", name: "День детей Малайзии", country: "Малайзия" },
       
               
               { date: "2024-10-28", name: "День инженера(Венесуэла)", country: "Венесуэла" },
               { date: "2024-10-28", name: "День независимости Чехословацкой Республики", country: "Чехия" },
               { date: "2024-10-28", name: "День «Охи»", country: "Кипр" },
               { date: "2024-10-28", name: "День предотвращения последствий землетрясений в префектуре Гифу", country: "Япония" },
               { date: "2024-10-28", name: "День государственных служащих в Бразилии", country: "Бразилия" },
     
          
               { date: "2024-10-28", name: "Праздник света", country: "Лаос" },
               { date: "2024-10-28", name: "Праздник «Вап Поя»", country: "Шри-Ланка" },


               { date: "2024-10-29", name: "День принятия Конституции", country: "Сербия" },
             
  
     
               { date: "2024-10-29", name: "День местных сообществ", country: "Кыргызстан" },
               { date: "2024-10-29", name: "День столицы", country: "Монголия" },
               { date: "2024-10-29", name: "День республики(Турция)", country: "Турция" },
               { date: "2024-10-29", name: "День Кира Великого", country: "Иран" },
               { date: "2024-10-29", name: "День покаяния(Норвегия)", country: "Норвегия" },
               { date: "2024-10-29", name: "День коронации короля(Камбоджа)", country: "Камбоджа" },
               { date: "2024-10-29", name: "День памяти Людовита Штура", country: "Словакия" },
               { date: "2024-10-29", name: "Праздник святого Нарцисса", country: "Испания" },
             
               { date: "2024-10-29", name: "Праздник «Коджаграт Пурнима»(Непал)", country: "Непал" },
               { date: "2024-10-30", name: "День национальной валюты", country: "Индонезия" },
               { date: "2024-10-30", name: "День провинции Мальборо(Новая Зеландия)", country: "Новая Зеландия" },
               { date: "2024-10-30", name: "День принятия Декларации словацкой нации", country: "Словакия" },
           
            
    
      
     
               { date: "2024-10-31", name: "День мучеников(Буркина-Фасо)", country: "Буркина-Фасо" },
               { date: "2024-10-31", name: "День Саси-Перере", country: "Бразилия" },
          
               
               { date: "2024-10-31", name: "День Реформации(Словения)", country: "Словения" },
               { date: "2024-10-31", name: "День креольской музыки(Перу)", country: "Перу" },
               { date: "2024-10-31", name: "День национального герба", country: "Эквадор" },
               { date: "2024-10-31", name: "Национальный день единства(Индия)", country: "Индия" },
               { date: "2024-10-31", name: "Праздник окончания уборки урожая «Самайн»", country: "Ирландия" },
           
               { date: "2024-11-01", name: "День коронации короля(Бутан)", country: "Бутан" },
               { date: "2024-11-01", name: "День независимости (Антигуа и Барбуда)", country: "Антигуа и Барбуда" },
               { date: "2024-11-01", name: "День революции в Алжире", country: "Алжир" },
               { date: "2024-11-01", name: "День работника милиции", country: "Кыргызстан" },

               { date: "2024-11-02", name: "День мёртвых", country: "Колумбия" },
               { date: "2024-11-02", name: "День работника культуры", country: "Кыргызстан" },
               { date: "2024-11-02", name: "День памяти предков(Беларусь)", country: "Беларусь" },
               { date: "2024-11-02", name: "День прибытия индийцев", country: "Маврикий" },
           
               { date: "2024-11-02", name: "Праздник святого Юстуса", country: "Италия" },
               { date: "2024-11-03", name: "День независимости(Доминика)", country: "Доминика" },
               { date: "2024-11-03", name: "День культуры", country: "Япония" },
               { date: "2024-11-03", name: "День рождения Султана Перака", country: "Малайзия" },
               { date: "2024-11-03", name: "День независимости Куэнки", country: "Эквадор" },
               { date: "2024-11-03", name: "День флага(ОАЭ)", country: "ОАЭ" },
               { date: "2024-11-03", name: "День инженерных войск", country: "Украина" },
              
               { date: "2024-07-28", name: "День независимости Микронезии", country: "Микронезия" },
               { date: "2024-11-03", name: "День независимости(Панама)", country: "Панама" },

               { date: "2024-11-03", name: "День победы(Мальдивы)", country: "Мальдивы" },
          
               { date: "2024-11-03", name: "Женский день(Восточный Тимор)", country: "Восточный Тимор" },
     
               { date: "2024-11-04", name: "День любви", country: "Египет" },
           
             
               { date: "2024-06-16", name: "День детей", country: "ЮАР" },
               { date: "2024-11-01", name: "День кекри", country: "Финляндия" },
               { date: "2024-11-04", name: "День флага(Панама)", country: "Панама" },
               { date: "2024-11-04", name: "День памяти святого Карло Борромео", country: "Андорра" },
               { date: "2024-11-04", name: "День социального работника(Армения)", country: "Армения" },
              
               { date: "2024-11-04", name: "День национального единства и вооружённых сил", country: "Италия" },
               { date: "2024-11-04", name: "День служения обществу", country: "Доминика" },
               { date: "2024-11-04", name: "День гражданства(Северные Марианские острова)", country: "Северные Марианские острова" },
          
               { date: "2024-11-05", name: "День разведывательных войск", country: "Армения" },
            
               { date: "2024-11-05", name: "День португальского языка", country: "Бразилия" },
               { date: "2024-11-05", name: "День флага(Сан-Томе и Принсипи)", country: "Сан-Томе и Принсипи" },
               { date: "2024-11-05", name: "День революции, День Негроса", country: "Филиппины" },
               { date: "2024-11-05", name: "День Пуно(Перу)", country: "Перу" },
               { date: "2024-11-05", name: "День независимости Колона(Панама)", country: "Панама" },
  

    
             
             

                 { date: "2024-11-06", name: "День шведской культуры", country: "Финляндия" },
               { date: "2024-11-06", name: "День Конституции(Таджикистан)", country: "Таджикистан" },
               { date: "2024-11-06", name: "День Зелёного марша", country: "Марокко" },
               
               { date: "2024-11-06", name: "День памяти короля Густава II Адольфа", country: "Швеция" },
               { date: "2024-11-06", name: "День блаженного Нуно(Португалия)", country: "Португалия" },
          
           
           
      
               { date: "2024-11-07", name: "Дни истории и памяти предков", country: "Кыргызстан" },

               { date: "2024-11-07", name: "День спортивного журналиста", country: "Аргентина" },
               { date: "2024-11-07", name: "День нотариуса", country: "Грузия" },
               { date: "2024-11-07", name: "День венгерской оперы", country: "Венгрия" },
               { date: "2024-11-07", name: "День революции и солидарности", country: "Бангладеш" },

               { date: "2024-11-08", name: "День журналиста(Китай)", country: "Китай" },
            
         
               { date: "2024-11-08", name: "День Победы в Азербайджан", country: "Азербайджан" },
               { date: "2024-11-08", name: "День черепов", country: "Боливия" },
        
    

           
      
              
               { date: "2024-10-27", name: "День украинской письменности и языка", country: "Украина" },
       
               { date: "2024-11-09", name: "День Икбала", country: "Пакистан" },

               { date: "2024-11-09", name: "День государственного флага в Азербайджане", country: "Азербайджан" },
               { date: "2024-11-09", name: "День независимости Камбоджи", country: "Камбоджа" },
         
               { date: "2024-11-09", name: "День моделей", country: "Бразилия" },

               { date: "2024-11-09", name: "День падения Берлинской стены", country: "Германия" },
           
             
               { date: "2024-11-10", name: "День пшеницы", country: "Бразилия" },
             
        
               { date: "2024-11-10", name: "День молодёжи(Кыргызстан)", country: "Кыргызстан" },
           
               { date: "2024-11-10", name: "Праздник «Дхантерас»", country: "Индия" },
               { date: "2024-11-11", name: "День холостяков", country: "Китай" },
         
          

               { date: "2024-11-11", name: "День Синт-Мартена", country: "Синт-Мартен" },
               { date: "2024-06-18", name: "День республики(Мальдивы)", country: "Мальдивы" },
               { date: "2024-11-11", name: "День независимости в Анголе", country: "Ангола" },
               { date: "2024-11-11", name: "День Лачплесиса", country: "Латвия" },
        
               { date: "2024-11-11", name: "День перемирия в Первой мировой войне", country: "Сербия" },
               { date: "2024-11-02", name: "День рождения султана Келантана", country: "Малайзия" },
               { date: "2024-11-11", name: "День независимости Картахены", country: "Колумбия" },
          

        
             
               { date: "2024-11-11", name: "Праздник независимости(Польша)", country: "Польша" },
            
            

               { date: "2024-11-12", name: "День отца(Индонезия)", country: "Индонезия" },
               { date: "2024-11-12", name: "День отца в Исландии", country: "Исландия" },
            
               { date: "2024-11-12", name: "День бабушки в Аргентине", country: "Аргентина" },
           
               { date: "2024-11-12", name: "День Конституции в Айзербайджане", country: "Азербайджан" },
               { date: "2024-11-12", name: "День молодёжи в Восточном Тиморе" , country: "Восточный Тимор" },
               { date: "2024-11-12", name: "День рождения Хуаны Инес де ла Крус", country: "Мексика" },
               { date: "2024-11-12", name: "День махоре", country: "Коморские острова" },
               { date: "2024-11-12", name: "День пупусы", country: "Сальвадор" },
               { date: "2024-11-12", name: "День медицинских работников", country: "Узбекистан" },
           

  
     
               { date: "2024-11-13", name: "День рождения наследника престола", country: "Тувалу" },
         
               { date: "2024-11-13", name: "День памяти 100 тысяч мучеников Тбилиси", country: "Грузия" },

   
               { date: "2024-11-13", name: "День журналиста(Панама)", country: "Панама" },
               { date: "2024-11-13", name: "День национальной мысли", country: "Аргентина" },
       
               { date: "2024-11-13", name: "День памяти(Каймановы острова)", country: "Каймановы острова" },
               { date: "2024-11-13", name: "Праздник эфиопских общин «Сигд»", country: "Израиль" },
       
               { date: "2024-11-14", name: "День кузнеца(Беларусь)", country: "Беларусь" },
          
               { date: "2024-11-14", name: "День Добруджи(Румыния)", country: "Румыния" },
          
               { date: "2024-11-14", name: "День колумбийской женщины", country: "Колумбия" },
        

        
               { date: "2024-11-15", name: "День мира(Кот-д`Ивуар)", country: "Кот-д`Ивуар" },

          
               { date: "2024-11-15", name: "День национальной валюты(Казахстан)", country: "Казахстан" },
         
               { date: "2024-11-15", name: "День независимости(Палестина)", country: "Палестина" },
               { date: "2024-11-15", name: "День святого Леопольда", country: "Австрия" },
               { date: "2024-11-15", name: "День провозглашения республики(Бразилия)", country: "Бразилия" },


   
               { date: "2024-11-15", name: "День памяти Рафаила Калиновского(Польша)", country: "Польша" },

               { date: "2024-11-15", name: "Праздник детей «Сити-го-сан»", country: "Япония" },
               { date: "2024-11-16", name: "Праздник молодого вина «Божоле нуво»", country: "Франция" },
               { date: "2024-11-16", name: "День моря(Португалия)", country: "Португалия" },
               { date: "2024-11-16", name: "День матери(КНДР)", country: "КНДР" },
          
               { date: "2024-11-16", name: "День белорусской куклы", country: "Беларусь" },
               { date: "2024-05-23", name: "День морской пехоты", country: "Украина" },
               
           
   
               
               { date: "2024-11-16", name: "День исландского языка", country: "Исландия" },
               { date: "2024-11-16", name: "День возрождения", country: "Эстония" },

               { date: "2024-11-16", name: "День ветеранов боевых действий в Анголе", country: "Ангола" },
               { date: "2024-11-16", name: "День национальной прессы(Индия)", country: "Индия" },
               { date: "2024-11-16", name: "День флага в Бонэйре", country: "Бонэйр" },
               { date: "2024-11-16", name: "День дипломатической службы(Польша)", country: "Польша" },
 
               { date: "2024-11-17", name: "День военно-медицинского работника", country: "Армения" },
      
               { date: "2024-11-17", name: "День национального возрождения", country: "Азербайджан" },
             
        
               { date: "2024-11-17", name: "День провинции Кентербери(Новая Зеландия)", country: "Новая Зеландия" },
               { date: "2024-11-17", name: "День борьбы за свободу и демократию", country: "Словакия" },
               { date: "2024-11-17", name: "День Политехнио", country: "Греция" },
               { date: "2024-05-01", name: "День президента(Маршалловы острова)", country: "Маршалловы острова" },
               { date: "2024-11-17", name: "Праздник «Чхатх Пуджа»", country: "Индия" },
               { date: "2024-11-17", name: "Фестиваль «Чхатх»(Непал)", country: "Непал" },
              
               { date: "2024-11-18", name: "День сержанта ВСУ", country: "Украина" },
               { date: "2024-11-18", name: "День Государственного флага(Узбекистан)", country: "Узбекистан" },
               { date: "2024-11-18", name: "День независимости в Латвии", country: "Латвия" },
               { date: "2024-11-18", name: "День памяти о Вуковарских событиях", country: "Хорватия" },
               { date: "2024-11-18", name: "День сражения при Вертриере", country: "Гаити" },
  
               { date: "2024-11-18", name: "Национальный праздник(Оман)", country: "Оман" },
               { date: "2024-11-19", name: "День работников сельского хозяйства(Беларусь)", country: "Беларусь" },

             
               
              
             
  
               { date: "2024-11-19", name: "День открытия(Пуэрто-Рико)", country: "Пуэрто-Рико" },
               { date: "2024-11-19", name: "День флага в Бразилии", country: "Бразилия" },
               { date: "2024-11-19", name: "День народа гарифуна", country: "Белиз" },
      
           
               { date: "2024-11-19", name: "День освобождения(Мали)", country: "Мали" },
               { date: "2024-11-19", name: "Национальный день в Монако", country: "Монако" },
             
      
             
               { date: "2024-11-20", name: "Джеоргуыба", country: "Южная Осетия" },
 
               { date: "2024-11-20", name: "День военно-морского флота(Тайланд)", country: "Тайланд" },
               { date: "2024-11-20", name: "День революции(Мексика)", country: "Мексика" },
           
               { date: "2024-11-20", name: "День сознания темнокожих", country: "Бразилия" },
               { date: "2024-11-20", name: "День учителя(Вьетнам)", country: "Вьетнам" },
               { date: "2024-11-20", name: "День национального суверенитета в Аргентине", country: "Аргентина" },
               { date: "2024-11-21", name: "День медсестры(Аргентина)", country: "Аргентина" },
               { date: "2024-11-21", name: "День гомеопатии", country: "Бразилия" },
               
               { date: "2024-11-21", name: "День Десантно-штурмовых войск", country: "Украина" },
             
               { date: "2024-11-21", name: "День вооружённых сил в Бангладеше", country: "Бангладеш" },
               { date: "2024-11-21", name: "День общего договора о мире", country: "Босния и Герцеговина" },
       
               { date: "2024-11-21", name: "Праздник Девы Марии делла Салюте", country: "Италия" },
    
           

             
               { date: "2024-11-22", name: "День учителя(Коста-Рика)", country: "Коста-Рика" },
               
               { date: "2024-11-22", name: "Праздник святой Сесилии", country: "Мексика" },
               { date: "2024-11-22", name: "День независимости в Ливане", country: "Ливан" },
          
        
               { date: "2024-11-22", name: "День албанского алфавита", country: "Албания" },
    


        
               { date: "2024-11-22", name: "День психолога", country: "Венесуэла" },
           
             
               { date: "2024-11-23", name: "День благодарения", country: "Микронезия" },
               { date: "2024-11-23", name: "День президентов", country: "Микронезия" },
               
               { date: "2024-11-23", name: "День святого Георгия(Грузия)", country: "Грузия" },
            
               { date: "2024-11-23", name: "День начала противостояния", country: "Южная Осетия" },
               { date: "2024-11-23", name: "День Рудольфа Майстера(Словения)", country: "Словения" },
               { date: "2024-11-23", name: "День литовских воинов", country: "Литва" },
               { date: "2024-11-23", name: "День Геродота", country: "Греция" },
               { date: "2024-11-23", name: "День инженера-электрика", country: "Бразилия" },
               { date: "2024-11-23", name: "День инженера(Португалия)", country: "Португалия" },
         
        
           
           
               { date: "2024-11-24", name: "День Государственного флага(Таджикистан)", country: "Таджикистан" },
               { date: "2024-11-24", name: "День учителя(Турция)", country: "Турция" },
               { date: "2024-11-24", name: "День семьи(Палау)", country: "Палау" },
               { date: "2024-11-24", name: "День благодарения(Тёркс и Кайкос)", country: "Тёркс и Кайкос" },
               { date: "2024-11-24", name: "День научной культуры(Португалия)", country: "Португалия" },
            
               { date: "2024-11-24", name: "День революции(Конго)", country: "Конго" },
   
            
              
               { date: "2024-11-24", name: "Женский день(Самоа)", country: "Самоа" },
             

             
               { date: "2024-11-25", name: "День учителя(Индонезия)", country: "Индонезия" },

               { date: "2024-11-25", name: "День независимости(Суринам)", country: "Суринам" },
               { date: "2024-11-25", name: "День государственности(Босния и Герцеговина)", country: "Босния и Герцеговина" },
          
           
              
               { date: "2024-11-26", name: "День Конституции в Абхазии", country: "Абхазия" },
               { date: "2024-11-26", name: "День провозглашения республики", country: "Монголия" },
               { date: "2024-11-26", name: "День юмориста", country: "Аргентина" },
               { date: "2024-11-26", name: "День бабушек и дедушек(Сингапур)", country: "Сингапур" },
               { date: "2024-11-26", name: "День поминовения усопших", country: "Германия" },
       
      
             
               { date: "2024-11-26", name: "День Конституции(Индия)", country: "Индия" },

               { date: "2024-11-26", name: "Праздник хлопка", country: "Узбекистан" },
               { date: "2024-11-26", name: "Фестиваль бумажных фонариков и горящих воздушных шаров «Тазаундаин»", country: "Мьянма" },
             
       
               { date: "2024-11-27", name: "День военной авиации", country: "Венесуэла" },
  
   
               { date: "2024-11-27", name: "День специалиста по охране труда", country: "Бразилия" },
          
               { date: "2024-11-27", name: "День великих героев", country: "Шри-Ланка" },
               { date: "2024-11-27", name: "День здравоохранения(Тайланд)", country: "Тайланд" },
               { date: "2024-11-27", name: "Праздник духа воды и света «Лойкратхонг»(Тайланд)", country: "Тайланд" },
               { date: "2024-11-28", name: "Пилиповка(Беларусь)", country: "Беларусь" },
             
             

               { date: "2024-11-28", name: "День памяти святых апостолов Фаддея и Варфоломея", country: "Армения" },
               { date: "2024-11-28", name: "День военно-морского флота(Иран)", country: "Иран" },
               { date: "2024-11-28", name: "День провозглашения независимости(Восточный Тимор)", country: "Восточный Тимор" },
               { date: "2024-11-28", name: "День республики(Чад)", country: "Чад" },
               { date: "2024-11-28", name: "День независимости Мавритании", country: "Мавритания" },
               { date: "2024-11-28", name: "День независимости, День флага", country: "Албания" },

               { date: "2024-11-28", name: "День Буковины(Румыния)", country: "Румыния" },
               { date: "2024-11-28", name: "День республики в Бурунди", country: "Бурунди" },
              
               { date: "2024-11-29", name: "День единения(Вануату)", country: "Вануату" },
               { date: "2024-11-29", name: "День благодарения(Остров Норфолк)", country: "Остров Норфолк" },
               { date: "2024-11-29", name: "День освобождения в Албании", country: "Албания" },
          
         
      
               { date: "2024-11-30", name: "День святого апостола Андрея", country: "Шотландия" },
               { date: "2024-11-30", name: "День независимости(Йемен)", country: "Йемен" },
               { date: "2024-11-30", name: "День памяти еврейских беженцев из арабских стран", country: "Израиль" },
               { date: "2024-11-30", name: "День независимости в Барбадосе", country: "Барбадос" },
               
               { date: "2024-11-30", name: "День Регины Мунди", country: "ЮАР" },
               { date: "2024-11-30", name: "День Андреса Бонифасио", country: "Филиппины" },
           
               { date: "2024-11-30", name: "Праздник Тосканы", country: "Италия" },
             
         
  
   
           

            
               { date: "2024-12-03", name: "День уругвайского танца «Кандомбе»(Уругвай)", country: "Уругвай" },
               { date: "2024-12-03", name: "День культуры синдхов", country: "Пакистан" },
               { date: "2024-12-03", name: "День юриста в Беларусии", country: "Беларусь" },
               { date: "2024-12-04", name: "День ремесленников", country: "Мексика" },
           
               { date: "2024-12-04", name: "День военно-морского флота(Индия)", country: "Индия" },
               { date: "2024-12-04", name: "День шахтёра(Польша)", country: "Польша" },
           
               { date: "2024-12-04", name: "День окружающей среды(Тайланд)", country: "Тайланд" },
        
               { date: "2024-12-04", name: "День провозглашения государства(Тонга)", country: "Тонга" },
    
               { date: "2024-12-05", name: "День детей(Суринам)", country: "Суринам" },
               { date: "2024-12-05", name: "День отца(Тайланд)", country: "Тайланд" },
            
               { date: "2024-12-05", name: "День открытия в Гаити", country: "Гаити" },
            
        
        
               { date: "2024-12-06", name: "День учителя(Израиль)", country: "Израиль" },
               { date: "2024-12-06", name: "День Вооружённых сил", country: "Украина" },
              

               { date: "2024-12-06", name: "День аргентинского гаучо", country: "Аргентина" },
               { date: "2024-12-06", name: "День независимости(Финляндия)", country: "Финляндия" },
               { date: "2024-12-06", name: "День Конституции(Испания)", country: "Испания" },
               { date: "2024-12-06", name: "День национальной полиции(Перу)", country: "Перу" },
               { date: "2024-12-07", name: "День сожжения дьявола", country: "Гватемала" },
               { date: "2024-12-07", name: "День памяти жертв Спитакского землетрясения", country: "Армения" },
               { date: "2024-12-07", name: "День маленьких свечек", country: "Колумбия" },
               { date: "2024-12-07", name: "День работников финансовых органов", country: "Таджикистан" },
               { date: "2024-12-07", name: "День диктора", country: "Гватемала" },
               { date: "2024-12-07", name: "День фермера(Гана)", country: "Гана" },
               { date: "2024-12-07", name: "День Западной провинции(Соломоновы острова)", country: "Соломоновы острова" },
               { date: "2024-12-07", name: "Праздник святого Амброзия", country: "Италия" },
               { date: "2024-12-07", name: "Праздник света в Лионе", country: "Франция" },
               { date: "2024-12-07", name: "Фестиваль вращающихся дервишей", country: "Турция" },
               { date: "2024-12-08", name: "День просветления Будды", country: "Япония" },
               { date: "2024-12-08", name: "День матери(Панама)", country: "Панама" },
               { date: "2024-12-08", name: "День святой покровительницы", country: "Гуам" },
               { date: "2024-12-08", name: "День наций, национальностей и народов", country: "Эфиопия" },
               { date: "2024-12-08", name: "День финской музыки", country: "Финляндия" },
               { date: "2024-12-08", name: "День студента в Болгарии", country: "Болгария" },
               { date: "2024-12-08", name: "День святого Климента Охридского", country: "Македония" },
               { date: "2024-12-08", name: "День Конституции(Северные Марианские острова)", country: "Северные Марианские острова" },
               { date: "2024-12-08", name: "День сражения", country: "Фолклендские острова" },
               { date: "2024-12-08", name: "День Конституции(Узбекистан)", country: "Узбекистан" },
               { date: "2024-12-08", name: "День Конституции(Румыния)", country: "Румыния" },
               { date: "2024-12-08", name: "Национальный праздник", country: "Остров Корсика" },
               { date: "2024-12-08", name: "Праздник свечей «Ханука»", country: "Израиль" },
               { date: "2024-12-08", name: "Праздник богини Ишчель", country: "Мексика" },
               { date: "2024-12-08", name: "Фестиваль «Эскаляд»", country: "Швейцария" },
               { date: "2024-12-09", name: "День лютефиска", country: "Финляндия" },
               { date: "2024-12-09", name: "День военно-морских сил", country: "Шри-Ланка" },
               { date: "2024-12-09", name: "День героев в Антиге и Барбуде", country: "Антигуа и Барбуда" },
               { date: "2024-12-09", name: "День армии(Перу)", country: "Перу" },
               { date: "2024-12-09", name: "День независимости(Танзания)", country: "Танзания" },
               { date: "2024-12-10", name: "День Государственного гимна", country: "Узбекистан" },
               { date: "2024-12-10", name: "День Нобеля", country: "Швеция" },
               { date: "2024-12-10", name: "День победы Ирака", country: "Ирак" },
               { date: "2024-12-10", name: "День социального работника в Аргентине", country: "Аргентина" },
               { date: "2024-12-10", name: "День Конституции(Тайланд)", country: "Тайланд" },
               { date: "2024-12-10", name: "День военно-воздушных сил(Венесуэла)", country: "Венесуэла" },
               { date: "2024-12-10", name: "День прав человека и мира(Кирибати)", country: "Кирибати" },
               { date: "2024-12-10", name: "День референдума о государственной независимости(НКР)", country: "НКР" },
               { date: "2024-12-10", name: "Женский день(Намибия)", country: "Намибия" },
               { date: "2024-12-11", name: "День инженера в Бразилии", country: "Бразилия" },
               { date: "2024-12-11", name: "День республики(Буркина-Фасо)", country: "Буркина-Фасо" },
               { date: "2024-12-11", name: "День основания Союза курдских женщин", country: "Ирак" },
               { date: "2024-12-11", name: "День Четвёртой республики", country: "Мадагаскар" },
               { date: "2024-12-11", name: "День провинции Пампанга", country: "Филиппины" },
               { date: "2024-12-11", name: "День султана Селангора", country: "Малайзия" },
               { date: "2024-12-12", name: "День иероглифов", country: "Япония" },
               { date: "2024-12-12", name: "День святой девы Марии Гваделупской", country: "Мексика" },
               { date: "2024-12-12", name: "День военно-воздушных сил(Хорватия)", country: "Хорватия" },
               { date: "2024-12-12", name: "День независимости Кении", country: "Кения" },
               { date: "2024-12-12", name: "День флага(Швейцария)", country: "Швейцария" },
               { date: "2024-12-13", name: "День моряка(Бразилия)", country: "Бразилия" },
               { date: "2024-12-13", name: "День памяти жертв Нанкинской резни", country: "Китай" },
               { date: "2024-12-13", name: "День республики(Мальта)", country: "Мальта" },
               { date: "2024-12-13", name: "Фестиваль огней и возрождения", country: "Сент-Люсия" },
               { date: "2024-12-14", name: "День чествования участников ликвидации последствий аварии на Чернобыльской АЭС", country: "Украина" },
               { date: "2024-12-14", name: "День казнённых интеллектуалов", country: "Бангладеш" },
               { date: "2024-12-14", name: "День памяти жертв Латской трагедии", country: "Абхазия" },
               { date: "2024-12-14", name: "День памяти 47 ронинов", country: "Япония" },
               { date: "2024-12-15", name: "День возвращения домой", country: "Остров Олдерни" },
               { date: "2024-12-15", name: "День индонезийской армии", country: "Индонезия" },
               { date: "2024-12-15", name: "День памяти жертв «Греческой операции» НКВД", country: "Греция" },
               { date: "2024-12-15", name: "День королевства(Нидерланды)", country: "Нидерланды" },
               { date: "2024-12-16", name: "День примирения", country: "ЮАР" },
               { date: "2024-12-16", name: "День спорта(Тайланд)", country: "Тайланд" },
               { date: "2024-12-16", name: "День клятвы(Орания)", country: "Орания" },
               { date: "2024-12-17", name: "День флага Курдистана", country: "Ирак" },
               { date: "2024-12-17", name: "Национальный день в Бутане", country: "Бутан" },
               { date: "2024-12-18", name: "День маффина", country: "Бразилия" },
               { date: "2024-12-18", name: "День республики(Нигер)", country: "Нигер" },
               { date: "2024-12-18", name: "День полиции(Молдова)", country: "Молдова" },
               { date: "2024-12-18", name: "Национальный день в Катаре", country: "Катар" },
               { date: "2024-12-19", name: "День героев и героинь", country: "Ангилья" },
               { date: "2024-12-20", name: "День отмены рабства(Реюньон)", country: "Реюньон" },
               { date: "2024-12-20", name: "День работника органов национальной безопасности(Беларусь)", country: "Беларусь" },
               { date: "2024-12-20", name: "День траура(Панама)", country: "Панама" },
               { date: "2024-12-20", name: "День основания Макао", country: "Китай" },
               { date: "2024-12-20", name: "День Бо Аун Чжао", country: "Мьянма" },
               { date: "2024-12-21", name: "День вооружённых сил(Филиппины)", country: "Филиппины" },
               { date: "2024-12-21", name: "День Сан-Томе", country: "Сан-Томе и Принсипи" },
               { date: "2024-12-21", name: "День памяти первого Президента(Туркменистан)", country: "Туркменистан" },
               { date: "2024-12-22", name: "День вооружённых сил(Вьетнам)", country: "Вьетнам" },
               { date: "2024-12-22", name: "День матери(Индонезия)", country: "Индонезия" },
               { date: "2024-12-22", name: "День единства(Зимбабве)", country: "Зимбабве" },
               { date: "2024-12-22", name: "День памяти Самбиса", country: "Нигерия" },
               { date: "2024-12-22", name: "Пост 10 Тевета", country: "Израиль" },
               { date: "2024-12-22", name: "Праздник «Дунчжи»", country: "Китай" },
               { date: "2024-12-23", name: "День детей(Судан)", country: "Судан" },
               { date: "2024-12-23", name: "День святого Торлака", country: "Исландия" },
               { date: "2024-12-23", name: "День победы(Египет)", country: "Египет" },
               { date: "2024-12-23", name: "День рождения королевы Сильвии", country: "Швеция" },
               { date: "2024-12-23", name: "Ночь редиса", country: "Мексика" },
               { date: "2024-12-23", name: "Праздник Блукаса", country: "Литва" },
               { date: "2024-12-24", name: "День Конституции(ПМР)", country: "ПМР" },
               { date: "2024-12-24", name: "День декларации о Рождественском мире", country: "Финляндия" },
               { date: "2024-12-24", name: "День независимости в Ливии", country: "Ливия" },
               { date: "2024-12-25", name: "День Каид-и-Азама", country: "Пакистан" },
               { date: "2024-12-25", name: "Фестиваль борьбы «Таканакуй»(Перу)", country: "Перу" },
               { date: "2024-12-26", name: "День отца в Болгарии", country: "Болгария" },
               { date: "2024-12-26", name: "День семьи(Намибия)", country: "Намибия" },
               { date: "2024-12-26", name: "День крапивника", country: "Ирландия" },
               { date: "2024-12-26", name: "День провозглашения провинции", country: "Австралия" },
               { date: "2024-12-26", name: "День доброй воли", country: "ЮАР" },
               { date: "2024-12-26", name: "День независимости и единства(Словения)", country: "Словения" },
               { date: "2024-12-26", name: "Карнавал «Джункано»", country: "Багамские острова" },
               { date: "2024-12-27", name: "День социалистической конституции", country: "КНДР" },
               { date: "2024-12-28", name: "День Комитета национальной безопасности", country: "Таджикистан" },
               { date: "2024-12-28", name: "День святого Гавриила", country: "Эфиопия" },
               { date: "2024-12-28", name: "Международный фестиваль Сахары(Тунис)", country: "Тунис" },
               { date: "2024-12-28", name: "Праздник первых плодов «Инквала»", country: "Эсватини" },
               { date: "2024-12-29", name: "День восстановления независимости в Монголии", country: "Монголия" },
               { date: "2024-12-29", name: "День Конституции", country: "Ирландия" },
               { date: "2024-12-29", name: "Масленица Рождественского поста", country: "Армения" },
               { date: "2024-12-30", name: "День республики(Мадагаскар)", country: "Мадагаскар" },
               { date: "2024-12-30", name: "День национального героя Хосе Рисаля", country: "Филиппины" },
               { date: "2024-12-30", name: "День провозглашения словацкой независимой церковной провинции", country: "Словакия" },
               { date: "2024-12-31", name: "День солидарности азербайджанцев всего мира", country: "Азербайджан" },
               { date: "2024-12-31", name: "День восстановления республики", country: "Швейцария" },
               { date: "2024-12-31", name: "День национальных героев(Восточный Тимор)", country: "Восточный Тимор" },
               { date: "2024-12-31", name: "Праздник «Хогманай»", country: "Шотландия" },
               { date: "2024-12-31", name: "Прощальное кипячение чайника в году", country: "Япония" }
];

let currentPage = 1;
const resultsPerPage = 5;

// Обработчик нажатия на кнопку поиска по стране
document.getElementById('search-button').addEventListener('click', function() {
    const countryInput = document.getElementById('country-search').value.trim();
    const modal = document.getElementById('modal');
    const resultsDiv = document.getElementById('results');
    const countryTitle = document.getElementById('country-title');
    const prevButton = document.getElementById('prev-button');
    const nextButton = document.getElementById('next-button');

    resultsDiv.innerHTML = ''; // Очистка предыдущих результатов
    currentPage = 1; // Сброс текущей страницы

    // Фильтруем праздники по стране
    const filteredHolidays = holidays.filter(holiday => 
        holiday.country.toLowerCase() === countryInput.toLowerCase()
    );

    if (filteredHolidays.length === 0) {
        // Если праздники не найдены, выводим сообщение и закрываем модальное окно
        alert("Праздники не найдены для указанной страны. Пожалуйста, попробуйте другую страну.");
        modal.style.display = "none"; // Закрываем модальное окно, если нет праздников
        return; // Прекращаем выполнение функции
    }

    // Сортируем праздники по дате
    filteredHolidays.sort((a, b) => new Date(a.date) - new Date(b.date));

    const totalResults = filteredHolidays.length;
    const totalPages = Math.ceil(totalResults / resultsPerPage);
    
    // Устанавливаем заголовок с названием страны
    countryTitle.textContent = `Праздники в стране ${countryInput.charAt(0).toUpperCase() + countryInput.slice(1)}`;

    // Показываем результаты текущей страницы
    renderResults(filteredHolidays, totalPages);

    // Управляем кнопками
    prevButton.style.display = currentPage > 1 ? 'block' : 'none';
    nextButton.style.display = currentPage < totalPages ? 'block' : 'none';

    // Открываем модальное окно
    modal.style.display = "block";

    // Управление кнопками "Следующая" и "Предыдущая"
    nextButton.onclick = function() {
        currentPage++;
        renderResults(filteredHolidays, totalPages);
    };

    prevButton.onclick = function() {
        currentPage--;
        renderResults(filteredHolidays, totalPages);
    };
});

function renderResults(filteredHolidays, totalPages) {
  const resultsDiv = document.getElementById('results');
  resultsDiv.innerHTML = '';

  const startIndex = (currentPage - 1) * resultsPerPage;
  const endIndex = startIndex + resultsPerPage;

  filteredHolidays.slice(startIndex, endIndex).forEach(holiday => {
      const btn = document.createElement('button');
      btn.className = 'holiday-result-button primary-button';
      btn.innerHTML = `<span>${new Date(holiday.date).toLocaleDateString('ru-RU')}: ${holiday.name.replace(/\(.*?\)$/, '').trim()}</span>`;
      if (typeof showHolidayDetails === 'function') {
          btn.addEventListener('click', () => showHolidayDetails(holiday));
      }
      resultsDiv.appendChild(btn);
  });

  const prevButton = document.getElementById('prev-button');
  const nextButton = document.getElementById('next-button');

  // Обновляем видимость кнопок
  prevButton.style.display = currentPage > 1 ? 'block' : 'none';
  nextButton.style.display = currentPage < totalPages ? 'block' : 'none';
}











// Обработчик нажатия на кнопку поиска по дате
document.getElementById('date-search-button').addEventListener('click', function() {
  const dateInput = document.getElementById('date-search').value;
  const resultsDiv = document.getElementById('results');
  const countryTitle = document.getElementById('country-title');
  const prevButton = document.getElementById('prev-button');
  const nextButton = document.getElementById('next-button');
  const modal = document.getElementById('modal');

  resultsDiv.innerHTML = ''; // Очистка предыдущих результатов
  currentPage = 1; // Сброс текущей страницы

  // Проверяем, введена ли дата
  if (!dateInput) {
      alert("Пожалуйста, выберите дату!");
      return;
  }

  const selectedDate = new Date(dateInput);
  const selectedMonth = selectedDate.getMonth();
  const selectedDay = selectedDate.getDate();

  // Фильтруем праздники по выбранному месяцу и дню
  const filteredHolidaysByDate = holidays.filter(holiday => {
      const holidayDate = new Date(holiday.date);
      return (
          holidayDate.getMonth() === selectedMonth &&
          holidayDate.getDate() === selectedDay
      );
  });

  const totalResults = filteredHolidaysByDate.length;
  const totalPages = Math.ceil(totalResults / resultsPerPage);

  // Устанавливаем заголовок с выбранной датой (месяц и день)
  const formattedDay = String(selectedDay).padStart(2, '0');
  const formattedMonth = String(selectedMonth + 1).padStart(2, '0');
  countryTitle.textContent = `Праздники на ${formattedDay}.${formattedMonth}`;

  // Показываем результаты текущей страницы
  renderResults(filteredHolidaysByDate, totalPages);

  // Управляем кнопками
  prevButton.style.display = currentPage > 1 ? 'block' : 'none';
  nextButton.style.display = currentPage < totalPages ? 'block' : 'none';

  // Открываем модальное окно
  modal.style.display = "block";

  // Управление кнопками "Следующая" и "Предыдущая"
  nextButton.onclick = function() {
      currentPage++;
      renderResults(filteredHolidaysByDate, totalPages);
  };

  prevButton.onclick = function() {
      currentPage--;
      renderResults(filteredHolidaysByDate, totalPages);
  };
});

// Функция для отображения результатов на текущей странице
function renderResults(filteredHolidays, totalPages) {
  const resultsDiv = document.getElementById('results');
  resultsDiv.innerHTML = '';

  const startIndex = (currentPage - 1) * resultsPerPage;
  const endIndex = startIndex + resultsPerPage;

  filteredHolidays.slice(startIndex, endIndex).forEach(holiday => {
      const holidayDate = new Date(holiday.date);
      // Форматируем дату, добавляя ведущие нули
      const formattedDate = `${String(holidayDate.getDate()).padStart(2, '0')}.${String(holidayDate.getMonth() + 1).padStart(2, '0')}`; // Формат "День.Месяц"
      const btn = document.createElement('button');
      btn.className = 'holiday-result-button primary-button';
      btn.innerHTML = `<span>${formattedDate}: ${holiday.name} (${holiday.country})</span>`;
      if (typeof showHolidayDetails === 'function') {
          btn.addEventListener('click', () => showHolidayDetails(holiday));
      }
      resultsDiv.appendChild(btn);
  });

  const prevButton = document.getElementById('prev-button');
  const nextButton = document.getElementById('next-button');

  prevButton.style.display = currentPage > 1 ? 'block' : 'none';
  nextButton.style.display = currentPage < totalPages ? 'block' : 'none';
}


// Закрытие модального окна при нажатии на "Закрыть"
document.getElementById('close-modal').onclick = function() {
  document.getElementById('modal').style.display = "none";
};

// Закрытие модального окна при клике вне него
window.addEventListener('click', function(event) {
  const modal = document.getElementById('modal');
  if (event.target === modal) {
      modal.style.display = "none";
  }
});



// Код для получения текущей даты
const today = new Date();
const options = { year: 'numeric', month: 'long', day: 'numeric' };
const formattedDate = today.toLocaleDateString('ru-RU', options);
document.getElementById('today-date').textContent = formattedDate;

// Функция для отображения праздников сегодня
function displayTodayHolidays() {
  const holidaysList = document.getElementById('holidays-list');
  holidaysList.innerHTML = ''; // Очистить предыдущие результаты

  const today = new Date();
  const currentYear = today.getFullYear(); // Получаем текущий год
  const currentMonth = today.getMonth();
  const currentDate = today.getDate();

  const todayHolidays = holidays.filter(holiday => {
      const holidayDate = new Date(holiday.date);
      return holidayDate.getMonth() === currentMonth && 
             holidayDate.getDate() === currentDate;
  });

  const limitedHolidays = todayHolidays.slice(0, 12); // Ограничиваем до 12 праздников

  if (limitedHolidays.length === 0) {
    const noHolidaysItem = document.createElement('li');
    noHolidaysItem.textContent = 'Сегодня праздников нет.';
    holidaysList.appendChild(noHolidaysItem);
    return; // Завершаем функцию, если праздников нет
  }


  limitedHolidays.forEach(holiday => {
      const holidayDate = new Date(holiday.date);
      // Устанавливаем год праздника в соответствии с текущим годом
      holidayDate.setFullYear(currentYear);

      const formattedHolidayDate = holidayDate.toLocaleDateString('ru-RU');

      const holidayItem = document.createElement('li');
      holidayItem.className = 'holiday-item';
      holidayItem.innerHTML = `
          <div class="holiday-content">
              <span class="holiday-date">${formattedHolidayDate}</span>
              <span class="holiday-name">${holiday.name}</span>
              <span class="holiday-country">(${holiday.country})</span>
          </div>
      `;
      holidaysList.appendChild(holidayItem);
  });
}

// Вызываем функцию, чтобы отобразить праздники при загрузке страницы или когда необходимо
displayTodayHolidays(); // Важно вызвать функцию, чтобы праздники отобразились!




// Вызов функции для отображения праздников сегодня
displayTodayHolidays();
document.addEventListener("DOMContentLoaded", function() {
  const loader = document.getElementById("loader");
  const content = document.querySelector(".content");

  // Убираем лоадер и показываем контент через 3 секунды
  setTimeout(() => {
      loader.style.display = "none"; // Скрываем лоадер
      content.style.display = "block"; // Показываем контент
  }, 2000); // Время загрузки 3 секунды
});
document.addEventListener('DOMContentLoaded', function() {
  const footerContent = document.querySelector('.footer-content');
  if (footerContent) {
    footerContent.classList.add('visible');
  }
});
// JavaScript код для работы модального окна
var modal = document.getElementById("myCustomModal");
var btn = document.getElementById("myBtn");
var span = document.getElementsByClassName("close")[0];

btn.onclick = function() {
    // Устанавливаем display перед тем, как показать
    modal.style.display = "block"; 
    setTimeout(function() {
        modal.classList.add("show"); // Добавляем класс, чтобы анимация сработала
    }, 10); // Небольшая задержка для того, чтобы класс применился после изменения стиля
}

span.onclick = function() {
    closeModal();
}

window.onclick = function(event) {
    if (event.target == modal) {
        closeModal();
    }
}

document.addEventListener('keydown', function(event) {
    if (event.key === "Escape") { // Закрытие модального окна по клавише ESC
        closeModal();
    }
});

function closeModal() {
    modal.classList.remove("show");
    setTimeout(function() {
        modal.style.display = "none"; // Скрыть модальное окно после анимации
    }, 500); // Время должно совпадать с длительностью анимации
}
document.getElementById('toggleMenu').addEventListener('click', function() {
        const menu = document.getElementById('menu');
        if (menu.classList.contains('hidden')) {
            menu.classList.remove('hidden');
            this.textContent = 'Скрыть меню'; // Обновляем текст кнопки
        } else {
            menu.classList.add('hidden');
            this.textContent = 'Показать меню'; // Обновляем текст кнопки
        }
    });